{
  "target": "building/storage.md",
  "translate": {
    "<p class=\"intro\">Storage is an easy way to store key/value pairs and JSON objects.":
            "<p class=\"intro\">Storageは、keyとvalueのセットで簡単に保存できる方法で、JSON objectsも使えます。",

    "Storage uses a variety of storage engines underneath, picking the best one available":
            "Storageは、さまざまなストレージエンジンを利用することができ、プラットフォームに応じて利用可能な",

    "depending on the platform.</p>": "最も適したものを選びます。</p>",

    "When running in a native app context, Storage will prioritize using SQLite, as it's one of":
            "ネイティブアプリとしてアプリケーションを実行する場合、Storageは最も安定して広く使用されているファイルベースの",

    "the most stable and widely used file-based databases, and avoids some of the":
            "データベースの1つであるSQLiteを使用することを優先し、",

    "pitfalls of things like localstorage and IndexedDB, such as the OS deciding to clear out such":
            "ディスク容量が少ない状況では落とし穴となるlocalstorageや",

    "data in low disk-space situations.":
            "IndexedDBといったストレージエンジンを避けます。",

    "When running in the web or as a Progressive Web App, Storage will attempt to use":
            "WebまたはProgressive Web Appとして実行している場合、StorageはIndexedDB、WebSQL、",

    "IndexedDB, WebSQL, and localstorage, in that order.":
            "localstorageの順に使用しようとします。",

    "## Usage":
            "## 使い方",

    "First, if you'd like to use SQLite, install the cordova-sqlite-storage plugin:":
            "SQLiteを使いたい場合は、cordova-sqlite-storageプラグインをインストールしてください。",

    "Next, install the package (comes by default for Ionic apps > Ionic V1):":
            "パッケージをインストールします（Ionic v1以上のバージョンのIonicアプリで利用ください）。",

    "Next, add it to the imports list in your `NgModule` declaration (for example, in `src/app/app.module.ts`):":
            "`NgModule` デコレーターに追加します (例えば`src/app/app.module.ts`に追加ください):",

    "Finally, inject it into any of your components or pages:":
            "最後に、ComponentやPageにStorageを挿入します。",

    "### Configuring Storage":
            "### Storageの設定",

    "Note: Any custom configurations will be merged with the default configuration":
            "Note: どのカスタム設定も、デフォルトの設定と統合されます"
  }
}