{
  "target": "components.md",
  "translate": {

    "title: Components":
    "title: コンポーネント",

    "  Ionic apps are made of high-level building blocks called components.":
    "  Ionicアプリは、コンポーネントと呼ばれる高レイヤーの構成要素で構成されています。",

    "  Components allow you to quickly construct an interface for your app. Ionic":
    "  コンポーネントを使用すると、アプリのインターフェイスをすばやく構築することができます。Ionicには、",

    "  comes with a number of components, including modals, popups, and cards. Check":
    "  modals、popups、cardsなど、さまざまなコンポーネントが用意されています。",

    "  out the examples below to see what each component looks like and to learn how":
    "  以下の例を確認して、各コンポーネントの外観と各コンポーネントの使用方法を確認してください。",

    "  to use each one. Once you’re familiar with the basics, head over to the [API":
    "  基本に慣れたら、各コンポーネントをカスタマイズする方法についてのアイデアを得るために[API",

    "  docs](/docs/api) for ideas on how to customize each component.":
    "  docs](/docs/api)をご覧ください。",

    "Alerts are a great way to offer the user the ability to choose a specific action or list of actions. Alerts can include contain text, inputs and buttons. They can provide the user with important information, or require them to make a decision (or multiple decisions). Alerts should only be used for quick actions like password verification, small app notifications, or quick options.":
    "Alertは、特定のアクションまたはアクションのリストを選択する機能を、ユーザーに提供するための優れた方法です。Alertには、texts、inputs、buttonsを含めることができます。それらはユーザーに重要な情報を提供するか、または彼らに決定（または複数の決定）をするように要求することができます。Alertは、パスワードの確認、小さなアプリの通知、クイックオプションなどの素早いアクションにのみ使用します。",

    "Action Sheets slide up from the bottom edge of the device screen, and display a set of options with the ability to confirm or cancel an action. Action Sheets can sometimes be used as an alternative to menus, however, they should not be used for navigation.":
    "Action Sheetは、デバイス画面の下端から上にスライドし、一連のオプションを表示して、アクションを確認または取り消すことができます。Action Sheetはメニューの代わりに使用することがありますが、ナビゲーションには使用しないでください。",

    "The Badge component is a small component that typically communicates a numerical value to the user. They are normally used within an item.":
    "Badgeコンポーネントは、通常は数値をユーザーに伝えるための小さなコンポーネントです。それらは通常itemの中で使用されます。",

    "Buttons are an essential way to interact with and navigate through an app, and should clearly communicate what action will occur after the user taps them. Buttons are highly customizeable with color, shape and size being fully customizeable. We support round buttons, FAB buttons, outline buttons and more!":
    "Buttonはアプリと対話したり、アプリ内を移動したりするのに不可欠な方法であり、ユーザーがButtonをタップした後に発生するアクションを明確に伝える必要があります。Buttonは色、形、大きさが完全にカスタマイズ可能で非常にカスタマイズ可能です。丸いButton、FAB Button、アウトラインを表示するButtonなどをサポートします。",

    "Card components are a great way to display important pieces of content, and are quickly emerging as a core design":
    "Cardは重要なコンテンツを表示するのに最適な方法であり、アプリのコアとなるデザインパターンとして急速に浮上しています。",

    "pattern for apps. Cards can contain images, buttons, text and more. Cards can also be used standalone, in a list or in":
    "Cardには画像、button、textなどを含めることができます。Cardは単独でも利用できますし、",

    "a grid.":
    "listやgridの中でも使用できます。",

    "A checkbox can be used to let the user know they need to make a binary decision. It provides a clear visual of either a true or false choice. ion-checkbox should always be used with ion-item. If you prefer the look of radio inputs, you can also use `ion-radio` or if you prefer toggles you can use `ion-toggle`.":
    "Checkboxを使用して、択一の決定をする必要があることをユーザーに知らせることができます。それは正しいか間違った選択のどちらかの明確な視覚を提供します。ion-checkbox は常に ion-item と共に使用されるべきです。あなたがradio入力の外観を好むならば`ion-radio`、トグルを好むなら`ion-toggle`も使うことができます。",

    "DateTime is used to present an interface which makes it easy for users to select dates and times. Datetime will look like a native iOS date picker when rendered on an iOS device and will have a material look on all other platforms. Datetime should always be used within an `ion-item`.":
    "DateTimeは、ユーザーが日付と時刻を簡単に選択できるようにするためのインターフェースを提示するために使用します。iOSデバイスでレンダリングすると、DatetimeはネイティブのiOS日付ピッカーのように見え、他のすべてのプラットフォームではMaterial Designになります。Datetimeは常に`ion-item`内で使用されるべきです。",

    "A floating action button (FAB) is a circular button that performs the primary, or most common, action on a screen. It floats above the content of the page and is normally colored either the primary or secondary color of the app. FAB buttons can also be positioned easily using the `horizontal`, `vertical` and `slot` attributes.":
    "フローティングアクションボタン（FAB）は、画面上で主要な、または最も一般的なアクションを実行する円形のボタンです。これはページのコンテンツの上に浮かび、通常はアプリの一次色または二次色のどちらかに着色されます。FABボタンは`horizontal`、`vertical`、`slot`属性を使用して簡単に配置することもできます。",

    "Grid is a powerful mobile-first system for building custom layouts. The Grid component can be used to ensure your app looks great on any device. It is heavily influenced by Bootstrap's grid system.":
    "グリッドはカスタムレイアウトを構築するための強力なモバイルファーストシステムです。Gridコンポーネントを使用して、アプリがどのデバイスでも美しく見えるようにすることができます。これはBootstrapのグリッドシステムの影響を強く受けます。",

    "An infinite scroll allows you to perform an action when the user scrolls a specified distance from the bottom or top of the page, such as loading more data in a long list of paginated data. It is also very customizeable with different loading indicators supported.":
    "Infinite Scrollを使用すると、区切りのある長いリストに、さらにデータをロードするなど、ユーザーがページの下部または上部から指定された距離をスクロールしたときにアクションを実行できます。また、ローディングアニメーションのカスタマイズをすることが可能です。",

    "Inputs allow users to enter data into a UI. They typically appear in forms and dialogs. They should always be wrapped with an `ion-item`.":
    "Inputsは、ユーザーにデータを入力するUIを提供します。通常Formやダイアログで使われます。いつも`ion-item`の中で使うべきです。",

    "The list component is used to display rows of information, such as a contact list, playlist, or menu. It can display cards, list items and more. Lists are also very customizeable and match the design of the native Android and iOS lists by default.":
    "Listコンポーネントは、連絡先リスト、プレイリスト、メニューなどの情報行を表示するために使用されます。cards、itemsのリストなどを表示できます。Listsもとてもカスタマイズでき、デフォルトでネイティブのAndroidおよびiOSリストのデザインと一致します。",

    "Loading is an overlay that prevents user interaction while indicating activity.":
    "Loadingは、アクティビティを表示しながらユーザーの操作を妨げるオーバーレイです。",

    "Menus are a common navigation pattern for apps. Menus can either be permanently on-screen (split-pane), swiped into view or toggled through a menu button.":
    "Menuはアプリの一般的なナビゲーションパターンです。メニューは恒久的に画面上（split-pane）に表示されるか、ビュー内にスワイプされるか、またはメニューボタンを介して切り替えることができます。",

    "Modals slide in and off screen to display a temporary UI. Modals are often used for login or signup pages, message composition,and option selection.":
    "Modalは、一時的なUIを表示するために画面内および画面外にスライドします。Modalは、ログインページまたはサインアップページ、メッセージの作成、およびオプションの選択によく使用されます。",

    "Navigation is how users move between different pages in your app. Ionic’s navigation follows standard navigation concepts and animated transitions. Ionic's nav can also adapt to larger viewports using [ion-split-pane](/docs/api/split-pane)":
    "Navは、ユーザーがアプリ内の異なるページ間を移動する方法です。Ionicのナビゲーションは、標準的なナビゲーションの概念とアニメーションによるトランジションに従います。Ionicのナビゲーションは[ion-split-pane](/docs/api/split-pane)を使って大きなビューポートにも適応できます。",

    "The Popover is a view that floats above an app’s content. Popovers provide an easy way to present or gather information from the user and are commonly used in the following situations:":
    "Popoverは、アプリのコンテンツの上に浮かぶビューです。Popoverは、ユーザーから情報を提示または収集するための簡単な方法を提供します。一般に、以下の状況で使用されます。",

    "- Show more info about the current view":
    "- 現在のビューに関する詳細情報を表示する",

    "- Select a commonly used tool or configuration":
    "- よく使用されるツールまたは構成を選択する",

    "- Present a list of actions to perform inside one of your views":
    "- 自分の意見の1つの中で実行するアクションのリストを提示する",

    "A Range is a form control that lets users select from a range of values by moving a slider knob along the slider bar. Range must always be wrapped in an `ion-item`":
    "Rangeは、ユーザーがスライダーバーに沿ってスライダーノブを動かすことによって値を範囲から選択することを可能にするForm Controlです。Rangeは常に`ion-item`で囲む必要があります。",

    "Refresh provides pull-to-refresh functionality on a content component. A common use case for the refresher component is to reload data.":
    "Refresherは、コンテンツコンポーネントの更新機能を提供します。Refresherコンポーネントの一般的な使用例はデータの再ロードです。",

    "Searchbars are used to search or filter items. They are normally used inside an `ion-toolbar`.":
    "Searchbarは、アイテムを検索またはフィルタリングするために使用されます。それらは通常`ion-toolbar`の中で使われます。",

    "The ion-select component is similar to an HTML `<select>` element, however, Ionic’s select component makes it easier for users to sort through and select the preferred option. It also matches the look of the native Android and iOS select inputs. It must be wrapped in an `ion-item`.":
    "ion-selectコンポーネントはHTMLの`<select>`要素に似ていますが、Ionicのselectコンポーネントはユーザーが好みのオプションを使って選択するのをより簡単にします。また、ネイティブのAndroidとiOSの選択入力の外観にも一致します。`ion-item`に包まれなければなりません。",

    "Slides make it easy to create complex UI such as galleries, tutorials, and page-based layouts.":
    "Slidesを使用すると、ギャラリー、チュートリアル、ページベースのレイアウトなどの複雑なUIを簡単に作成できます。",

    "The `ion-spinner` component provides a variety of animated SVG spinners. Spinners enables you to give users feedback that the app is actively processing/thinking/waiting/chillin’ out, or whatever you’d like it to indicate.":
    "`ion-spinner`コンポーネントは、さまざまなアニメーションのSVGスピナーを提供します。Spinnersを使用すると、アプリがアクティブに処理中、検討中、待機中、まったりしていること、または表示したいことをユーザーにフィードバックすることができます。",

    "Tabs enable tabbed navigation, a standard navigation pattern in modern apps. Tabs can display an icon and label to give the user visual feedback of where they are in the app. Tabs can also easily be placed at the top of an app, although by default they are placed at the bottom to match the Material Design and iOS design guidelines.":
    "Tabsを使用すると、タブ付きナビゲーション、つまり現代のアプリケーションの標準的なナビゲーションパターンが有効になります。タブにはアイコンとラベルを表示して、アプリ内のどこにいるかを視覚的にフィードバックすることができます。Tabsはアプリの上部に簡単に配置することもできますが、デフォルトではマテリアルデザインとiOSのデザインガイドラインに合わせて下部に配置されます。",

    "The toast component is a subtle notification that appears on top of an app’s content. The toast component can be used to display a short message to the user. Toasts are displayed full width across the bottom of your app on mobile. On tablet / desktop devices the toast will be centered and not full width.":
    "Toastコンポーネントは、アプリのコンテンツの上に表示される瞬間的な通知です。Toastコンポーネントは、短いメッセージをユーザーに表示するために使用できます。Toastは、モバイルのアプリの下部に幅いっぱいに表示されます。タブレット/デスクトップデバイスでは、Toastは中央に配置され、全幅には配置されません。",

    "Virtual Scroll is a virtual list that allows you to performantly scroll through huge lists. Virtual Scroll only renders the items that are currently being viewed in the list.":
    "Virtual Scrollは、膨大なアイテム数のリストを効果的にスクロールするためのVirtual Scrollを提供します。Virtual Scrollは、現在表示されている項目のみをレンダリングします。"
  }
}