{
  "target": "src/pages/api/action-sheet.json",
  "translate": {
    "body": {
      "original": "\n  <p class=\"intro\">An Action Sheet is a dialog that displays a set of options. It appears on top of the app's content, and must be manually dismissed by the user before they can resume interaction with the app. Destructive options are made obvious in <code>ios</code> mode. There are multiple ways to dismiss the action sheet, including tapping the backdrop or hitting the escape key on desktop.</p>\n\n    <h3 id=\"creating\">\n      <a href=\"#creating\">Creating</a>\n    </h3>\n  <p>An action sheet can be created by the <stencil-route-link url=\"/docs/api/action-sheet-controller\">Action Sheet Controller</stencil-route-link> from an array of <code>buttons</code>, with each button including properties for its <code>text</code>, and optionally a <code>handler</code> and <code>role</code>. If a handler returns <code>false</code> then the action sheet will not be dismissed. An action sheet can also optionally have a <code>title</code>, <code>subTitle</code> and an <code>icon</code>.</p>\n\n    <h3 id=\"buttons\">\n      <a href=\"#buttons\">Buttons</a>\n    </h3>\n  <p>A button's <code>role</code> property can either be <code>destructive</code> or <code>cancel</code>. Buttons without a role property will have the default look for the platform. Buttons with the <code>cancel</code> role will always load as the bottom button, no matter where they are in the array. All other buttons will be displayed in the order they have been added to the <code>buttons</code> array. Note: We recommend that <code>destructive</code> buttons are always the first button in the array, making them the top button. Additionally, if the action sheet is dismissed by tapping the backdrop, then it will fire the handler from the button with the cancel role.</p>\n",
      "translate": "\n  <p class=\"intro\">Action Sheetは複数の選択肢を表示するダイアログです。アプリのコンテンツ上に表示され、ユーザが手動で破棄しないとアプリの利用を再開することはできません。<code>ios</code> modeでは、破壊的な選択肢は明示されます（コンテンツの削除などは赤字などでわかりやすく表示されます）。Action Sheetを破棄するには、背景をタップする、デスクトップのパソコンの場合はエスケープキーを押すなど、複数の選択肢があります。</p>\n\n    <h3 id=\"creating\">\n      <a href=\"#creating\">Creating</a>\n    </h3>\n  <p>Action Sheetは、<stencil-route-link url=\"/docs/api/action-sheet-controller\">Action Sheet Controller</stencil-route-link> を使って、<code>buttons</code> とそれぞれのボタンごとに <code>text</code> とオプションで <code>handler</code> と <code>role</code> をつけて作成します。handlerの返り値が <code>false</code> の場合、Action Sheetは破棄されません。Action Sheetはオプションで <code>title</code> <code>subTitle</code> <code>icon</code> を持つことができます。</p>\n\n    <h3 id=\"buttons\">\n      <a href=\"#buttons\">Buttons</a>\n    </h3>\n  <p>Buttonの <code>role</code> プロパティは、 <code>destructive</code> か <code>cancel</code> のどちらかを利用できます。roleプロパティがない場合は、プラットフォームに応じたデフォルトの外観となります。<code>cancel</code> role を持つButtonは、 <code>buttons</code> 配列のどこに配置してもAction Sheetの最下部に表示されます。Note: <code>destructive</code> roleをつけるButtonは、一番上のButtonとして配置することをおすすめします。また、背景をタップしてAction Sheetを破棄した場合、キャンセル role に設定されているhandlerが実行されます。</p>\n"
    }
  }
}
