{
  "If `true`, all accordions inside of the accordion group will animate when expanding or collapsing.": "`true`の場合、アコーディオングループ内のすべてのアコーディオンが拡大・縮小時にアニメーションを行います。",
  "If `true`, the accordion group cannot be interacted with.": "`true`の場合、アコーディオングループと対話することができません。",
  "Describes the expansion behavior for each accordion. Possible values are `\"compact\"` and `\"inset\"`. Defaults to `\"compact\"`.": "各アコーディオンの拡張動作を記述します。指定可能な値は `\"compact\"` と `\"inset\"` です。デフォルトは `\"compact\"` です。",
  "The mode determines which platform styles to use.": "modeは、どのプラットフォームのスタイルを使用するかを決定します。",
  "If `true`, the accordion group can have multiple accordion components expanded at the same time.": "`true`の場合、アコーディオングループは複数のアコーディオンコンポーネントを同時に展開することができます。",
  "If `true`, the accordion group cannot be interacted with, but does not alter the opacity.": "`true`の場合、アコーディオングループはインタラクティブに操作できないが、不透明度は変更されない。",
  "The value of the accordion group. This controls which accordions are expanded. This should be an array of strings only when `multiple=\"true\"`": "アコーディオングループの値です。これは、どのアコーディオンを展開するかを制御します。これは、`multiple=\"true\"`のときだけ、文字列の配列でなければなりません。",
  "Emitted when the value property has changed as a result of a user action such as a click.  This event will not emit when programmatically setting the `value` property.": "valueプロパティがクリックなどのユーザーアクションによって変更されたときに発行される。  プログラムで `value` プロパティを設定した場合には、このイベントは発生しない。",
  "If `true`, the accordion cannot be interacted with.": "`true`の場合、アコーディオンは対話することができません。",
  "If `true`, the accordion cannot be interacted with, but does not alter the opacity.": "`true`の場合、アコーディオンはインタラクティブに操作することはできませんが、不透明度は変化しません。",
  "The toggle icon to use. This icon will be rotated when the accordion is expanded or collapsed.": "使用するトグルアイコンです。このアイコンは、アコーディオンの展開・折りたたみ時に回転されます。",
  "The slot inside of `ion-item` to place the toggle icon. Defaults to `\"end\"`.": "トグルアイコンを配置する `ion-item` の内側のスロット。デフォルトは `\"end\"` です。",
  "The value of the accordion. Defaults to an autogenerated value.": "アコーディオンの値です。デフォルトは自動生成された値です。",
  "Content is placed below the header and is shown or hidden based on expanded state.": "コンテンツはヘッダーの下に配置され、展開状態に応じて表示または非表示になります。",
  "Content is placed at the top and is used to expand or collapse the accordion item.": "コンテンツは上部に配置され、アコーディオンアイテムの拡大・縮小に使用されます。",
  "The wrapper element for the content slot.": "content slotのラッパー要素。",
  "The expanded element. Can be used in combination with the `header` and `content` parts (i.e. `::part(header expanded)`).": "拡張された要素です。 `header` と `content` の部分を組み合わせて使用することができます（例：`::part(header expanded)`）。",
  "The wrapper element for the header slot.": "header slotのラッパーの要素です。",
  "If `true`, the action sheet will animate.": "`true`の場合、アクションシートはアニメーションを行います。",
  "If `true`, the action sheet will be dismissed when the backdrop is clicked.": "`true`の場合、バックドロップがクリックされるとアクションシートが解除されます。",
  "An array of buttons for the action sheet.": "アクションシートのボタンの配列です。",
  "Additional classes to apply for custom CSS. If multiple classes are provided they should be separated by spaces.": "カスタムCSSに適用する追加のクラス。複数のクラスを指定する場合は、スペースで区切る必要があります。",
  "Animation to use when the action sheet is presented.": "アクションシートの提示時に使用するアニメーションです。",
  "Title for the action sheet.": "アクションシートのタイトルです。",
  "Additional attributes to pass to the action sheet.": "アクションシートに渡す追加属性。",
  "If `true`, the action sheet will open. If `false`, the action sheet will close. Use this if you need finer grained control over presentation, otherwise just use the actionSheetController or the `trigger` property. Note: `isOpen` will not automatically be set back to `false` when the action sheet dismisses. You will need to do that in your code.": "`true`の場合、アクションシートは開かれます。`false`の場合、アクションシートは閉じます。プレゼンテーションの細かな制御が必要な場合はこれを使用し、そうでない場合は actionSheetController または `trigger` プロパティを使用します。注意: アクションシートが終了しても、`isOpen`は自動的に`false`に戻されません。あなたのコードでそれを行う必要があります。",
  "If `true`, the keyboard will be automatically dismissed when the overlay is presented.": "`true`の場合、オーバーレイが表示されたときにキーボードが自動的に解除されます。",
  "Animation to use when the action sheet is dismissed.": "アクションシートが解除されたときに使用するアニメーションです。",
  "Subtitle for the action sheet.": "アクションシートのサブタイトルです。",
  "If `true`, the action sheet will be translucent. Only applies when the mode is `\"ios\"` and the device supports [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility).": "`true`の場合、アクションシートは半透明になります。modeが `\"ios\"` で、デバイスが [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility) をサポートしている場合にのみ適用されます。",
  "An ID corresponding to the trigger element that causes the action sheet to open when clicked.": "クリックするとアクションシートが開くトリガー要素に対応するID。",
  "Dismiss the action sheet overlay after it has been presented. This is a no-op if the overlay has not been presented yet. If you want to remove an overlay from the DOM that was never presented, use the [remove](https://developer.mozilla.org/en-US/docs/Web/API/Element/remove) method.": "アクションシートのオーバーレイが表示された後に閉じます。オーバーレイがまだ表示されていない場合は何もしません。表示されなかったオーバーレイを DOM から削除するには、[remove](https://developer.mozilla.org/en-US/docs/Web/API/Element/remove) メソッドを使用してください。",
  "Returns a promise that resolves when the action sheet did dismiss.": "アクションシートが解散したときに解決するPromiseを返します。",
  "Returns a promise that resolves when the action sheet will dismiss.": "アクションシートが解散するタイミングを解決するPromiseを返します。",
  "Present the action sheet overlay after it has been created.": "アクションシートのオーバーレイを作成後に提示します。",
  "Emitted after the action sheet has dismissed. Shorthand for ionActionSheetDidDismiss.": "アクションシートが解散した後に発行されます。ionActionSheetDidDismissの略記。",
  "Emitted after the action sheet has presented. Shorthand for ionActionSheetWillDismiss.": "アクションシートが提示された後に発行されます。ionActionSheetWillDismissの略語。",
  "Emitted after the action sheet has dismissed.": "アクションシートが解散した後に発行されます。",
  "Emitted after the action sheet has presented.": "アクションシートが提示された後に発行されます。",
  "Emitted before the action sheet has dismissed.": "アクションシートが解散する前に発行されます。",
  "Emitted before the action sheet has presented.": "アクションシートが提示される前に発行されます。",
  "Emitted before the action sheet has dismissed. Shorthand for ionActionSheetWillDismiss.": "アクションシートが解散する前に発行されます。ionActionSheetWillDismissの略記。",
  "Emitted before the action sheet has presented. Shorthand for ionActionSheetWillPresent.": "アクションシートが提示される前に発行されます。ionActionSheetWillPresentの略記。",
  "Opacity of the backdrop": "背景の不透明度",
  "Background of the action sheet group": "アクションシートグループの背景",
  "Background of the action sheet button": "アクションシートボタンの背景",
  "Background of the action sheet button when pressed. Note: setting this will interfere with the Material Design ripple.": "アクションシートボタンが押されたときの背景。注意：これを設定すると、Material Designの波紋に干渉します。",
  "Opacity of the action sheet button background when pressed": "アクションシートボタンが押されたときの背景の不透明度",
  "Background of the action sheet button when tabbed to": "タブで移動したときのアクションシートボタンの背景。",
  "Opacity of the action sheet button background when tabbed to": "タブで移動したときのアクションシートボタンの背景の不透明度。",
  "Background of the action sheet button on hover": "ホバー時のアクションシートボタンの背景",
  "Opacity of the action sheet button background on hover": "ホバー時のアクションシートボタンの背景の不透明度",
  "Background of the selected action sheet button": "選択したアクションシートボタンの背景",
  "Opacity of the selected action sheet button background": "選択されたアクションシートボタンの背景の不透明度",
  "Color of the action sheet button": "アクションシートボタンの色",
  "Color of the action sheet button when pressed": "アクションシートボタンが押されたときの色",
  "Color of the selected action sheet button when disabled": "無効時の選択されたアクション・シート・ボタンの色",
  "Color of the action sheet button when tabbed to": "タブで移動したときのアクションシートのボタンの色。",
  "Color of the action sheet button on hover": "ホバー時のアクションシートボタンの色",
  "Color of the selected action sheet button": "選択されたアクションシートのボタンの色",
  "Color of the action sheet text": "アクションシートテキストの色",
  "height of the action sheet": "アクションシートの高さ",
  "Maximum height of the action sheet": "アクションシートの最大の高さ",
  "Maximum width of the action sheet": "アクションシートの最大幅",
  "Minimum height of the action sheet": "アクションシートの最小高さ",
  "Minimum width of the action sheet": "アクションシートの最小幅",
  "Width of the action sheet": "アクションシートの横幅",
  "If `true`, the alert will animate.": "`true`の場合、アラートはアニメーションで表示されます。",
  "If `true`, the alert will be dismissed when the backdrop is clicked.": "`true`の場合、バックドロップがクリックされるとアラートが解除される。",
  "Array of buttons to be added to the alert.": "アラートに追加されるボタンの配列。",
  "Animation to use when the alert is presented.": "アラート提示時に使用するアニメーションです。",
  "The main title in the heading of the alert.": "アラートの見出しにあるメインタイトルです。",
  "Additional attributes to pass to the alert.": "アラートに渡す追加属性。",
  "Array of input to show in the alert.": "アラートに表示するInputの配列。",
  "If `true`, the alert will open. If `false`, the alert will close. Use this if you need finer grained control over presentation, otherwise just use the alertController or the `trigger` property. Note: `isOpen` will not automatically be set back to `false` when the alert dismisses. You will need to do that in your code.": "`true`の場合、アラートは開く。もし `false` ならば、アラートは閉じます。alertControllerや`trigger`プロパティを使用してください。注意: アラートが終了しても `isOpen` は自動的に `false` に戻りません。あなたのコードでそれを行う必要があります。",
  "Animation to use when the alert is dismissed.": "アラートが解除されたときに使用するアニメーション。",
  "The main message to be displayed in the alert. `message` can accept either plaintext or HTML as a string. To display characters normally reserved for HTML, they must be escaped. For example `<Ionic>` would become `&lt;Ionic&gt;`  For more information: [Security Documentation](https://ionicframework.com/docs/faq/security)  This property accepts custom HTML as a string. Content is parsed as plaintext by default. `innerHTMLTemplatesEnabled` must be set to `true` in the Ionic config before custom HTML can be used.": "アラートに表示されるメインメッセージ。`message`には、文字列としてプレーンテキストまたはHTMLのいずれかを指定することができます。通常HTML用に予約されている文字を表示するには、エスケープする必要があります。例えば、`<Ionic>`は `&lt;Ionic&gt;` になります：[セキュリティ・ドキュメント](https://ionicframework.com/docs/faq/security) このプロパティは、カスタムHTMLを文字列として受け付けます。デフォルトでは、コンテンツはプレーンテキストとしてパースされます。カスタムHTMLを使用するには、Ionicの設定で `innerHTMLTemplatesEnabled` を `true` に設定する必要があります。",
  "The subtitle in the heading of the alert. Displayed under the title.": "アラートの見出しにあるサブタイトルです。タイトルの下に表示されます。",
  "If `true`, the alert will be translucent. Only applies when the mode is `\"ios\"` and the device supports [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility).": "`true`の場合、アラートは半透明になります。modeが `\"ios\"` で、デバイスが [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility) をサポートしている場合にのみ適用されます。",
  "An ID corresponding to the trigger element that causes the alert to open when clicked.": "クリックされるとアラートが開くトリガー要素に対応するID。",
  "Dismiss the alert overlay after it has been presented. This is a no-op if the overlay has not been presented yet. If you want to remove an overlay from the DOM that was never presented, use the [remove](https://developer.mozilla.org/en-US/docs/Web/API/Element/remove) method.": "アラートのオーバーレイが表示された後に閉じます。オーバーレイがまだ表示されていない場合は何もしません。表示されなかったオーバーレイを DOM から削除するには、[remove](https://developer.mozilla.org/en-US/docs/Web/API/Element/remove) メソッドを使用してください。",
  "Returns a promise that resolves when the alert did dismiss.": "アラートが解除されたことを解決するPromiseを返します。",
  "Returns a promise that resolves when the alert will dismiss.": "アラートが解除されるタイミングを解決するPromiseを返します。",
  "Present the alert overlay after it has been created.": "アラートオーバーレイを作成した後に提示します。",
  "Emitted after the alert has dismissed. Shorthand for ionAlertDidDismiss.": "アラートが解除された後に発行されます。ionAlertDidDismissの略記。",
  "Emitted after the alert has presented. Shorthand for ionAlertWillDismiss.": "アラートが提示された後に発行されます。ionAlertWillDismissの略記。",
  "Emitted after the alert has dismissed.": "アラートが解除された後に発行されます。",
  "Emitted after the alert has presented.": "アラートが提示された後に発行されます。",
  "Emitted before the alert has dismissed.": "アラートが解除される前に発行されます。",
  "Emitted before the alert has presented.": "アラートが提示される前に発行されます。",
  "Emitted before the alert has dismissed. Shorthand for ionAlertWillDismiss.": "アラートが解除される前に発行されます。ionAlertWillDismissの略記。",
  "Emitted before the alert has presented. Shorthand for ionAlertWillPresent.": "アラートが提示される前に発行されます。ionAlertWillPresentの略記。",
  "Background of the alert": "注意喚起の背景",
  "Height of the alert": "アラートの高さ",
  "Maximum height of the alert": "アラートの最大の高さ",
  "Maximum width of the alert": "アラートの最大幅",
  "Minimum height of the alert": "アラートの最小の高さ",
  "Minimum width of the alert": "アラートの最小幅",
  "Width of the alert": "アラートの幅",
  "Used to set focus on an element that uses `ion-focusable`. Do not use this if focusing the element as a result of a keyboard event as the focus utility should handle this for us. This method should be used when we want to programmatically focus an element as a result of another user action. (Ex: We focus the first element inside of a popover when the user presents it, but the popover is not always presented as a result of keyboard action.)": "`ion-focusable`を使用している要素にフォーカスを設定するために使用する。キーボードイベントの結果として要素にフォーカスを当てる場合は、このメソッドを使用しないでください。このメソッドは、他のユーザアクションの結果としてプログラム的に要素にフォーカスを当てたい場合に使用します。(例: ユーザーがポップオーバーを提示したときに、ポップオーバー内の最初の要素にフォーカスを当てますが、ポップオーバーは常にキーボード操作の結果として提示されるわけではありません)。",
  "Border radius of the avatar and inner image": "アバターとインナーイメージの境界半径",
  "The color to use from your application's color palette. Default options are: `\"primary\"`, `\"secondary\"`, `\"tertiary\"`, `\"success\"`, `\"warning\"`, `\"danger\"`, `\"light\"`, `\"medium\"`, and `\"dark\"`. For more information on colors, see [theming](/docs/theming/basics).": "アプリケーションのカラーパレットから使用する色を指定します。デフォルトのオプションは以下の通りです。 `\"primary\"`, `\"secondary\"`, `\"tertiary\"`, `\"success\"`, `\"warning\"`, `\"danger\"`, `\"light\"`, `\"medium\"`, と `\"dark\"` です．色に関する詳しい情報は [theming](/docs/theming/basics) を参照してください。",
  "The url to navigate back to by default when there is no history.": "履歴がない場合に、デフォルトで戻るためのURL。",
  "If `true`, the user cannot interact with the button.": "`true`の場合、ユーザはボタンと対話することができません。",
  "The built-in named SVG icon name or the exact `src` of an SVG file to use for the back button.": "戻るボタンに使用する内蔵の名前付きSVGアイコン名またはSVGファイルの正確な`src`を指定します。",
  "When using a router, it specifies the transition animation when navigating to another page.": "ルーターを使用する場合、別のページに移動する際の遷移アニメーションを指定します。",
  "The text to display in the back button.": "バックボタンに表示するテキストです。",
  "The type of the button.": "ボタンの種類です。",
  "Background of the button": "ボタンの背景",
  "Background of the button when focused with the tab key": "タブキーでフォーカスしたときのボタンの背景",
  "Opacity of the button background when focused with the tab key": "タブキーでフォーカスしたときのボタンの背景の不透明度",
  "Background of the button on hover": "ホバー時のボタンの背景",
  "Opacity of the background on hover": "ホバー時の背景の不透明度",
  "Border radius of the button": "ボタンの境界半径",
  "Text color of the button": "ボタンの文字色",
  "Text color of the button when focused with the tab key": "タブキーでフォーカスしたときのボタンの文字色",
  "Text color of the button on hover": "ホバー時のボタンの文字色",
  "Font size of the button icon": "ボタンアイコンのFont Size",
  "Font weight of the button icon": "ボタンアイコンのFont Weight",
  "Bottom margin of the button icon": "ボタンアイコンのBottom Margin",
  "Right margin if direction is left-to-right, and left margin if direction is right-to-left of the button icon": "ボタンアイコンの方向が左から右の場合はRight Margin、右から左の場合はLeft Margin",
  "Left margin if direction is left-to-right, and right margin if direction is right-to-left of the button icon": "ボタンアイコンの方向が左から右の場合はLeft Margin、右から左の場合はRight Margin",
  "Top margin of the button icon": "ボタンアイコンのTop Margin",
  "Bottom padding of the button icon": "ボタンアイコンのBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the button icon": "ボタンアイコンの向きが左から右の場合はRight Padding、右から左の場合はLeft Paddingを使用します。",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the button icon": "ボタンアイコンの方向が左から右の場合はLeft Padding、右から左の場合はRight Paddingを使用します。",
  "Top padding of the button icon": "ボタンアイコンのTop Padding",
  "Bottom margin of the button": "ボタンのBottom Margin",
  "Right margin if direction is left-to-right, and left margin if direction is right-to-left of the button": "ボタンの向きが左から右の場合はRight Margin、右から左の場合はLeft Margin",
  "Left margin if direction is left-to-right, and right margin if direction is right-to-left of the button": "ボタンの向きが左から右の場合はLeft Margin、右から左の場合はRight Margin",
  "Top margin of the button": "ボタンのTop Margin",
  "Minimum height of the button": "ボタンの最小高さ",
  "Minimum width of the button": "ボタンの最小幅",
  "Opacity of the button": "ボタンの不透明度",
  "Bottom padding of the button": "ボタンのBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the button": "ボタンの向きが左から右の場合はRight Padding、右から左の場合はLeft Paddingとなります。",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the button": "ボタンの向きが左から右の場合はLeft Padding、右から左の場合はRight Paddingとなります。",
  "Top padding of the button": "ボタンのTop Padding",
  "Color of the button ripple effect": "ボタンリプルエフェクトの色",
  "Transition of the button": "ボタンの遷移",
  "The back button icon (uses ion-icon).": "戻るボタンのアイコン（ion-iconを使用）。",
  "The native HTML button element that wraps all child elements.": "すべての子要素を包むネイティブ HTML ボタン要素。",
  "The back button text.": "戻るボタンのテキストです。",
  "If `true`, the backdrop will stop propagation on tap.": "`true`の場合、バックドロップはタップ時に伝搬を停止します。",
  "If `true`, the backdrop will can be clicked and will emit the `ionBackdropTap` event.": "`true`の場合、背景をクリックすることができ、`ionBackdropTap`イベントを発生させます。",
  "If `true`, the backdrop will be visible.": "`true`の場合、バックドロップが表示されます。",
  "Emitted when the backdrop is tapped.": "バックドロップがタップされたときに発行されます。",
  "Background of the badge": "バッジの背景",
  "Text color of the badge": "バッジの文字色",
  "Bottom padding of the badge": "バッジのBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the badge": "バッジの向きが左から右の場合はRight Padding、右から左の場合はLeft Paddingとなります。",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the badge": "バッジの向きが左から右の場合はLeft Padding、右から左の場合はRight Paddingとなります。",
  "Top padding of the badge": "バッジのTop Padding",
  "If `true`, the breadcrumb will take on a different look to show that it is the currently active breadcrumb. Defaults to `true` for the last breadcrumb if it is not set on any.": "`true`の場合、パンくずが現在アクティブなパンくずであることを示すために、パンくずの外観を変化させることができる。最後のパンくずが設定されていない場合、デフォルトは `true` です。",
  "If `true`, the user cannot interact with the breadcrumb.": "`true`の場合、ユーザーはパンくずと対話することができません。",
  "This attribute instructs browsers to download a URL instead of navigating to it, so the user will be prompted to save it as a local file. If the attribute has a value, it is used as the pre-filled file name in the Save prompt (the user can still change the file name if they want).": "この属性は、ブラウザが URL に移動する代わりに URL をダウンロードするように指示し、ユーザはローカルファイルとして保存するように促されます。この属性に値がある場合、保存のプロンプトであらかじめ入力されたファイル名として使用されます（ユーザーはファイル名を変更することができます）。",
  "Contains a URL or a URL fragment that the hyperlink points to. If this property is set, an anchor tag will be rendered.": "ハイパーリンクが指し示す URL または URL フラグメントを格納します。このプロパティが設定されている場合、アンカータグがレンダリングされます。",
  "Specifies the relationship of the target object to the link object. The value is a space-separated list of [link types](https://developer.mozilla.org/en-US/docs/Web/HTML/Link_types).": "ターゲットオブジェクトとリンクオブジェクトの関係を指定します。値は、スペースで区切られた[リンクタイプ](https://developer.mozilla.org/en-US/docs/Web/HTML/Link_types)のリストです。",
  "When using a router, it specifies the transition animation when navigating to another page using `href`.": "ルータを使用する場合、`href`を使用して別のページに移動する際の遷移アニメーションを指定します。",
  "When using a router, it specifies the transition direction when navigating to another page using `href`.": "ルータを使用する場合、`href`を使用して他のページに移動する際の遷移方向を指定します。",
  "If true, show a separator between this breadcrumb and the next. Defaults to `true` for all breadcrumbs except the last.": "trueの場合、このパンくずと次のパンくずの間にセパレータを表示します。デフォルトは `true` で、最後のパンくずを除くすべてのパンくずが表示されます。",
  "Specifies where to display the linked URL. Only applies when an `href` is provided. Special keywords: `\"_blank\"`, `\"_self\"`, `\"_parent\"`, `\"_top\"`.": "リンク先のURLを表示する場所を指定します。`href`を指定した場合のみ適用される。特別なキーワードがあります。`\"_blank\"`, `\"_self\"`, `\"_parent\"`, `\"_top\"`.",
  "Emitted when the breadcrumb loses focus.": "パンくずのフォーカスが外れたときに発行されます。",
  "Emitted when the breadcrumb has focus.": "パンくずがフォーカスされたときに発行されます。",
  "Background color of the breadcrumb when focused": "フォーカス時のパンくずの背景色",
  "Text color of the breadcrumb": "パンくずの文字色",
  "Text color of the active breadcrumb": "アクティブなパンくずのテキスト色",
  "Text color of the breadcrumb when focused": "フォーカスされたときのパンくずのテキスト色",
  "Text color of the breadcrumb on hover": "ホバー時のパンくずのテキスト色",
  "The indicator element that shows the breadcrumbs are collapsed.": "パンくずが折りたたまれていることを示すインジケーター要素です。",
  "The native HTML anchor or div element that wraps all child elements.": "すべての子要素を包むネイティブHTMLのアンカーまたはdiv要素です。",
  "The separator element between each breadcrumb.": "各パンくずの間のセパレータ要素です。",
  "The number of breadcrumbs to show after the collapsed indicator. If `itemsBeforeCollapse` + `itemsAfterCollapse` is greater than `maxItems`, the breadcrumbs will not be collapsed.": "折りたたまれたインジケータの後に表示するパンくずの数。`itemsBeforeCollapse` + `itemsAfterCollapse` が `maxItems` よりも大きい場合、パンくずは折りたたまれない。",
  "The number of breadcrumbs to show before the collapsed indicator. If `itemsBeforeCollapse` + `itemsAfterCollapse` is greater than `maxItems`, the breadcrumbs will not be collapsed.": "折りたたんだインジケータの前に表示するパンくずの数を指定します。`itemsBeforeCollapse` + `itemsAfterCollapse` が `maxItems` よりも大きい場合、パンくずは折りたたまれない。",
  "The maximum number of breadcrumbs to show before collapsing.": "折りたたむ前に表示するパンくずの最大数を指定します。",
  "Emitted when the collapsed indicator is clicked on.": "折りたたみインジケータがクリックされたときに発行されます。",
  "The type of button.": "ボタンの種類です。",
  "Set to `\"block\"` for a full-width button or to `\"full\"` for a full-width button with square corners and no left or right borders.": "全角のボタンなら`\"block\"`、角が四角く左右のボーダーがない全角のボタンなら`\"full\"`に設定します。",
  "Set to `\"clear\"` for a transparent button that resembles a flat button, to `\"outline\"` for a transparent button with a border, or to `\"solid\"` for a button with a filled background. The default fill is `\"solid\"` except inside of a toolbar, where the default is `\"clear\"`.": "フラットなボタンに似た透明なボタンには `\"clear\"` を、ボーダーのある透明なボタンには `\"outline\"` を、背景を塗りつぶしたボタンには `\"solid\"` を設定します。デフォルトの塗りつぶしは `\"solid\"` です。ただし、ツールバーの内側では `\"clear\"` となります。",
  "The HTML form element or form element id. Used to submit a form when the button is not a child of the form.": "HTML のフォーム要素またはフォーム要素 ID。ボタンがフォームの子でない場合に、フォームを送信するために使用します。",
  "Set to `\"round\"` for a button with more rounded corners.": "`\"round\"` に設定すると、より角が丸いボタンになります。",
  "Set to `\"small\"` for a button with less height and padding, to `\"default\"` for a button with the default height and padding, or to `\"large\"` for a button with more height and padding. By default the size is unset, unless the button is inside of an item, where the size is `\"small\"` by default. Set the size to `\"default\"` inside of an item to make it a standard size button.": "ボタンの高さとPaddingが少ない場合は `\"small\"` に、ボタンの高さとPaddingがデフォルトの場合は `\"default\"` に、ボタンの高さとPaddingが多い場合は `\"large\"` に設定します。ただし、ボタンがアイテムの中にある場合は、デフォルトでサイズが `\"small\"` になっています。アイテムの内部でサイズを `\"default\"` に設定すると、標準サイズのボタンになります。",
  "If `true`, activates a button with a heavier font weight.": "`true`の場合、より重いFont Weightを持つボタンをアクティブにします。",
  "Emitted when the button loses focus.": "ボタンのフォーカスが外れたときに発行されます。",
  "Emitted when the button has focus.": "ボタンにフォーカスが当たっているときに発行されます。",
  "Background of the button when pressed. Note: setting this will interfere with the Material Design ripple.": "ボタンが押されたときの背景。注意：これを設定すると、Material Designの波紋に干渉します。",
  "Opacity of the button when pressed": "ボタンが押されたときの不透明度",
  "Opacity of the button when focused with the tab key": "タブキーでフォーカスしたときのボタンの不透明度",
  "Border color of the button": "ボタンのボーダーカラー",
  "Border style of the button": "ボタンのボーダースタイル",
  "Border width of the button": "ボタンのボーダー幅",
  "Box shadow of the button": "ボタンのボックスシャドウ",
  "Text color of the button when pressed": "ボタンが押されたときの文字色",
  "Text color of the button when hover": "ホバー時のボタンの文字色",
  "Content is placed between the named slots if provided without a slot.": "slotがない状態で提供される場合、コンテンツは名前付きslotの間に配置されます。",
  "Content is placed to the right of the button text in LTR, and to the left in RTL.": "コンテンツは、LTRの場合はボタンテキストの右側に、RTLの場合は左側に配置されます。",
  "Should be used on an icon in a button that has no text.": "テキストを持たないボタン内のアイコンに対して使用されるべきです。",
  "Content is placed to the left of the button text in LTR, and to the right in RTL.": "コンテンツは、LTRではボタンテキストの左側に、RTLでは右側に配置されます。",
  "The native HTML button or anchor element that wraps all child elements.": "すべての子要素をラップするネイティブHTMLのボタンまたはアンカー要素です。",
  "If true, buttons will disappear when its parent toolbar has fully collapsed if the toolbar is not the first toolbar. If the toolbar is the first toolbar, the buttons will be hidden and will only be shown once all toolbars have fully collapsed.  Only applies in `ios` mode with `collapse` set to `true` on `ion-header`.  Typically used for [Collapsible Large Titles](https://ionicframework.com/docs/api/title#collapsible-large-titles)": "trueを指定すると、ツールバーが最初のツールバーでない場合、親ツールバーが完全に折り畳まれたときにボタンが消えます。ツールバーが最初のツールバーである場合、ボタンは隠され、すべてのツールバーが完全に折りたたまれたときにのみ表示されます。  ion-header`で `collapse` を `true` に設定した `ios` modeにのみ適用されます。  通常、[Collapsible Large Titles](https://ionicframework.com/docs/api/title#collapsible-large-titles)に使用されます。",
  "If `true`, the card header will be translucent. Only applies when the mode is `\"ios\"` and the device supports [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility).": "`true`の場合、カードヘッダは半透明になります。modeが `\"ios\"` で、デバイスが [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility) をサポートしている場合にのみ適用されます。",
  "Color of the card subtitle": "カードサブタイトルの色",
  "Color of the card title": "カードタイトルの色",
  "If `true`, a button tag will be rendered and the card will be tappable.": "`true`の場合、ボタンタグがレンダリングされ、カードはタップ可能になる。",
  "If `true`, the user cannot interact with the card.": "`true`の場合、ユーザはカードと対話することができません。",
  "The type of the button. Only used when an `onclick` or `button` property is present.": "ボタンの種類。onclick`または`button`プロパティが存在する場合にのみ使用される。",
  "Background of the card": "カードの背景",
  "Color of the card": "カードの色",
  "The native HTML button, anchor, or div element that wraps all child elements.": "すべての子要素をラップするネイティブHTMLのボタン、アンカー、またはdiv要素です。",
  "How to control the alignment of the checkbox and label on the cross axis. `\"start\"`: The label and control will appear on the left of the cross axis in LTR, and on the right side in RTL. `\"center\"`: The label and control will appear at the center of the cross axis in both LTR and RTL. Setting this property will change the checkbox `display` to `block`.": "十字軸上のチェックボックスとラベルの配置を制御する方法。`\"start\"`：ラベルとコントロールはLTRでは横軸の左側に、RTLでは右側に表示されます。`\"center\"`：ラベルとコントロールはLTRでもRTLでも横軸の中央に表示されます。このプロパティを設定すると、チェックボックス `display` が `block` に変更されます。",
  "If `true`, the checkbox is selected.": "`true`の場合、チェックボックスが選択される。",
  "If `true`, the user cannot interact with the checkbox.": "`true`の場合、ユーザはチェックボックスと対話することができません。",
  "Text that is placed under the checkbox label and displayed when an error is detected.": "チェックボックスのラベルの下に配置され、エラーが検出されたときに表示されるテキスト。",
  "Text that is placed under the checkbox label and displayed when no error is detected.": "チェックボックスのラベルの下に配置され、エラーが検出されなかった場合に表示されるテキスト。",
  "If `true`, the checkbox will visually appear as indeterminate.": "`true`の場合、チェックボックスは視覚的に不定形と表示されます。",
  "How to pack the label and checkbox within a line. `\"start\"`: The label and checkbox will appear on the left in LTR and on the right in RTL. `\"end\"`: The label and checkbox will appear on the right in LTR and on the left in RTL. `\"space-between\"`: The label and checkbox will appear on opposite ends of the line with space between the two elements. Setting this property will change the checkbox `display` to `block`.": "ラベルとチェックボックスを1行にまとめる方法。`\"start\"`：ラベルとチェックボックスはLTRでは左に、RTLでは右に表示されます。`\"end\"`：ラベルとチェックボックスはLTRでは右に、RTLでは左に表示されます。`\"space-between\"`：ラベルとチェックボックスは行の反対側に表示され、2つの要素の間にはスペースが入ります。このプロパティを設定すると、チェックボックスの `display` が `block` に変更されます。",
  "Where to place the label relative to the checkbox. `\"start\"`: The label will appear to the left of the checkbox in LTR and to the right in RTL. `\"end\"`: The label will appear to the right of the checkbox in LTR and to the left in RTL. `\"fixed\"`: The label has the same behavior as `\"start\"` except it also has a fixed width. Long text will be truncated with ellipses (\"...\"). `\"stacked\"`: The label will appear above the checkbox regardless of the direction. The alignment of the label can be controlled with the `alignment` property.": "チェックボックスに対するラベルの位置。`\"start\"`：ラベルはLTRではチェックボックスの左に、RTLでは右に表示されます。`\"end\"`：ラベルはLTRではチェックボックスの右、RTLでは左に表示されます。`\"fixed\"`：ラベルの幅が固定される以外は `\"start\"` と同じ動作をします。長いテキストは省略記号(\"...\")で切り捨てられます。`\"stacked\"`：ラベルは向きに関係なくチェックボックスの上に表示されます。ラベルの整列は `alignment` プロパティで制御できます。",
  "The name of the control, which is submitted with the form data.": "フォームデータとともに送信されるコントロールの名前。",
  "If true, screen readers will announce it as a required field. This property works only for accessibility purposes, it will not prevent the form from submitting if the value is invalid.": "true の場合、スクリーンリーダーは必須項目として読み上げます。このプロパティはアクセシビリティ目的でのみ機能し、値が無効でもフォーム送信は妨げません。",
  "The value of the checkbox does not mean if it's checked or not, use the `checked` property for that.  The value of a checkbox is analogous to the value of an `<input type=\"checkbox\">`, it's only used when the checkbox participates in a native `<form>`.": "チェックボックスの値は、チェックされているかどうかを意味するものではなく、`checked`プロパティを使用します。  チェックボックスの値は `<input type=\"checkbox\">` の値に似ており、チェックボックスがネイティブの `<form>` に参加する場合にのみ使用されます。",
  "Emitted when the checkbox loses focus.": "チェックボックスのフォーカスが外れたときに発行されます。",
  "Emitted when the checked property has changed as a result of a user action such as a click.  This event will not emit when programmatically setting the `checked` property.": "クリックなどのユーザーアクションの結果、checkedプロパティが変更されたときに発行される。  プログラムで `checked` プロパティを設定した場合は、このイベントは発生しません。",
  "Emitted when the checkbox has focus.": "チェックボックスにフォーカスが当たったときに発行されます。",
  "Border color of the checkbox icon": "チェックボックスアイコンのボーダーカラー",
  "Border color of the checkbox icon when checked": "チェックボックスのアイコンがチェックされたときのボーダーカラー",
  "Border radius of the checkbox icon": "チェックボックスアイコンの境界半径",
  "Border style of the checkbox icon": "チェックボックスアイコンのボーダースタイル",
  "Border width of the checkbox icon": "チェックボックスアイコンのボーダー幅",
  "Background of the checkbox icon": "チェックボックスアイコンの背景",
  "Background of the checkbox icon when checked": "チェックしたときのチェックボックスアイコンの背景",
  "Color of the checkbox checkmark when checked": "チェックボックスのチェックマークがチェックされたときの色",
  "Stroke width of the checkbox checkmark": "チェックボックス・チェックマークのストローク幅",
  "Size of the checkbox icon": "チェックボックスのアイコンの大きさ",
  "Transition of the checkbox icon": "チェックボックスアイコンの遷移",
  "The label text to associate with the checkbox. Use the \"labelPlacement\" property to control where the label is placed relative to the checkbox.": "チェックボックスと関連付けるラベルテキスト。\"labelPlacement\"プロパティを使用して、チェックボックスに対するラベルの配置を制御します。",
  "The container for the checkbox mark.": "チェックボックスマークのコンテナです。",
  "Supporting text displayed beneath the checkbox label when the checkbox is invalid and touched.": "チェックボックスが無効かつ操作されたときに、ラベルの下に表示される補助テキスト。",
  "Supporting text displayed beneath the checkbox label when the checkbox is valid.": "チェックボックスが有効なときに、ラベルの下に表示される補助テキスト。",
  "The label text describing the checkbox.": "チェックボックスを表すラベルテキスト。",
  "The checkmark used to indicate the checked state.": "チェックされた状態を示すために使用されるチェックマークです。",
  "Supporting text displayed beneath the checkbox label.": "チェックボックスのラベルの下に表示される補助テキスト。",
  "If `true`, the user cannot interact with the chip.": "`true`の場合、ユーザはチップと対話することができません。",
  "Display an outline style button.": "アウトラインスタイルボタンを表示します。",
  "Background of the chip": "チップの背景",
  "Color of the chip": "チップの色",
  "The amount to offset the column, in terms of how many columns it should shift to the end of the total available.": "オフセットする量を、利用可能な合計の末尾に何列分シフトさせるかで指定します。",
  "The amount to offset the column for lg screens, in terms of how many columns it should shift to the end of the total available.": "lgスクリーン用のカラムをオフセットする量を、使用可能な合計の末尾に何カラム分シフトさせるかで指定します。",
  "The amount to offset the column for md screens, in terms of how many columns it should shift to the end of the total available.": "mdスクリーン用のカラムをオフセットする量を、使用可能な合計の末尾に何カラム分シフトさせるかで指定します。",
  "The amount to offset the column for sm screens, in terms of how many columns it should shift to the end of the total available.": "smスクリーン用のカラムをオフセットする量を、利用可能な合計の末尾に何カラム分シフトさせるかで指定します。",
  "The amount to offset the column for xl screens, in terms of how many columns it should shift to the end of the total available.": "xlスクリーン用のカラムをオフセットする量を、利用可能な合計の末尾に何カラム分シフトさせるかで指定します。",
  "The amount to offset the column for xs screens, in terms of how many columns it should shift to the end of the total available.": "xsスクリーンのカラムをオフセットする量を、利用可能な合計の末尾に何カラム分ずらすかで指定します。",
  "The amount to pull the column, in terms of how many columns it should shift to the start of the total available.": "列を引っ張る量を、利用可能な合計の開始位置に何列分ずらすかで指定します。",
  "The amount to pull the column for lg screens, in terms of how many columns it should shift to the start of the total available.": "lgスクリーン用のカラムを引く量を、使用可能な合計の開始位置に何カラム分シフトさせるかで指定します。",
  "The amount to pull the column for md screens, in terms of how many columns it should shift to the start of the total available.": "mdスクリーン用のカラムを引っ張る量を、利用可能な合計の開始位置に何カラムシフトさせるかで指定します。",
  "The amount to pull the column for sm screens, in terms of how many columns it should shift to the start of the total available.": "smスクリーン用のカラムを引っ張る量を、利用可能な合計の開始位置に何カラム分シフトさせるかで指定します。",
  "The amount to pull the column for xl screens, in terms of how many columns it should shift to the start of the total available.": "xlスクリーン用のカラムを引っ張る量を、利用可能な合計の開始位置に何カラム分シフトさせるかで指定します。",
  "The amount to pull the column for xs screens, in terms of how many columns it should shift to the start of the total available.": "xsスクリーン用のカラムを引っ張る量を、利用可能な合計の開始位置に何カラム分シフトさせるかで指定します。",
  "The amount to push the column, in terms of how many columns it should shift to the end of the total available.": "カラムを押す量を、利用可能な合計の末尾に何カラム分シフトさせるかで指定します。",
  "The amount to push the column for lg screens, in terms of how many columns it should shift to the end of the total available.": "lgスクリーン用のカラムをプッシュする量を、使用可能な総カラムのうち何カラム分までシフトさせるかで指定します。",
  "The amount to push the column for md screens, in terms of how many columns it should shift to the end of the total available.": "mdスクリーン用のカラムを、利用可能な合計の末尾に何カラム分シフトさせるかを指定します。",
  "The amount to push the column for sm screens, in terms of how many columns it should shift to the end of the total available.": "smスクリーン用のカラムを押す量を、使用可能な合計の末尾に何カラム分シフトさせるかで指定します。",
  "The amount to push the column for xl screens, in terms of how many columns it should shift to the end of the total available.": "xlスクリーン用のカラムをプッシュする量を、利用可能な合計の末尾にシフトするカラムの数で指定します。",
  "The amount to push the column for xs screens, in terms of how many columns it should shift to the end of the total available.": "xsスクリーン分の列を、利用可能な合計の末尾に何列分シフトさせるかを指定します。",
  "The size of the column, in terms of how many columns it should take up out of the total available. If `\"auto\"` is passed, the column will be the size of its content.": "カラムの大きさを、利用可能なカラムのうち何カラムを占めるかで指定します。`\"auto\"`が渡された場合、カラムはそのコンテンツのサイズになります。",
  "The size of the column for lg screens, in terms of how many columns it should take up out of the total available. If `\"auto\"` is passed, the column will be the size of its content.": "lgスクリーン用のカラムの大きさを、利用可能な合計カラム数のうち何カラムを占めるべきかという観点から指定します。 `\"auto\"`が渡された場合、カラムはそのコンテンツのサイズになります。",
  "The size of the column for md screens, in terms of how many columns it should take up out of the total available. If `\"auto\"` is passed, the column will be the size of its content.": "mdスクリーンのカラムの大きさを、利用可能なカラムのうち何カラムを占有するかで指定します。`\"auto\"`が渡された場合、カラムはそのコンテンツのサイズになります。",
  "The size of the column for sm screens, in terms of how many columns it should take up out of the total available. If `\"auto\"` is passed, the column will be the size of its content.": "smスクリーン用のカラムの大きさを、利用可能なカラムのうち何カラムを占めるかで指定します。`\"auto\"`が渡された場合、カラムはそのコンテンツのサイズになります。",
  "The size of the column for xl screens, in terms of how many columns it should take up out of the total available. If `\"auto\"` is passed, the column will be the size of its content.": "xlスクリーン用のカラムの大きさを、利用可能な合計カラムのうち何カラムを占めるべきかという観点から指定します。`\"auto\"`が渡された場合、カラムはそのコンテンツのサイズになります。",
  "The size of the column for xs screens, in terms of how many columns it should take up out of the total available. If `\"auto\"` is passed, the column will be the size of its content.": "xsスクリーンのカラムの大きさを、利用可能な合計のうち何カラムを占めるべきかという観点から指定します。 `\"auto\"`が渡された場合、カラムはそのコンテンツのサイズとなる。",
  "Padding for the Column": "カラムのPadding",
  "Padding for the Column on lg screens and up": "lg以上の画面でのコラムのPadding",
  "Padding for the Column on md screens and up": "mdスクリーン以上のカラムのPadding",
  "Padding for the Column on sm screens and up": "スマートフォン以上の画面では、コラムにパッドを入れる。",
  "Padding for the Column on xl screens and up": "xl以上の画面でのカラムのPadding",
  "Padding for the Column on xs screens and up": "xsスクリーン以上のカラムのPadding",
  "The number of total Columns in the Grid": "グリッドのカラムの総数",
  "Controls where the fixed content is placed relative to the main content in the DOM. This can be used to control the order in which fixed elements receive keyboard focus. For example, if a FAB in the fixed slot should receive keyboard focus before the main page content, set this property to `'before'`.": "固定コンテンツが DOM 内のメイン・コンテンツの相対的などこに配置されるかを制御します。これは、固定要素がキーボード・フォーカスを受ける順番を制御するために使用できます。例えば、固定スロットのFABがメインページのコンテンツよりも先にキーボードフォーカスを受け取るようにする場合、このプロパティを `'before'` に設定します。",
  "If `true` and the content does not cause an overflow scroll, the scroll interaction will cause a bounce. If the content exceeds the bounds of ionContent, nothing will change. Note, this does not disable the system bounce on iOS. That is an OS level setting.": "`true`で、コンテンツがオーバーフロースクロールを引き起こさない場合、スクロールインタラクションはバウンスを引き起こします。コンテンツがionContentの境界を超えた場合、何も変化しません。なお、これはiOSのシステムバウンスを無効にするものではありません。これはOSレベルの設定です。",
  "If `true`, the content will scroll behind the headers and footers. This effect can easily be seen by setting the toolbar to transparent.": "`true`の場合、コンテンツはヘッダーとフッターの後ろにスクロールされます。この効果は、ツールバーを透明に設定することで簡単に確認することができます。",
  "Because of performance reasons, ionScroll events are disabled by default, in order to enable them and start listening from (ionScroll), set this property to `true`.": "パフォーマンス上の理由から、ionScrollイベントはデフォルトで無効になっています。ionScrollイベントを有効にして(ionScroll)からリスニングを開始するには、このプロパティを`true`に設定します。",
  "If you want to enable the content scrolling in the X axis, set this property to `true`.": "X軸方向のコンテンツスクロールを有効にしたい場合は、このプロパティを`true`に設定します。",
  "If you want to disable the content scrolling in the Y axis, set this property to `false`.": "Y軸方向のコンテンツスクロールを無効にしたい場合は、このプロパティに`false`を設定します。",
  "Get the element where the actual scrolling takes place. This element can be used to subscribe to `scroll` events or manually modify `scrollTop`. However, it's recommended to use the API provided by `ion-content`:  i.e. Using `ionScroll`, `ionScrollStart`, `ionScrollEnd` for scrolling events and `scrollToPoint()` to scroll the content into a certain point.": "実際のスクロールが行われる要素を取得します。この要素を使用して、`scroll` イベントを購読したり、`scrollTop` を手動で変更したりすることができる。スクロールイベントには `ionScroll`, `ionScrollStart`, `ionScrollEnd` を、コンテンツを特定のポイントにスクロールさせるには `scrollToPoint()` を使用することが推奨されます。",
  "Scroll by a specified X/Y distance in the component.": "コンポーネントを指定したX/Y距離だけスクロールさせる。",
  "Scroll to the bottom of the component.": "コンポーネントの一番下までスクロールします。",
  "Scroll to a specified X/Y location in the component.": "コンポーネント内の指定したX/Y位置までスクロールします。",
  "Scroll to the top of the component.": "コンポーネントの上部にスクロールします。",
  "Emitted while scrolling. This event is disabled by default. Set `scrollEvents` to `true` to enable.": "スクロール中に発行されます。このイベントはデフォルトで無効になっています。有効にするには `scrollEvents` に `true` を設定します。",
  "Emitted when the scroll has ended. This event is disabled by default. Set `scrollEvents` to `true` to enable.": "スクロールが終了したときに発行されます。このイベントはデフォルトで無効になっている。有効にするには `scrollEvents` に `true` を設定します。",
  "Emitted when the scroll has started. This event is disabled by default. Set `scrollEvents` to `true` to enable.": "スクロールが開始されたときに発行されます。このイベントはデフォルトで無効になっている。有効にするには `scrollEvents` に `true` を設定してください。",
  "Background of the content": "コンテンツの背景",
  "Color of the content": "コンテンツの色",
  "Keyboard offset of the content": "コンテンツのキーボードオフセット",
  "Offset bottom of the content": "コンテンツのオフセットボトム",
  "Offset top of the content": "コンテンツのオフセットトップ",
  "Bottom padding of the content": "コンテンツのBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the content": "コンテンツの方向が左から右の場合はRight Padding、右から左の場合はLeft Paddingとなります。",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the content": "コンテンツの方向が左から右の場合はLeft Padding、右から左の場合はRight Paddingとなります。",
  "Top padding of the content": "コンテンツのTop Padding",
  "Content is placed in the scrollable area if provided without a slot.": "slotなしで提供される場合、コンテンツはスクロール可能な領域に配置されます。",
  "Should be used for fixed content that should not scroll.": "スクロールしてはいけない固定コンテンツに使用する必要があります。",
  "The background of the content.": "コンテンツの背景です。",
  "The scrollable container of the content.": "コンテンツのスクロール可能なコンテナ。",
  "The ID of the `ion-datetime` instance associated with the datetime button.": "datetime ボタンに関連付けられた `ion-datetime` インスタンスの ID。",
  "Content displayed inside of the date button.": "日付ボタンの内側に表示されるコンテンツです。",
  "Content displayed inside of the time button.": "時刻ボタンの内側に表示される内容。",
  "The native HTML button that wraps the slotted text.": "slotされたテキストをラップするネイティブHTMLボタンです。",
  "The text to display on the picker's cancel button.": "ピッカーのキャンセルボタンに表示するテキストです。",
  "The text to display on the picker's \"Clear\" button.": "ピッカーの\"Clear\"ボタンに表示するテキストです。",
  "Values used to create the list of selectable days. By default every day is shown for the given month. However, to control exactly which days of the month to display, the `dayValues` input can take a number, an array of numbers, or a string of comma separated numbers. Note that even if the array days have an invalid number for the selected month, like `31` in February, it will correctly not show days which are not valid for the selected month.": "選択可能な日のリストを作成するために使用する値です。デフォルトでは、指定した月のすべての曜日が表示されます。しかし、表示する曜日を正確に制御するために、`dayValues` には数値、数値の配列、またはコンマで区切られた数値の文字列を取ることができます。配列のdayが2月の`31`のように選択した月にとって無効な数字であっても、選択した月にとって有効でない日は正しく表示されないことに注意してください。",
  "If `true`, the user cannot interact with the datetime.": "`true`の場合、ユーザはdatetimeを操作することができません。",
  "The text to display on the picker's \"Done\" button.": "ピッカーの \"Done \"ボタンに表示するテキスト。",
  "The first day of the week to use for `ion-datetime`. The default value is `0` and represents Sunday.": "`ion-datetime`に使用する週の最初の曜日を指定します。デフォルト値は `0` で、日曜日を表す。",
  "Formatting options for dates and times. Should include a 'date' and/or 'time' object, each of which is of type [Intl.DateTimeFormatOptions](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Intl/DateTimeFormat/DateTimeFormat#options).": "日付と時刻のフォーマットオプション。それぞれ[Intl.DateTimeFormatOptions](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Intl/DateTimeFormat/DateTimeFormat#options)型です。",
  "Used to apply custom text and background colors to specific dates.  Can be either an array of objects containing ISO strings and colors, or a callback that receives an ISO string and returns the colors.  Only applies to the `date`, `date-time`, and `time-date` presentations, with `preferWheel=\"false\"`.": "特定の日付にカスタムテキストと背景色を適用するために使用します。  ISO 文字列と色を含むオブジェクトの配列、または ISO 文字列を受け取って色を返すコールバックのいずれかを指定します。  `preferWheel=\"false\"`を持つ `date`、`date-time`、`time-date` のプレゼンテーションにのみ適用されます。",
  "The hour cycle of the `ion-datetime`. If no value is set, this is specified by the current locale.": "`ion-datetime`の時間周期を指定します。値が設定されていない場合、現在のロケールによって指定される。",
  "Values used to create the list of selectable hours. By default the hour values range from `0` to `23` for 24-hour, or `1` to `12` for 12-hour. However, to control exactly which hours to display, the `hourValues` input can take a number, an array of numbers, or a string of comma separated numbers.": "選択可能な時間のリストを作成するために使用される値です。デフォルトでは、24時間制の場合は `0` から `23` まで、12時間制の場合は `1` から `12` までの時間帯が設定されます。しかし、表示する時間を正確に制御するために、`hourValues` には数値、数値の配列、またはコンマで区切られた数値の文字列を指定することができます。",
  "Returns if an individual date (calendar day) is enabled or disabled.  If `true`, the day will be enabled/interactive. If `false`, the day will be disabled/non-interactive.  The function accepts an ISO 8601 date string of a given day. By default, all days are enabled. Developers can use this function to write custom logic to disable certain days.  The function is called for each rendered calendar day, for the previous, current and next month. Custom implementations should be optimized for performance to avoid jank.": "個々の日付(暦日)が有効か無効かを返します。 `true`の場合、その日は有効/対話型になる。もし `false` ならば、その日は無効/非インタラクティブです。  この関数は、指定された日のISO 8601の日付文字列を受け取ります。デフォルトでは、すべての曜日が有効になります。開発者はこの関数を使用して、特定の日を無効にするカスタムロジックを記述することができます。  この関数は、レンダリングされたカレンダーの各日、前月、当月、翌月に対して呼び出されます。カスタム実装は、ジャンクを避けるためにパフォーマンスを最適化する必要があります。",
  "The locale to use for `ion-datetime`. This impacts month and day name formatting. The `\"default\"` value refers to the default locale set by your device.": "`ion-datetime`に使用するロケールを指定します。これは月と日の名前のフォーマットに影響します。`\"default\"`の値は、あなたのデバイスが設定するデフォルトのロケールを指します。",
  "The maximum datetime allowed. Value must be a date string following the [ISO 8601 datetime format standard](https://www.w3.org/TR/NOTE-datetime), `1996-12-19`. The format does not have to be specific to an exact datetime. For example, the maximum could just be the year, such as `1994`. Defaults to the end of this year.": "許容される最大のdatetimeを指定します。値は、[ISO 8601 datetime format standard](https://www.w3.org/TR/NOTE-datetime) の `1996-12-19` に従った日付文字列である必要があります。このフォーマットは、正確な日付時刻を指定する必要はありません。例えば、最大で`1994`のような年号を指定することができます。デフォルトはこの年の末日です。",
  "The minimum datetime allowed. Value must be a date string following the [ISO 8601 datetime format standard](https://www.w3.org/TR/NOTE-datetime), such as `1996-12-19`. The format does not have to be specific to an exact datetime. For example, the minimum could just be the year, such as `1994`. Defaults to the beginning of the year, 100 years ago from today.": "許容される最小のdatetime。値は [ISO 8601 datetime format standard](https://www.w3.org/TR/NOTE-datetime) に従った日付文字列でなければならず、例えば `1996-12-19` のようなものです。このフォーマットは、正確な日付時刻を指定する必要はありません。例えば、最小値は`1994`のような年号だけでいいです。デフォルトは、今日から100年前の年頭です。",
  "Values used to create the list of selectable minutes. By default the minutes range from `0` to `59`. However, to control exactly which minutes to display, the `minuteValues` input can take a number, an array of numbers, or a string of comma separated numbers. For example, if the minute selections should only be every 15 minutes, then this input value would be `minuteValues=\"0,15,30,45\"`.": "選択可能な分数のリストを作成するために使用される値です。デフォルトでは、分数は `0` から `59` までの範囲です。しかし、表示する分を正確に制御するために、`minuteValues` には数値、数値の配列、またはコンマで区切られた数値の文字列を取ることができます。例えば、分表示を15分ごとに行う場合は、 `minuteValues=\"0,15,30,45\"` と入力することになります。",
  "Values used to create the list of selectable months. By default the month values range from `1` to `12`. However, to control exactly which months to display, the `monthValues` input can take a number, an array of numbers, or a string of comma separated numbers. For example, if only summer months should be shown, then this input value would be `monthValues=\"6,7,8\"`. Note that month numbers do *not* have a zero-based index, meaning January's value is `1`, and December's is `12`.": "選択可能な月のリストを作成するために使用する値。デフォルトでは、月の値は `1` から `12` までの範囲です。しかし、どの月を表示するかを正確に制御するために、`monthValues` には数値、数値の配列、またはコンマで区切られた数値の文字列を取ることができます。例えば、夏の月だけを表示する場合、この入力値は `monthValues=\"6,7,8\"` となります。つまり、1月の値は `1` であり、12月の値は `12` です。",
  "If `true`, multiple dates can be selected at once. Only applies to `presentation=\"date\"` and `preferWheel=\"false\"`.": "`true`の場合、複数の日付を一度に選択することができる。`presentation=\"date\"`と `preferWheel=\"false\"` にのみ適用される。",
  "If `true`, a wheel picker will be rendered instead of a calendar grid where possible. If `false`, a calendar grid will be rendered instead of a wheel picker where possible.  A wheel picker can be rendered instead of a grid when `presentation` is one of the following values: `\"date\"`, `\"date-time\"`, or `\"time-date\"`.  A wheel picker will always be rendered regardless of the `preferWheel` value when `presentation` is one of the following values: `\"time\"`, `\"month\"`, `\"month-year\"`, or `\"year\"`.": "`true`の場合、可能な限りカレンダーグリッドの代わりにホイールピッカーが表示されます。もし `false` ならば、可能な限りホイールピッカーの代わりにカレンダーグリッドがレンダリングされます。  ホイールピッカーは、`presentation`が以下の値の場合、グリッドの代わりにレンダリングすることができます：`presentation`が `\"date\"`, `\"date-time\"`, または `\"time-date\"`.  ホイールピッカーは、`preferWheel`の値に関係なく、`presentation`が次の値のいずれかである場合に常にレンダリングされます：`\"time\"`, `\"month\"`, `\"month-year\"`, または `\"year\"`.",
  "Which values you want to select. `\"date\"` will show a calendar picker to select the month, day, and year. `\"time\"` will show a time picker to select the hour, minute, and (optionally) AM/PM. `\"date-time\"` will show the date picker first and time picker second. `\"time-date\"` will show the time picker first and date picker second.": "どの値を選択するか。`\"date\"`はカレンダーピッカーを表示し、月、日、年を選択します。`\"time\"`は時間ピッカーを表示し、時、分、そして（オプションで）AM/PMを選択します。`\"date-time\"`は、日付ピッカーを最初に、時間ピッカーを次に表示します。\"time-date\"`は、最初に時間ピッカー、2番目に日付ピッカーを表示します。",
  "If `true`, the datetime appears normal but the selected date cannot be changed.": "`true`の場合、日付は正常に表示されるが、選択された日付は変更できない。",
  "If `true`, the datetime calendar displays a six-week (42-day) layout, including days from the previous and next months to fill the grid. These adjacent days are selectable unless disabled.": "`true` の場合、グリッドを埋めるために前月・翌月の日も含めた6週間（42 日）のレイアウトでカレンダーを表示します。これらの隣接する日は無効化されていない限り選択できます。",
  "If `true`, a \"Clear\" button will be rendered alongside the default \"Cancel\" and \"OK\" buttons at the bottom of the `ion-datetime` component. Developers can also use the `button` slot if they want to customize these buttons. If custom buttons are set in the `button` slot then the default buttons will not be rendered.": "`true`の場合、`ion-datetime`コンポーネントの下部にあるデフォルトの \"Cancel \"と \"OK \"ボタンと一緒に \"Clear \"ボタンがレンダリングされます。これらのボタンをカスタマイズしたい場合、開発者は `button` slotを使用することもできる。カスタムボタンが `button` slotに設定されている場合、デフォルトのボタンはレンダリングされません。",
  "If `true`, the default \"Cancel\" and \"OK\" buttons will be rendered at the bottom of the `ion-datetime` component. Developers can also use the `button` slot if they want to customize these buttons. If custom buttons are set in the `button` slot then the default buttons will not be rendered.": "`true`の場合、`ion-datetime`コンポーネントの下部にデフォルトの \"Cancel\" と \"OK\" ボタンがレンダリングされます。これらのボタンをカスタマイズしたい場合は、`button`slotを使用することもできます。カスタムボタンが `button` slotに設定されている場合、デフォルトのボタンはレンダリングされません。",
  "If `true`, the default \"Time\" label will be rendered for the time selector of the `ion-datetime` component. Developers can also use the `time-label` slot if they want to customize this label. If a custom label is set in the `time-label` slot then the default label will not be rendered.": "`true`の場合、`ion-datetime`コンポーネントの時間セレクタにデフォルトの \"Time \"ラベルがレンダリングされる。このラベルをカスタマイズしたい場合は、`time-label`slotを使用することもできます。 `time-label` slotにカスタムラベルが設定されている場合、デフォルトのラベルはレンダリングされません。",
  "If `true`, a header will be shown above the calendar picker. This will include both the slotted title, and the selected date.": "`true`の場合、カレンダーピッカーの上にヘッダーが表示されます。これには、slotされたタイトルと、選択された日付の両方が含まれます。",
  "If `cover`, the `ion-datetime` will expand to cover the full width of its container. If `fixed`, the `ion-datetime` will have a fixed width.": "cover`の場合、`ion-datetime`はコンテナの全幅を覆うように展開される。`fixed`の場合、`ion-datetime`は固定幅になる。",
  "A callback used to format the header text that shows how many dates are selected. Only used if there are 0 or more than 1 selected (i.e. unused for exactly 1). By default, the header text is set to \"numberOfDates days\".  See https://ionicframework.com/docs/troubleshooting/runtime#accessing-this if you need to access `this` from within the callback.": "選択されている日付の数を示すヘッダーテキストをフォーマットするために使用されるコールバック。選択されている日付が 0 あるいは 1 以上の場合にのみ使用されます (つまり、1 の場合は未使用です)。デフォルトでは、ヘッダテキストは \"numberOfDates days \"に設定されます。  コールバック内から `this` にアクセスする必要がある場合は https://ionicframework.com/docs/troubleshooting/runtime#accessing-this を参照。",
  "The value of the datetime as a valid ISO 8601 datetime string. This should be an array of strings only when `multiple=\"true\"`.": "datetimeの値を有効なISO 8601 datetime文字列として指定します。これは、`multiple=\"true\"`の場合のみ、文字列の配列です。",
  "Values used to create the list of selectable years. By default the year values range between the `min` and `max` datetime inputs. However, to control exactly which years to display, the `yearValues` input can take a number, an array of numbers, or string of comma separated numbers. For example, to show upcoming and recent leap years, then this input's value would be `yearValues=\"2008,2012,2016,2020,2024\"`.": "選択可能な年のリストを作成するために使用する値。デフォルトでは、年の値は日付の `min` と `max` の間に設定される。しかし、表示する年を正確に制御するために、 `yearValues` 入力には数値、数値の配列、カンマで区切られた数値の文字列を指定することができます。例えば、うるう年と最近のうるう年を表示する場合、この入力の値は `yearValues=\"2008,2012,2016,2020,2024\"` となります。",
  "Emits the ionCancel event and optionally closes the popover or modal that the datetime was presented in.": "ionCancel イベントを発行し、オプションで datetime が表示されたポップオーバーまたはモーダルを閉じます。",
  "Confirms the selected datetime value, updates the `value` property, and optionally closes the popover or modal that the datetime was presented in.": "選択されたdatetimeの値を確認し、`value`プロパティを更新し、オプションでdatetimeが表示されていたポップオーバーまたはモーダルを閉じます。",
  "Resets the internal state of the datetime but does not update the value. Passing a valid ISO-8601 string will reset the state of the component to the provided date. If no value is provided, the internal state will be reset to the clamped value of the min, max and today.": "datetimeの内部状態をリセットするが、値は更新しません。有効なISO-8601文字列を渡すと、コンポーネントの状態は指定した日付にリセットされます。値が提供されない場合、内部状態はmin、max、todayのクランプされた値にリセットされます。",
  "Emitted when the datetime loses focus.": "datetimeのフォーカスが外れたときに発行されます。",
  "Emitted when the datetime selection was cancelled.": "datetimeの選択がキャンセルされたときに発生します。",
  "Emitted when the value (selected date) has changed.  This event will not emit when programmatically setting the `value` property.": "値(選択された日付)が変更されたときに発行される。  プログラムで `value` プロパティを設定した場合は、このイベントは発生しない。",
  "Emitted when the datetime has focus.": "datetimeにフォーカスが当たったときに発行されます。",
  "The primary background of the datetime component.": "datetimeコンポーネントの主な背景。",
  "The primary background of the datetime component in RGB format.": "datetimeコンポーネントの主な背景をRGBフォーマットで示します。",
  "The text color of the title.": "タイトルの文字色です。",
  "The color of the gradient covering non-selected items when using a wheel style layout, or in the month/year picker for grid style layouts. Must be in RGB format, e.g. `255, 255, 255`.": "ホイールスタイルレイアウトの場合は非選択項目を覆うグラデーションの色、グリッドスタイルレイアウトの場合は月/年ピッカーの色。255,255,255`のようなRGBフォーマットでなければなりません。",
  "The background of the highlight under the selected item when using a wheel style layout, or in the month/year picker for grid style layouts.": "ホイールスタイルレイアウトの場合は選択された項目の下、グリッドスタイルレイアウトの場合は月/年ピッカーのハイライトの背景。",
  "The border radius of the highlight under the selected item when using a wheel style layout, or in the month/year picker for grid style layouts.": "ホイールスタイルレイアウトの場合は選択された項目の下、グリッドスタイルレイアウトの場合は月/年ピッカーのハイライトの境界半径。",
  "The buttons in the datetime.": "datetimeのボタンです。",
  "The label for the time selector in the datetime.": "datetimeの時間セレクタのラベルです。",
  "The title of the datetime.": "datetimeのタイトルです。",
  "The individual buttons that display a day inside of the datetime calendar.": "日付カレンダーの中に日を表示する個々のボタン。",
  "The currently selected calendar day.": "現在選択されている暦日。",
  "The calendar day that is disabled.": "無効になる暦日。",
  "The calendar day that contains the current day.": "現在の日を含む暦日。",
  "The button that opens the month/year picker when using a grid style layout.": "グリッドスタイルレイアウト使用時に月/年ピッカーを開くボタン。",
  "The button that opens the time picker when using a grid style layout with `presentation=\"date-time\"` or `\"time-date\"`.": "presentation=\"date-time\"`または`\"time-date\"`のグリッドスタイルレイアウトを使用しているときに、時間ピッカーを開くボタン。",
  "The time picker button when the picker is open.": "ピッカーが開いているときのタイムピッカーボタン。",
  "The individual items when using a wheel style layout, or in the month/year picker when using a grid style layout.": "ホイールスタイルレイアウトを使用している場合は個々の項目、グリッドスタイルレイアウトを使用している場合は月/年のピッカーに表示されます。",
  "The currently selected wheel-item.": "現在選択されているホイール項目。",
  "If `true`, the fab button will be show a close icon.": "`true`の場合、ファブボタンにクローズアイコンを表示します。",
  "The icon name to use for the close icon. This will appear when the fab button is pressed. Only applies if it is the main button inside of a fab containing a fab list.": "クローズアイコンに使用するアイコン名です。ファブボタンが押されたときに表示されます。ファブリストを含むファブ内のメインボタンである場合のみ適用されます。",
  "If `true`, the user cannot interact with the fab button.": "`true`の場合、ユーザーはファブボタンを操作することができません。",
  "If `true`, the fab button will show when in a fab-list.": "`true`の場合、fabボタンがfab-listにあるときに表示されます。",
  "The size of the button. Set this to `small` in order to have a mini fab button.": "ボタンの大きさを指定します。ミニファブボタンを作るには、`small`に設定します。",
  "If `true`, the fab button will be translucent. Only applies when the mode is `\"ios\"` and the device supports [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility).": "`true`の場合、ファブボタンが半透明になります。modeが `\"ios\"` で、デバイスが [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility) をサポートしている場合にのみ適用されます。",
  "Opacity of the button background when pressed": "押されたときのボタンの背景の不透明度",
  "Opacity of the button background on hover": "ホバー時のボタン背景の不透明度",
  "Font size of the close icon": "クローズアイコンのFont Size",
  "The close icon that is displayed when a fab list opens (uses ion-icon).": "ファブリストを開いたときに表示されるクローズアイコン（ion-iconを使用します）。",
  "If `true`, the fab list will show all fab buttons in the list.": "`true`の場合、ファブリストに全てのファブボタンが表示されます。",
  "The side the fab list will show on relative to the main fab button.": "メインファブボタンに対して、ファブリストが表示される側を指定します。",
  "If `true`, both the `ion-fab-button` and all `ion-fab-list` inside `ion-fab` will become active. That means `ion-fab-button` will become a `close` icon and `ion-fab-list` will become visible.": "もし `true` ならば、`ion-fab` 内の `ion-fab-button` とすべての `ion-fab-list` の両方がアクティブになる。つまり、`ion-fab-button`は`close`アイコンになり、`ion-fab-list`は可視化される。",
  "If `true`, the fab will display on the edge of the header if `vertical` is `\"top\"`, and on the edge of the footer if it is `\"bottom\"`. Should be used with a `fixed` slot.": "`true`の場合、`vertical`が`\"top\"`の場合はヘッダーの端に、`\"bottom\"`の場合はフッターの端にファブを表示します。 `fixed` slotと一緒に使用する必要があります。",
  "Where to align the fab horizontally in the viewport.": "ビューポートでファブを水平に揃える場所。",
  "Where to align the fab vertically in the viewport.": "ビューポートでファブを縦に並べる場所。",
  "Close an active FAB list container.": "アクティブなFABリストコンテナを閉じる。",
  "Describes the scroll effect that will be applied to the footer. Only applies in iOS mode.": "フッターに適用されるスクロール効果を記述します。iOS modeでのみ適用されます。",
  "If `true`, the footer will be translucent. Only applies when the mode is `\"ios\"` and the device supports [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility).  Note: In order to scroll content behind the footer, the `fullscreen` attribute needs to be set on the content.": "`true`の場合、フッターは半透明になります。modeが `\"ios\"` で、デバイスが [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility) をサポートしている場合のみ適用されます。  注意：フッターの後ろにコンテンツをスクロールさせるためには、コンテンツに `fullscreen` 属性が設定されている必要があります。",
  "If `true`, the grid will have a fixed width based on the screen size.": "`true`の場合、グリッドの幅は画面サイズに応じた固定幅となる。",
  "Padding for the Grid": "グリッドのPadding",
  "Padding for the Grid on lg screens": "lgスクリーンでのグリッドのPadding",
  "Padding for the Grid on md screens": "mdスクリーンにおけるグリッドのPadding",
  "Padding for the Grid on sm screens": "スマートスクリーンにおけるグリッドのPadding",
  "Padding for the Grid on xl screens": "xlスクリーンでのグリッドのPadding",
  "Padding for the Grid on xs screens": "xsスクリーンでのGridのPadding",
  "Width of the fixed Grid": "固定Gridの幅",
  "Width of the fixed Grid on lg screens": "lgスクリーンで固定されたGridの幅",
  "Width of the fixed Grid on md screens": "mdスクリーンでの固定Gridの幅",
  "Width of the fixed Grid on sm screens": "smスクリーンでの固定Gridの幅",
  "Width of the fixed Grid on xl screens": "xlスクリーンでの固定Gridの幅",
  "Width of the fixed Grid on xs screens": "xsスクリーンで固定されたGridの幅",
  "Describes the scroll effect that will be applied to the header. Only applies in iOS mode.  Typically used for [Collapsible Large Titles](https://ionicframework.com/docs/api/title#collapsible-large-titles)": "ヘッダーに適用されるスクロール効果を記述します。iOS modeでのみ適用されます。  通常、[折りたたみ式ラージタイトル](https://ionicframework.com/docs/api/title#collapsible-large-titles)に使用します。",
  "If `true`, the header will be translucent. Only applies when the mode is `\"ios\"` and the device supports [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility).  Note: In order to scroll content behind the header, the `fullscreen` attribute needs to be set on the content.": "`true`の場合、ヘッダーは半透明になります。modeが `\"ios\"` で、デバイスが [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility) をサポートしている場合にのみ適用されます。  注意：ヘッダーの後ろにコンテンツをスクロールさせるには、コンテンツに `fullscreen` 属性が設定されている必要があります。",
  "This attribute defines the alternative text describing the image. Users will see this text displayed if the image URL is wrong, the image is not in one of the supported formats, or if the image is not yet downloaded.": "この属性は、画像を説明する代替テキストを定義します。画像の URL が間違っている場合、画像がサポートされている形式の一つでない場合、または画像がまだダウンロードされていない場合、ユーザにはこのテキストが表示されます。",
  "The image URL. This attribute is mandatory for the `<img>` element.": "画像のURL。この属性は `<img>` 要素では必須です。",
  "Emitted when the img fails to load": "imgの読み込みに失敗したときに発行されます。",
  "Emitted when the image has finished loading": "画像の読み込みが終了したときに発行されます。",
  "Emitted when the img src has been set": "img srcが設定されたときに発行されます。",
  "The inner `img` element.": "内側の `img` 要素。",
  "An animated SVG spinner that shows while loading.": "ロード中に表示されるアニメーションSVGスピナーです。",
  "Optional text to display while loading. `loadingText` can accept either plaintext or HTML as a string. To display characters normally reserved for HTML, they must be escaped. For example `<Ionic>` would become `&lt;Ionic&gt;`  For more information: [Security Documentation](https://ionicframework.com/docs/faq/security)  This property accepts custom HTML as a string. Content is parsed as plaintext by default. `innerHTMLTemplatesEnabled` must be set to `true` in the Ionic config before custom HTML can be used.": "ロード中に表示するオプションのテキスト。`loadingText`には、文字列としてプレーンテキストまたはHTMLのいずれかを指定することができます。通常HTML用に予約されている文字を表示するには、エスケープする必要があります。例えば、`<Ionic>`は `&lt;Ionic&gt;` になります。詳しくはこちら：[セキュリティ・ドキュメント](https://ionicframework.com/docs/faq/security) このプロパティは、カスタムHTMLを文字列として受け付けます。デフォルトでは、コンテンツはプレーンテキストとしてパースされます。カスタムHTMLを使用するには、Ionicの設定で `innerHTMLTemplatesEnabled` を `true` に設定する必要があります。",
  "If `true`, the infinite scroll will be hidden and scroll event listeners will be removed.  Set this to true to disable the infinite scroll from actively trying to receive new data while scrolling. This is useful when it is known that there is no more data that can be added, and the infinite scroll is no longer needed.": "`true`の場合、無限スクロールは非表示になり、スクロールイベントリスナーが削除されます。 `true` を設定すると、無限スクロールがスクロール中に新しいデータを積極的に受け取ろうとするのを無効にすることができます。これは、追加できるデータがもうないことが分かっていて、無限スクロールが不要になった場合に有効です。",
  "The position of the infinite scroll element. The value can be either `top` or `bottom`.": "無限スクロール要素の位置を指定します。値は `top` または `bottom` のどちらかです。",
  "The threshold distance from the bottom of the content to call the `infinite` output event when scrolled. The threshold value can be either a percent, or in pixels. For example, use the value of `10%` for the `infinite` output event to get called when the user has scrolled 10% from the bottom of the page. Use the value `100px` when the scroll is within 100 pixels from the bottom of the page.": "スクロールしたときに `infinite` 出力イベントを呼び出すための、コンテンツの底からの閾値の距離。閾値はパーセントかピクセル単位で指定します。例えば、`10%`という値を使用すると、ユーザがページの下から10%スクロールしたときに `infinite` 出力イベントが呼び出されるようになります。また、ページの下から100ピクセル以内にスクロールした場合には、`100px`という値を使用します。",
  "Call `complete()` within the `ionInfinite` output event handler when your async operation has completed. For example, the `loading` state is while the app is performing an asynchronous operation, such as receiving more data from an AJAX request to add more items to a data list. Once the data has been received and UI updated, you then call this method to signify that the loading has completed. This method will change the infinite scroll's state from `loading` to `enabled`.": "非同期操作が完了したら、`ionInfinite`出力イベントハンドラ内で `complete()` を呼び出します。例えば、AJAX リクエストからデータを受信してデータリストに項目を追加するなど、アプリが非同期処理を実行している間が `loading` 状態です。データの受信とUIの更新が完了したら、このメソッドを呼び出してロードが完了したことを知らせます。このメソッドは、無限スクロールの状態を `loading` から `enabled` へと変更します。",
  "Emitted when the scroll reaches the threshold distance. From within your infinite handler, you must call the infinite scroll's `complete()` method when your async operation has completed.": "スクロールが閾値の距離に達したときに発行されます。非同期処理が完了したら、無限ハンドラから無限スクロールの `complete()` メソッドを呼び出す必要があります。",
  "Indicates whether and how the text value should be automatically capitalized as it is entered/edited by the user. Available options: `\"off\"`, `\"none\"`, `\"on\"`, `\"sentences\"`, `\"words\"`, `\"characters\"`.": "テキスト値がユーザーによって入力／編集される際に、自動的に大文字にするかどうか、またどのようにするかについて示します。利用可能なオプション: `\"off\"`, `\"none\"`, `\"on\"`, `\"sentences\"`, `\"words\"`, `\"characters\"`.",
  "If `true`, the user cannot interact with the input.": "`true`の場合、ユーザはInputと対話することができません。",
  "The fill for the input boxes. If `\"solid\"` the input boxes will have a background. If `\"outline\"` the input boxes will be transparent with a border.": "入力ボックスの塗りつぶし。`\"solid\"` の場合は背景色が付き、`\"outline\"` の場合は枠線付きで透過表示になります。",
  "A hint to the browser for which keyboard to display. Possible values: `\"none\"`, `\"text\"`, `\"tel\"`, `\"url\"`, `\"email\"`, `\"numeric\"`, `\"decimal\"`, and `\"search\"`.  For numbers (type=\"number\"): \"numeric\" For text (type=\"text\"): \"text\"": "どのキーボードを表示するかのブラウザへのヒント。指定可能な値は `\"none\"`, `\"text\"`, `\"tel\"`, `\"url\"`, `\"email\"`, `\"numeric\"`, `\"decimal\"`, `\"search\"`。数値入力（type=\"number\"）には \"numeric\"、テキスト（type=\"text\"）には \"text\" を使用します。",
  "The number of input boxes to display.": "表示する入力ボックスの数。",
  "A regex pattern string for allowed characters. Defaults based on type.  For numbers (`type=\"number\"`): `\"[\\p{N}]\"` For text (`type=\"text\"`): `\"[\\p{L}\\p{N}]\"`": "許可される文字の正規表現パターン文字列。型に応じたデフォルトがあります。数値（type=\"number\"）は `\"[\\p{N}]\"`、テキスト（type=\"text\"）は `\"[\\p{L}\\p{N}]\"`。",
  "If `true`, the user cannot modify the value.": "`true`の場合、ユーザーは値を変更することができません。",
  "Where separators should be shown between input boxes. Can be a comma-separated string or an array of numbers.  For example: `\"3\"` will show a separator after the 3rd input box. `[1,4]` will show a separator after the 1st and 4th input boxes. `\"all\"` will show a separator between every input box.": "入力ボックス間に区切り線を表示する場所。カンマ区切り文字列または数値配列で指定できます。例: `\"3\"` は 3 番目の入力ボックスの後に区切りを表示、`[1,4]` は 1 番目と 4 番目の後に表示、`\"all\"` はすべての入力ボックス間に表示します。",
  "The shape of the input boxes. If \"round\" they will have an increased border radius. If \"rectangular\" they will have no border radius. If \"soft\" they will have a soft border radius.": "入力ボックスの形状。\"round\" は角の丸みを大きくし、\"rectangular\" は角丸なし、\"soft\" はやわらかい角丸になります。",
  "The size of the input boxes.": "入力ボックスのサイズ。",
  "The type of input allowed in the input boxes.": "入力ボックスに許可される入力種別。",
  "The value of the input group.": "入力グループの値。",
  "Sets focus to an input box.": "任意の入力ボックスにフォーカスを設定します。",
  "Emitted when the input group loses focus.": "入力グループのフォーカスが外れたときに発行されます。",
  "The `ionChange` event is fired when the user modifies the input's value. Unlike the `ionInput` event, the `ionChange` event is only fired when changes are committed, not as the user types.  The `ionChange` event fires when the `<ion-input-otp>` component loses focus after its value has changed.  This event will not emit when programmatically setting the `value` property.": "ユーザーが入力値を変更したときに `ionChange` イベントが発生します。`ionInput` と異なり、`ionChange` は入力途中ではなく変更が確定したときにのみ発生します。`<ion-input-otp>` の値が変更された後にフォーカスを失ったときにも発生します。プログラムで `value` を設定した場合には発生しません。",
  "Emitted when all input boxes have been filled with valid values.": "すべての入力ボックスが有効な値で埋められたときに発行されます。",
  "Emitted when the input group has focus.": "入力グループにフォーカスが当たったときに発行されます。",
  "The `ionInput` event is fired each time the user modifies the input's value. Unlike the `ionChange` event, the `ionInput` event is fired for each alteration to the input's value. This typically happens for each keystroke as the user types.  For elements that accept text input (`type=text`, `type=tel`, etc.), the interface is [`InputEvent`](https://developer.mozilla.org/en-US/docs/Web/API/InputEvent); for others, the interface is [`Event`](https://developer.mozilla.org/en-US/docs/Web/API/Event). If the input is cleared on edit, the type is `null`.": "`ionInput` イベントは、ユーザが入力値を変更するたびに発生する。`ionChange` イベントとは異なり、 `ionInput` イベントは入力値が変更されるたびに発生する。これは通常、ユーザが入力を行うたびに発生します。  テキスト入力を受け付ける要素(`type=text`, `type=tel`など)の場合、インターフェイスは[`InputEvent`](https://developer.mozilla.org/en-US/docs/Web/API/InputEvent)となります。その他の要素の場合、インターフェイスは[`Event`](https://developer.mozilla.org/en-US/docs/Web/API/Event)となります。編集時に入力がクリアされる場合、型は `null` となる。",
  "Background color of the input boxes": "入力ボックスの背景色",
  "Border color of the input boxes": "入力ボックスのボーダーカラー",
  "Border radius of the input boxes": "入力ボックスのボーダー半径",
  "Border width of the input boxes": "入力ボックスのボーダー幅",
  "Text color of the input": "入力テキストの色",
  "Height of input boxes": "入力ボックスの高さ",
  "The color of the highlight on the input when focused": "フォーカスされたときの入力のハイライトの色",
  "The color of the highlight on the input when invalid": "入力が無効な場合のハイライトの色",
  "The color of the highlight on the input when valid": "有効時の入力のハイライトの色",
  "Bottom margin of the input group": "入力グループの下マージン",
  "Right margin if direction is left-to-right, and left margin if direction is right-to-left of the input group": "入力グループの左右方向に応じた右/左マージン",
  "Left margin if direction is left-to-right, and right margin if direction is right-to-left of the input group": "入力グループの左右方向に応じた左/右マージン",
  "Top margin of the input group": "入力グループの上マージン",
  "Minimum width of input boxes": "入力ボックスの最小幅",
  "Bottom padding of the input group": "入力グループの下パディング",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the input group": "入力グループの左右方向に応じた右/左パディング",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the input group": "入力グループの左右方向に応じた左/右パディング",
  "Top padding of the input group": "入力グループの上パディング",
  "Border radius of the separator between boxes": "ボックス間セパレーターのボーダー半径",
  "Color of the separator between boxes": "ボックス間セパレーターの色",
  "Height of the separator between boxes": "ボックス間セパレーターの高さ",
  "Width of the separator between boxes": "ボックス間セパレーターの幅",
  "Width of input boxes": "入力ボックスの幅",
  "The icon that can be used to represent hiding a password. If not set, the \"eyeOff\" Ionicon will be used.": "パスワードの非表示を表すアイコン。設定されていない場合、\"eyeOff \"アイコンが使用される。",
  "The icon that can be used to represent showing a password. If not set, the \"eye\" Ionicon will be used.": "パスワードを示すアイコン。設定されていない場合は、\"eye\"のアイコンが使用されます。",
  "Indicates whether the value of the control can be automatically completed by the browser.": "コントロールの値が、ブラウザによって自動的に補完されるかどうかを示します。",
  "Whether auto correction should be enabled when the user is entering/editing the text value.": "ユーザーがテキスト値を入力/編集する際に、自動補正を有効にするかどうか。",
  "Sets the [`autofocus` attribute](https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/autofocus) on the native input element.  This may not be sufficient for the element to be focused on page load. See [managing focus](/docs/developing/managing-focus) for more information.": "ネイティブの入力要素に [`autofocus` 属性](https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/autofocus) を設定します。  ページロード時に要素がフォーカスされるには、これだけでは不十分かもしれません。詳しくは[managing focus](/docs/developing/managing-focus)を参照してください。",
  "If `true`, a clear icon will appear in the input when there is a value. Clicking it clears the input.": "`true`の場合、値があるときにInputにクリアアイコンが表示されます。これをクリックすると、入力がクリアされます。",
  "The icon to use for the clear button. Only applies when `clearInput` is set to `true`.": "クリアボタンに使用するアイコン。clearInput` が `true` に設定されている場合にのみ適用される。",
  "If `true`, the value will be cleared after focus upon edit. Defaults to `true` when `type` is `\"password\"`, `false` for all other types.": "`true`の場合、編集時にフォーカスされた後、値がクリアされる。デフォルトは `type` が `\"password\"` のとき `true` で、それ以外のときは `false` です。",
  "If `true`, a character counter will display the ratio of characters used and the total character limit. Developers must also set the `maxlength` property for the counter to be calculated correctly.": "`true`の場合、文字カウンタが使用された文字の比率と総文字数制限を表示します。カウンターを正しく計算するために、開発者は `maxlength` プロパティも設定する必要があります。",
  "A callback used to format the counter text. By default the counter text is set to \"itemLength / maxLength\".  See https://ionicframework.com/docs/troubleshooting/runtime#accessing-this if you need to access `this` from within the callback.": "カウンターのテキストをフォーマットするためのコールバック。デフォルトでは、カウンタのテキストは \"itemLength / maxLength\" に設定される。  コールバック内から `this` にアクセスする必要がある場合は https://ionicframework.com/docs/troubleshooting/runtime#accessing-this を参照。",
  "Set the amount of time, in milliseconds, to wait to trigger the `ionInput` event after each keystroke.": "キーを押すたびに `ionInput` イベントが発生するまでの待ち時間をミリ秒単位で設定します。",
  "A hint to the browser for which enter key to display. Possible values: `\"enter\"`, `\"done\"`, `\"go\"`, `\"next\"`, `\"previous\"`, `\"search\"`, and `\"send\"`.": "どのエンターキーを表示するかのブラウザへのヒント。指定可能な値。`\"enter\"`, `\"done\"`, `\"go\"`, `\"next\"`, `\"previous\"`, `\"search\"`, and `\"send\"`.",
  "Text that is placed under the input and displayed when an error is detected.": "Inputの下に配置され、エラーが検出されたときに表示されるテキストです。",
  "The fill for the item. If `\"solid\"` the item will have a background. If `\"outline\"` the item will be transparent with a border. Only available in `md` mode.": "アイテムの塗りつぶし。もし `\"solid\"` ならば、アイテムは背景を持つようになります。もし `\"outline\"` ならば、アイテムはボーダー付きの透明なものになります。`md`モードでのみ使用可能です。",
  "Text that is placed under the input and displayed when no error is detected.": "Inputの下に配置され、エラーが検出されなかった場合に表示されるテキストです。",
  "A hint to the browser for which keyboard to display. Possible values: `\"none\"`, `\"text\"`, `\"tel\"`, `\"url\"`, `\"email\"`, `\"numeric\"`, `\"decimal\"`, and `\"search\"`.": "どのキーボードを表示するかのブラウザへのヒント。指定可能な値。`\"none\"`, `\"text\"`, `\"tel\"`, `\"url\"`, `\"email\"`, `\"numeric\"`, `\"decimal\"`, and `\"search\"`.",
  "The visible label associated with the input.  Use this if you need to render a plaintext label.  The `label` property will take priority over the `label` slot if both are used.": "入力に関連付けられた可視ラベル。  プレーンテキストのラベルをレンダリングする必要がある場合に使用する。  両方が使用されている場合、`label` プロパティが `label` スロットよりも優先される。",
  "Where to place the label relative to the input. `\"start\"`: The label will appear to the left of the input in LTR and to the right in RTL. `\"end\"`: The label will appear to the right of the input in LTR and to the left in RTL. `\"floating\"`: The label will appear smaller and above the input when the input is focused or it has a value. Otherwise it will appear on top of the input. `\"stacked\"`: The label will appear smaller and above the input regardless even when the input is blurred or has no value. `\"fixed\"`: The label has the same behavior as `\"start\"` except it also has a fixed width. Long text will be truncated with ellipses (\"...\").": "入力に対してラベルを配置する位置。`\"start\"`：ラベルはLTRでは入力の左側に、RTLでは右側に表示されます。`\"end\"`：ラベルはLTRでは入力の右側、RTLでは左側に表示されます。\"floating\"`：`\"floating\"`：ラベルは、入力にフォーカスが当たっているときや、入力に値があるときは小さく表示され、入力の上に表示されます。それ以外の場合は、入力の上に表示されます。`\"スタック(stacked)\"`：入力がぼやけた状態や値がない場合でも、ラベルは小さく表示され、入力の上に表示されます。`\"fixed\"`：ラベルの幅が固定される以外は、`\"start\"`と同じ動作になります。長いテキストは省略記号（\"...\"）で切り捨てられます。",
  "The maximum value, which must not be less than its minimum (min attribute) value.": "最大値で、その最小値（min属性）より小さくてはなりません。",
  "If the value of the type attribute is `text`, `email`, `search`, `password`, `tel`, or `url`, this attribute specifies the maximum number of characters that the user can enter.": "type属性の値が `text`, `email`, `search`, `password`, `tel`, または `url` の場合、この属性はユーザーが入力できる最大文字数を指定します。",
  "The minimum value, which must not be greater than its maximum (max attribute) value.": "最小値で、その最大値（max属性）より大きくてはなりません。",
  "If the value of the type attribute is `text`, `email`, `search`, `password`, `tel`, or `url`, this attribute specifies the minimum number of characters that the user can enter.": "type属性の値が `text`, `email`, `search`, `password`, `tel`, または `url` の場合、この属性はユーザーが入力できる最小文字数を指定します。",
  "If `true`, the user can enter more than one value. This attribute applies when the type attribute is set to `\"email\"`, otherwise it is ignored.": "`true`の場合、ユーザは複数の値を入力することができる。この属性は、type属性が `\"email\"` に設定されている場合に適用され、それ以外の場合は無視される。",
  "A regular expression that the value is checked against. The pattern must match the entire value, not just some subset. Use the title attribute to describe the pattern to help the user. This attribute applies when the value of the type attribute is `\"text\"`, `\"search\"`, `\"tel\"`, `\"url\"`, `\"email\"`, `\"date\"`, or `\"password\"`, otherwise it is ignored. When the type attribute is `\"date\"`, `pattern` will only be used in browsers that do not support the `\"date\"` input type natively. See https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input/date for more information.": "値をチェックするための正規表現。パターンは、部分的なものだけでなく、値全体にマッチする必要があります。title 属性を使って、ユーザーを助けるためにパターンを説明します。この属性は、type属性の値が `\"text\"`, `\"search\"`, `\"tel\"`, `\"url\"`, `\"email\"`, `\"date\"`, または `\"password\"` であるときに適用され、それ以外のときは無視されます。type 属性が `\"date\"` の場合、`pattern` は `\"date\"` Inputタイプをネイティブにサポートしないブラウザでのみ使用されます。詳しくは https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input/date を参照してください。",
  "Instructional text that shows before the input has a value. This property applies only when the `type` property is set to `\"email\"`, `\"number\"`, `\"password\"`, `\"search\"`, `\"tel\"`, `\"text\"`, or `\"url\"`, otherwise it is ignored.": "Inputが値を持つ前に表示される指示テキスト。このプロパティは、`type`プロパティが `\"email\"`, `\"number\"`, `\"password\"`, `\"search\"`, `\"tel\"`, `\"text\"`, または `\"url\"` に設定されている場合にのみ適用され、それ以外は無視されます。",
  "If `true`, the user must fill in a value before submitting a form.": "`true`の場合、ユーザーはフォームを送信する前に値を入力する必要があります。",
  "The shape of the input. If \"round\" it will have an increased border radius.": "入力の形状を指定します。\"round\"の場合、境界線の半径が大きくなります。",
  "If `true`, the element will have its spelling and grammar checked.": "`true`の場合、その要素のスペルチェックと文法チェックが行われる。",
  "Works with the min and max attributes to limit the increments at which a value can be set. Possible values are: `\"any\"` or a positive floating point number.": "min属性、max属性と連携して、値を設定する際の増分を制限することができます。設定可能な値は以下の通りです。`\"any\"`または正の浮動小数点数。",
  "The type of control to display. The default type is text.": "表示するコントロールの種類を指定します。デフォルトのタイプはテキストです。",
  "The value of the input.": "入力された値です。",
  "Returns the native `<input>` element used under the hood.": "要素の内部で使用されているネイティブの `<input>` 要素を返します。",
  "Sets focus on the native `input` in `ion-input`. Use this method instead of the global `input.focus()`.  Developers who wish to focus an input when a page enters should call `setFocus()` in the `ionViewDidEnter()` lifecycle method.  Developers who wish to focus an input when an overlay is presented should call `setFocus` after `didPresent` has resolved.  See [managing focus](/docs/developing/managing-focus) for more information.": "`ion-input` のネイティブ `input` にフォーカスを設定する。グローバルな `input.focus()` の代わりにこのメソッドを使用する。  ページ入力時に入力にフォーカスを当てたい場合は、 `ionViewDidEnter()` ライフサイクルメソッド内で `setFocus()` を呼び出す必要がある。  オーバーレイが表示されたときに入力にフォーカスを当てたい開発者は、 `didPresent` が解決した後に `setFocus` を呼び出してください。  詳細については、[managing focus](/docs/developing/managing-focus)を参照してください。",
  "Emitted when the input loses focus.": "Inputのフォーカスが外れたときに発行されます。",
  "The `ionChange` event is fired when the user modifies the input's value. Unlike the `ionInput` event, the `ionChange` event is only fired when changes are committed, not as the user types.  Depending on the way the users interacts with the element, the `ionChange` event fires at a different moment: - When the user commits the change explicitly (e.g. by selecting a date from a date picker for `<ion-input type=\"date\">`, pressing the \"Enter\" key, etc.). - When the element loses focus after its value has changed: for elements where the user's interaction is typing.  This event will not emit when programmatically setting the `value` property.": "`ionChange` イベントは、ユーザが入力値を変更したときに発生する。`ionInput` イベントとは異なり、`ionChange` イベントは変更がコミットされたときにのみ発生する。  ユーザが明示的に変更をコミットしたとき (例えば、`<ion-input type=\"date\">` の日付ピッカーから日付を選択したり、\"Enter\" キーを押したりしたときなど)。- 値が変更された後、要素がフォーカスを失ったとき。  このイベントは、プログラムで `value` プロパティを設定する場合には発生しません。",
  "Emitted when the input has focus.": "Inputにフォーカスが当たったときに発行されます。",
  "Background of the input": "Inputの背景",
  "Color of the border below the input when using helper text, error text, or counter": "ヘルパーテキスト、エラーテキスト、カウンターを使用する場合のInput下のボーダーの色",
  "Radius of the input. A large radius may display unevenly when using fill=\"outline\"; if needed, use shape=\"round\" instead or increase --padding-start.": "入力の半径。fill=\"outline \"を使う場合、半径が大きいと表示が不 均一になることがある。",
  "Style of the border below the input when using helper text, error text, or counter": "ヘルパーテキスト、エラーテキスト、カウンターを使用する場合の入力下のボーダーのスタイル",
  "Width of the border below the input when using helper text, error text, or counter": "ヘルパーテキスト、エラーテキスト、カウンターを使用する場合の入力下のボーダーの幅",
  "Color of the input text": "Inputのテキストの色",
  "The height of the highlight on the input. Only applies to md mode.": "入力のハイライトの高さ。mdモードにのみ適用される。",
  "Bottom padding of the input": "InputのBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the input": "入力の方向が左から右の場合はRight Padding、右から左の場合はLeft Paddingとなります。",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the input": "入力の方向が左から右の場合はLeft Padding、右から左の場合はRight Paddingとなります。",
  "Top padding of the input": "InputのTop Padding",
  "Color of the input placeholder text": "InputのPlaceholderテキストの色",
  "Font style of the input placeholder text": "InputのPlaceholderテキストのFont Style",
  "Font weight of the input placeholder text": "InputのPlaceholderテキストのFont Weight",
  "Opacity of the input placeholder text": "InputのPlaceholderテキストの不透明度",
  "Content to display at the trailing edge of the input. (EXPERIMENTAL)": "入力の後端に表示する内容。(実験的)",
  "The label text to associate with the input. Use the `labelPlacement` property to control where the label is placed relative to the input. Use this if you need to render a label with custom HTML. (EXPERIMENTAL)": "入力に関連付けるラベルテキスト。labelPlacement`プロパティを使用すると、入力に対してラベルを配置する位置を制御することができる。ラベルをカスタム HTML でレンダリングする必要がある場合に使用します。(EXPERIMENTAL)",
  "Content to display at the leading edge of the input. (EXPERIMENTAL)": "入力の最先端に表示するコンテンツ。(実験的)",
  "When it's set to `true`, the item-divider will stay visible when it reaches the top of the viewport until the next `ion-item-divider` replaces it.  This feature relies in `position:sticky`: https://caniuse.com/#feat=css-sticky": "`true`に設定すると、アイテムディバイダーがビューポートの上部に到達しても、次の `ion-item-divider` がそれを置き換えるまで表示されたままになります。  この機能は `position:sticky` に依存しています: https://caniuse.com/#feat=css-sticky",
  "Background of the item divider": "アイテムディバイダーの背景",
  "Color of the item divider": "アイテムディバイダーの色",
  "Bottom inner padding of the item divider": "アイテムディバイダーのBottom Inner Padding",
  "End inner padding of the item divider": "アイテムディバイダーのEnd Inner Padding",
  "Start inner padding of the item divider": "アイテムディバイダーのStart Inner Padding",
  "Top inner padding of the item divider": "アイテムディバイダーのTop Inner Padding",
  "Bottom padding of the item divider": "アイテムディバイダーのBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the item divider": "アイテムディバイダーの方向が左から右の場合はRight Padding、右から左の場合はLeft Padding",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the item divider": "アイテムディバイダーの方向が左から右の場合はLeft Padding、右から左の場合はRight Paddingとなります。",
  "Top padding of the item divider": "アイテムディバイダーのTop Padding",
  "Content is placed to the right of the divider text in LTR, and to the left in RTL.": "コンテンツは、LTRでは仕切り文字の右側に、RTLでは左側に配置されます。",
  "Content is placed to the left of the divider text in LTR, and to the right in RTL.": "コンテンツは、LTRでは仕切り文字の左側に、RTLでは右側に配置されます。",
  "If `true`, the user cannot interact with the item option.": "`true`の場合、ユーザーはアイテムオプションと対話することができません。",
  "If `true`, the option will expand to take up the available width and cover any other options.": "`true`の場合、オプションは利用可能な幅を占めるように展開し、他のオプションをカバーします。",
  "Background of the item option": "アイテムオプションの背景",
  "Color of the item option": "アイテムオプションのカラー",
  "Content is placed below the option text.": "コンテンツは、オプションテキストの下に配置されます。",
  "Content is placed to the right of the option text in LTR, and to the left in RTL.": "コンテンツは、LTRではオプションテキストの右側に、RTLでは左側に配置されます。",
  "Should be used on an icon in an option that has no text.": "テキストを持たないオプションのアイコンに使用されるべきです。",
  "Content is placed to the left of the option text in LTR, and to the right in RTL.": "コンテンツは、LTRではオプションテキストの左側に、RTLでは右側に配置されます。",
  "Content is placed above the option text.": "オプションテキストの上にコンテンツが配置されます。",
  "The side the option button should be on. Possible values: `\"start\"` and `\"end\"`. If you have multiple `ion-item-options`, a side must be provided for each.": "オプションボタンを配置する側を指定します。指定可能な値。start\"` と `\"end\"`.複数の `ion-item-options` がある場合は、それぞれにサイドを指定する必要があります。",
  "Emitted when the item has been fully swiped.": "アイテムが完全にスワイプされたときに発行されます。",
  "If `true`, the user cannot interact with the sliding item.": "`true`の場合、ユーザーはスライドアイテムを操作することができません。",
  "Close the sliding item. Items can also be closed from the [List](./list).": "スライドしているアイテムを閉じる。アイテムは[リスト](./list)からも閉じることができます。",
  "Close all of the sliding items in the list. Items can also be closed from the [List](./list).": "リスト内のスライドアイテムをすべて閉じます。アイテムは、[リスト](./list)からも閉じることができます。",
  "Get the amount the item is open in pixels.": "アイテムが開いている量をピクセル単位で取得します。",
  "Get the ratio of the open amount of the item compared to the width of the options. If the number returned is positive, then the options on the right side are open. If the number returned is negative, then the options on the left side are open. If the absolute value of the number is greater than 1, the item is open more than the width of the options.": "オプションの幅と比較した、アイテムのオープン量の比率を取得します。返された数値が正の場合、右側のオプションが開いていることになります。返された数値が負の場合、左側のオプションが開いています。数値の絶対値が1より大きい場合、その項目は選択肢の幅より多く開いていることになります。",
  "Open the sliding item.": "スライド式の項目を開く。",
  "Emitted when the sliding position changes.": "スライド位置が変化したときに発行されます。",
  "If `true`, a button tag will be rendered and the item will be tappable.": "`true`の場合、ボタンタグがレンダリングされ、アイテムはタップ可能になる。",
  "If `true`, a detail arrow will appear on the item. Defaults to `false` unless the `mode` is `ios` and an `href` or `button` property is present.": "`true`の場合、アイテムに詳細矢印が表示されます。デフォルトは `false` で、`mode` が `ios` で `href` または `button` プロパティが存在する場合のみです。",
  "The icon to use when `detail` is set to `true`.": "`detail` が `true` に設定されているときに使用するアイコンです。",
  "If `true`, the user cannot interact with the item.": "`true`の場合、ユーザはそのアイテムと対話することができません。",
  "How the bottom border should be displayed on the item.": "アイテムに表示される下枠の表示方法。",
  "Background of the item": "アイテムの背景",
  "Background of the item when pressed. Note: setting this will interfere with the Material Design ripple.": "押されたときのアイテムの背景。注意：これを設定すると、Material Designの波紋に干渉します。",
  "Opacity of the item background when pressed": "押されたときのアイテム背景の不透明度",
  "Background of the item when focused with the tab key": "タブキーでフォーカスしたときのアイテムの背景",
  "Opacity of the item background when focused with the tab key": "タブキーでフォーカスしたときのアイテムの背景の不透明度",
  "Background of the item on hover": "ホバー時のアイテムの背景",
  "Opacity of the background of the item on hover": "ホバー時のアイテムの背景の不透明度",
  "Color of the item border": "アイテムの縁取りの色",
  "Radius of the item border": "アイテムの境界線の半径",
  "Style of the item border": "アイテムの枠のスタイル",
  "Width of the item border": "アイテムの枠の幅",
  "Color of the item": "アイテムのカラー",
  "Color of the item when pressed": "押したときのアイテムの色",
  "Color of the item when focused with the tab key": "タブキーでフォーカスしたときのアイテムの色",
  "Color of the item on hover": "ホバー時のアイテムの色",
  "Color of the item detail icon": "アイテム詳細アイコンの色",
  "Font size of the item detail icon": "アイテム詳細アイコンのFont Size",
  "Opacity of the item detail icon": "アイテム詳細アイコンの不透明度",
  "Width of the item inner border": "アイテム内枠の幅",
  "Box shadow of the item inner": "アイテム内側のボックスシャドウ",
  "Bottom padding of the item inner": "アイテム内側のBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the item inner": "方向が左から右の場合はRight Padding、方向がアイテムの内側の右から左の場合はLeft Paddingとなります。",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the item inner": "方向が左から右の場合はLeft Padding、方向が右から左の場合はRight Paddingがアイテム内側に入る",
  "Top padding of the item inner": "アイテム内側のTop Padding",
  "Minimum height of the item": "アイテムの最小高さ",
  "Bottom padding of the item": "アイテムのBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the item": "方向が左から右の場合はRight Padding、方向が右から左の場合はLeft Paddingで項目を囲む",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the item": "方向が左から右の場合はLeft Padding、方向が右から左の場合はRight Paddingで項目を囲む",
  "Top padding of the item": "アイテムのTop Padding",
  "Color of the item ripple effect": "アイテム波及効果の色",
  "Transition of the item": "アイテムの変遷",
  "Content is placed to the right of the item text in LTR, and to the left in RTL.": "コンテンツは、LTRではアイテムテキストの右側に、RTLでは左側に配置されます。",
  "Content is placed to the left of the item text in LTR, and to the right in RTL.": "コンテンツは、LTRではアイテムテキストの左側に、RTLでは右側に配置されます。",
  "The chevron icon for the item. Only applies when `detail=\"true\"`.": "アイテムのシェブロンアイコンを表示します。detail=\"true\"`のときのみ適用されます。",
  "The native HTML button, anchor or div element that wraps all child elements.": "すべての子要素をラップするネイティブHTMLのボタン、アンカー、またはdiv要素です。",
  "The position determines where and how the label behaves inside an item.": "位置は、ラベルがアイテム内のどこで、どのように動作するかを決定します。",
  "Color of the label. This property is only available when using `ion-label` inside of an `ion-item`.": "ラベルの色。このプロパティは `ion-label` を `ion-item` の内部で使用する場合にのみ利用可能です。",
  "How the bottom border should be displayed on the list header.": "リストヘッダーの下辺のボーダーをどのように表示するか。",
  "Background of the list header": "リストヘッダーの背景",
  "Color of the list header border": "リストヘッダーボーダーの色",
  "Style of the list header border": "リストヘッダーボーダーのスタイル",
  "Width of the list header border": "リストヘッダー枠の幅",
  "Color of the list header text": "リストヘッダーテキストの色",
  "Width of the inner list header border": "リストヘッダー内枠の幅",
  "If `true`, the list will have margin around it and rounded corners.": "`true`の場合、リストの周囲に余白ができ、角が丸くなる。",
  "How the bottom border should be displayed on all items.": "すべてのアイテムで、下のボーダーをどのように表示させるか。",
  "If `ion-item-sliding` are used inside the list, this method closes any open sliding item.  Returns `true` if an actual `ion-item-sliding` is closed.": "リスト内で `ion-item-sliding` が使用されている場合、このメソッドは開いているスライドアイテムを閉じる。  実際に `ion-item-sliding` が閉じられた場合は `true` を返します。",
  "If `true`, the loading indicator will animate.": "`true`の場合、ロードインジケータをアニメーションで表示します。",
  "If `true`, the loading indicator will be dismissed when the backdrop is clicked.": "`true`の場合、バックドロップがクリックされたときにローディングインジケータが解除される。",
  "Number of milliseconds to wait before dismissing the loading indicator.": "ローディングインジケータを解除するまでの待ち時間（ミリ秒）。",
  "Animation to use when the loading indicator is presented.": "ローディングインジケータが表示されたときに使用するアニメーションです。",
  "Additional attributes to pass to the loader.": "ローダーに渡す追加属性。",
  "If `true`, the loading indicator will open. If `false`, the loading indicator will close. Use this if you need finer grained control over presentation, otherwise just use the loadingController or the `trigger` property. Note: `isOpen` will not automatically be set back to `false` when the loading indicator dismisses. You will need to do that in your code.": "`true`の場合、ローディングインジケータは開きます。`false`の場合、ローディングインジケータは閉じます。より細かく表示を制御したい場合に使用します。そうでない場合は、loadingController または `trigger` プロパティを使用してください。注意: ローディングインジケータが終了しても、`isOpen`は自動的に `false`に戻されません。あなたのコードでそれを行う必要があります。",
  "Animation to use when the loading indicator is dismissed.": "ローディングインジケータが解除されたときに使用するアニメーションです。",
  "Optional text content to display in the loading indicator.  This property accepts custom HTML as a string. Content is parsed as plaintext by default. `innerHTMLTemplatesEnabled` must be set to `true` in the Ionic config before custom HTML can be used.": "ローディングインジケータに表示するテキストコンテンツを任意で指定します。  このプロパティは、文字列としてカスタムHTMLを受け入れます。コンテンツはデフォルトでプレーンテキストとしてパースされます。カスタムHTMLを使用するには、Ionicの設定で `innerHTMLTemplatesEnabled` を `true` に設定する必要があります。",
  "If `true`, a backdrop will be displayed behind the loading indicator.": "`true`の場合、ロードインジケータの後ろにバックドロップが表示されます。",
  "The name of the spinner to display.": "表示するスピナーの名前。",
  "If `true`, the loading indicator will be translucent. Only applies when the mode is `\"ios\"` and the device supports [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility).": "`true`の場合、ロードインジケータは半透明になります。modeが `\"ios\"` で、デバイスが [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility) をサポートしている場合にのみ適用されます。",
  "An ID corresponding to the trigger element that causes the loading indicator to open when clicked.": "クリックするとローディングインジケータが開くトリガー要素に対応するIDです。",
  "Dismiss the loading overlay after it has been presented. This is a no-op if the overlay has not been presented yet. If you want to remove an overlay from the DOM that was never presented, use the [remove](https://developer.mozilla.org/en-US/docs/Web/API/Element/remove) method.": "ローディングのオーバーレイが表示された後に閉じます。オーバーレイがまだ表示されていない場合は何もしません。表示されなかったオーバーレイを DOM から削除するには、[remove](https://developer.mozilla.org/en-US/docs/Web/API/Element/remove) メソッドを使用してください。",
  "Returns a promise that resolves when the loading did dismiss.": "ローディングが解除されたタイミングを解決するPromiseを返します。",
  "Returns a promise that resolves when the loading will dismiss.": "ローディングが解除されるタイミングを解決するPromiseを返します。",
  "Present the loading overlay after it has been created.": "作成後のローディングオーバーレイを提示します。",
  "Emitted after the loading indicator has dismissed. Shorthand for ionLoadingDidDismiss.": "ローディングインジケータが解除された後に発行されます。ionLoadingDidDismissの略記。",
  "Emitted after the loading indicator has presented. Shorthand for ionLoadingWillDismiss.": "ローディングインジケータが提示された後に放出される。ionLoadingWillDismissの略記。",
  "Emitted after the loading has dismissed.": "ローディングが解除された後に発行されます。",
  "Emitted after the loading has presented.": "ローディングが提示された後に発行されます。",
  "Emitted before the loading has dismissed.": "ローディングが解除される前に発行されます。",
  "Emitted before the loading has presented.": "ローディングが提示される前に発行されます。",
  "Emitted before the loading indicator has dismissed. Shorthand for ionLoadingWillDismiss.": "ローディングインジケータが解散する前に発行されます。ionLoadingWillDismissの略記です。",
  "Emitted before the loading indicator has presented. Shorthand for ionLoadingWillPresent.": "ローディングインジケータが提示される前に発行されます。ionLoadingWillPresentの略記。",
  "Background of the loading dialog": "ローディングダイアログの背景",
  "Height of the loading dialog": "ローディングダイアログの高さ",
  "Maximum height of the loading dialog": "ローディングダイアログの最大の高さ",
  "Maximum width of the loading dialog": "ローディングダイアログの最大幅",
  "Minimum height of the loading dialog": "ローディングダイアログの最小高さ",
  "Minimum width of the loading dialog": "ローディングダイアログの最小幅",
  "Color of the loading spinner": "ローディングスピナーの色",
  "Width of the loading dialog": "ローディングダイアログの幅",
  "Automatically hides the menu button when the corresponding menu is not active": "対応するメニューがアクティブでない場合、メニューボタンを自動的に非表示にします。",
  "If `true`, the user cannot interact with the menu button.": "`true`の場合、ユーザはメニューボタンを操作することができません。",
  "Optional property that maps to a Menu's `menuId` prop. Can also be `start` or `end` for the menu side. This is used to find the correct menu to toggle": "メニューの `menuId` プロパティに対応するオプションのプロパティです。メニュー側には `start` または `end` を指定することもできます。これは、トグルするための正しいメニューを見つけるために使用されます。",
  "Background of the menu button": "メニューボタンの背景",
  "Background of the menu button when focused with the tab key": "タブキーでフォーカスしたときのメニューボタンの背景色",
  "Opacity of the menu button background when focused with the tab key": "タブキーでフォーカスしたときのメニューボタンの背景の不透明度",
  "Background of the menu button on hover": "ホバー時のメニューボタンの背景",
  "Border radius of the menu button": "メニューボタンのボーダー半径",
  "Color of the menu button": "メニューボタンの色",
  "Color of the menu button when focused with the tab key": "タブキーでフォーカスしたときのメニューボタンの色",
  "Color of the menu button on hover": "ホバー時のメニューボタンの色",
  "The menu button icon (uses ion-icon).": "メニューボタンのアイコン（ion-iconを使用）です。",
  "Automatically hides the content when the corresponding menu is not active.  By default, it's `true`. Change it to `false` in order to keep `ion-menu-toggle` always visible regardless the state of the menu.": "対応するメニューがアクティブでない場合に、自動的にコンテンツを非表示にします。  デフォルトでは `true` になっています。メニューの状態に関係なく `ion-menu-toggle` を常に表示しておきたい場合は、`false` に変更します。",
  "Optional property that maps to a Menu's `menuId` prop. Can also be `start` or `end` for the menu side. This is used to find the correct menu to toggle.  If this property is not used, `ion-menu-toggle` will toggle the first menu that is active.": "メニューの `menuId` プロパティに対応するオプションのプロパティです。メニュー側には `start` または `end` を指定することもできます。これは、トグルするための正しいメニューを見つけるために使用される。  このプロパティを使用しない場合、`ion-menu-toggle`は、最初にアクティブになったメニューをトグルします。",
  "Content is placed inside the toggle to act as the click target.": "トグルの内側にコンテンツを配置し、クリックターゲットとして機能させます。",
  "The `id` of the main content. When using a router this is typically `ion-router-outlet`. When not using a router, this is typically your main view's `ion-content`. This is not the id of the `ion-content` inside of your `ion-menu`.": "メインコンテンツの `id` です。ルータを使用する場合は、通常 `ion-router-outlet` となります。ルータを使用しない場合は、通常、メインビューの `ion-content` となります。これは `ion-menu` 内の `ion-content` の ID ではありません。",
  "If `true`, the menu is disabled.": "`true`の場合、メニューは無効化される。",
  "The edge threshold for dragging the menu open. If a drag/swipe happens over this value, the menu is not triggered.": "ドラッグでメニューを開く際のエッジのしきい値です。この値を超えてドラッグ/スワイプが行われた場合、メニューはトリガーされない。",
  "An id for the menu.": "メニューのIDです。",
  "Which side of the view the menu should be placed.": "メニューがビューのどの側に配置されるべきか。",
  "If `true`, swiping the menu is enabled.": "`true`の場合、スワイプによるメニュー操作が有効になる。",
  "The display type of the menu. Available options: `\"overlay\"`, `\"reveal\"`, `\"push\"`.": "メニューの表示形式を指定します。利用可能なオプション。overlay\"`, `\"reveal\"`, `\"push\"`.",
  "Closes the menu. If the menu is already closed or it can't be closed, it returns `false`.": "メニューを閉じる。メニューが既に閉じられていたり、閉じることができない場合は、`false`を返します。",
  "Returns `true` if the menu is active.  A menu is active when it can be opened or closed, meaning it's enabled and it's not part of a `ion-split-pane`.": "メニューがアクティブな場合は `true` を返します。メニューが開閉可能で有効化されており、`ion-split-pane` の一部でないときにアクティブとみなされます。",
  "Returns `true` is the menu is open.": "メニューが開いている場合は `true` を返します。",
  "Opens the menu. If the menu is already open or it can't be opened, it returns `false`.": "メニューを開く。メニューが既に開いているか、開くことができない場合は、`false`を返します。",
  "Opens or closes the menu. If the operation can't be completed successfully, it returns `false`.": "メニューを開くか閉じます。操作が正常に完了できない場合は `false` を返します。",
  "Toggles the menu. If the menu is already open, it will try to close, otherwise it will try to open it. If the operation can't be completed successfully, it returns `false`.": "メニューを切り替えます。メニューが既に開かれている場合は閉じようとし、そうでない場合は開こうとします。操作が正常に完了しない場合は、`false`を返します。",
  "Emitted when the menu is closed.": "メニューが閉じられたときに発行されます。",
  "Emitted when the menu is open.": "メニューが開いているときに発行されます。",
  "Emitted when the menu is about to be closed.": "メニューが閉じられようとするときに発行されます。",
  "Emitted when the menu is about to be opened.": "メニューが開かれようとするときに発行されます。",
  "Background of the menu": "メニューの背景",
  "Height of the menu": "メニューの高さ",
  "Maximum height of the menu": "メニューの最大の高さ",
  "Maximum width of the menu": "メニューの最大幅",
  "Minimum height of the menu": "メニューの高さの最小値",
  "Minimum width of the menu": "メニューの最小幅",
  "Width of the menu": "メニューの幅",
  "The backdrop that appears over the main content when the menu is open.": "メニューを開いているときに、メインコンテンツの上に表示される背景です。",
  "The container for the menu content.": "メニューの内容を格納するコンテナです。",
  "If `true`, the modal will animate.": "`true`の場合、モーダルはアニメーションを行います。",
  "A decimal value between 0 and 1 that indicates the point after which the backdrop will begin to fade in when using a sheet modal. Prior to this point, the backdrop will be hidden and the content underneath the sheet can be interacted with. This value is exclusive meaning the backdrop will become active after the value specified.": "シートモーダル使用時に背景がフェードインし始めるポイントを示す0～1の10進数値です。それ以前は、背景は非表示で、シートの下のコンテンツは操作可能です。この値は排他的で、指定された値の後に背景がアクティブになることを意味します。",
  "If `true`, the modal will be dismissed when the backdrop is clicked.": "`true`の場合、バックドロップがクリックされるとモーダルは解除されます。",
  "The breakpoints to use when creating a sheet modal. Each value in the array must be a decimal between 0 and 1 where 0 indicates the modal is fully closed and 1 indicates the modal is fully open. Values are relative to the height of the modal, not the height of the screen. One of the values in this array must be the value of the `initialBreakpoint` property. For example: [0, .25, .5, 1]": "シート モーダルを作成するときに使用するブレークポイントです。配列の各値は 0 から 1 の間の 10 進数でなければならず、0 はモーダルが完全に閉じていることを、1 はモーダルが完全に開いていることを示しています。値は、画面の高さではなく、モーダルの高さに対する相対値です。この配列の値の1つは、`initialBreakpoint` プロパティの値でなければなりません。例えば[0, .25, .5, 1]",
  "Determines whether or not a modal can dismiss when calling the `dismiss` method.  If the value is `true` or the value's function returns `true`, the modal will close when trying to dismiss. If the value is `false` or the value's function returns `false`, the modal will not close when trying to dismiss.  See https://ionicframework.com/docs/troubleshooting/runtime#accessing-this if you need to access `this` from within the callback.": "dismiss` メソッドを呼び出したときに、モーダルが終了できるかどうかを決定します。  値が `true` または値の関数が `true` を返す場合、モーダルは終了しようとすると閉じます。値が `false` の場合、または値の関数が `false` を返す場合、モーダルは閉じません。  コールバック内から `this` にアクセスする必要がある場合は、 https://ionicframework.com/docs/troubleshooting/runtime#accessing-this を参照してください。",
  "Animation to use when the modal is presented.": "モーダルが表示されたときに使用するアニメーション。",
  "Controls whether scrolling or dragging within the sheet modal expands it to a larger breakpoint. This only takes effect when `breakpoints` and `initialBreakpoint` are set.  If `true`, scrolling or dragging anywhere in the modal will first expand it to the next breakpoint. Once fully expanded, scrolling will affect the content. If `false`, scrolling will always affect the content. The modal will only expand when dragging the header or handle. The modal will close when dragging the header or handle. It can also be closed when dragging the content, but only if the content is scrolled to the top.": "シートモーダル内でのスクロールやドラッグで、より大きいブレークポイントへ拡張するかを制御します。これは `breakpoints` と `initialBreakpoint` が設定されている場合にのみ有効です。`true` のとき、モーダル内のどこでスクロール/ドラッグしても、まず次のブレークポイントへ拡張します。最大まで拡張されると、スクロールはコンテンツに作用します。`false` のとき、スクロールは常にコンテンツに作用します。モーダルが拡張するのはヘッダーまたはハンドルをドラッグした場合のみです。ヘッダーやハンドルをドラッグするとモーダルは閉じます。コンテンツのドラッグでも閉じることがありますが、コンテンツが最上部までスクロールされている場合に限ります。",
  "If `true`, focus will not be allowed to move outside of this overlay. If `false`, focus will be allowed to move outside of the overlay.  In most scenarios this property should remain set to `true`. Setting this property to `false` can cause severe accessibility issues as users relying on assistive technologies may be able to move focus into a confusing state. We recommend only setting this to `false` when absolutely necessary.  Developers may want to consider disabling focus trapping if this overlay presents a non-Ionic overlay from a 3rd party library. Developers would disable focus trapping on the Ionic overlay when presenting the 3rd party overlay and then re-enable focus trapping when dismissing the 3rd party overlay and moving focus back to the Ionic overlay.": "もし `true` なら、フォーカスはこのオーバーレイの外側には移動できない。false`の場合、フォーカスはオーバーレイの外側に移動することができる。  ほとんどの場合、このプロパティは `true` のままにしておくべきである。このプロパティを `false` に設定すると、支援技術に依存しているユーザーがフォーカスを混乱した状態に移動できる可能性があるため、深刻なアクセシビリティの問題を引き起こす可能性があります。絶対に必要な場合のみ、このプロパティを `false` に設定することをお勧めします。  開発者は、このオーバーレイがサードパーティライブラリからIonic以外のオーバーレイを表示している場合、フォーカストラッピングを無効にすることを検討するとよいでしょう。開発者は、サードパーティーのオーバーレイを表示するときにIonicオーバーレイのフォーカストラッピングを無効にし、サードパーティーのオーバーレイを解除してIonicオーバーレイにフォーカスを戻すときにフォーカストラッピングを再度有効にします。",
  "The horizontal line that displays at the top of a sheet modal. It is `true` by default when setting the `breakpoints` and `initialBreakpoint` properties.": "シートモーダルの上部に表示される水平線です。 `breakpoints`と`initialBreakpoint`プロパティを設定すると、デフォルトで`true`になります。",
  "The interaction behavior for the sheet modal when the handle is pressed.  Defaults to `\"none\"`, which  means the modal will not change size or position when the handle is pressed. Set to `\"cycle\"` to let the modal cycle between available breakpoints when pressed.  Handle behavior is unavailable when the `handle` property is set to `false` or when the `breakpoints` property is not set (using a fullscreen or card modal).": "ハンドルが押されたときのシートモーダルのインタラクション動作です。  デフォルトは `\"none\"` で、ハンドルが押されてもモーダルはサイズも位置も変わりません。cycle\"` に設定すると、押されたときにモーダルが利用可能なブレークポイント間を循環するようになります。  ハンドルの動作は、`handle` プロパティが `false` に設定されている場合、または `breakpoints` プロパティが設定されていない場合（フルスクリーンまたはカード モーダルを使用している場合）には、利用できません。",
  "Additional attributes to pass to the modal.": "モーダルに渡す追加属性。",
  "A decimal value between 0 and 1 that indicates the initial point the modal will open at when creating a sheet modal. This value must also be listed in the `breakpoints` array.": "シートモーダル作成時にモーダルが開く初期点を示す 0 から 1 までの 10 進値。この値は `breakpoints` 配列にも記載されている必要があります。",
  "If `true`, the modal will open. If `false`, the modal will close. Use this if you need finer grained control over presentation, otherwise just use the modalController or the `trigger` property. Note: `isOpen` will not automatically be set back to `false` when the modal dismisses. You will need to do that in your code.": "`true`の場合、モーダルは開かれます。 `false`の場合、モーダルは閉じます。それ以外の場合は、modalController または `trigger` プロパティを使用してください。注意: `isOpen` は、モーダルが終了しても自動的に `false` に戻されません。あなたのコードでそれを行う必要があります。",
  "If `true`, the component passed into `ion-modal` will automatically be mounted when the modal is created. The component will remain mounted even when the modal is dismissed. However, the component will be destroyed when the modal is destroyed. This property is not reactive and should only be used when initially creating a modal.  Note: This feature only applies to inline modals in JavaScript frameworks such as Angular, React, and Vue.": "`true`の場合、モーダルの作成時に `ion-modal` に渡されたコンポーネントが自動的にマウントされます。このコンポーネントは、モーダルが終了してもマウントされたままです。しかし、モーダルが破棄されると、コンポーネントは破棄されます。このプロパティはリアクティブではないので、モーダルを最初に作成するときにのみ使用する必要があります。  注意：この機能は、Angular、React、Vue などの JavaScript フレームワークのインライン モーダルにのみ適用されます。",
  "Animation to use when the modal is dismissed.": "モーダルが解除されたときに使用するアニメーションです。",
  "The element that presented the modal. This is used for card presentation effects and for stacking multiple modals on top of each other. Only applies in iOS mode.": "モーダルを提示した要素です。カード提示効果や、複数のモーダルを重ねる場合に使用します。iOS modeでのみ適用されます。",
  "If `true`, a backdrop will be displayed behind the modal. This property controls whether or not the backdrop darkens the screen when the modal is presented. It does not control whether or not the backdrop is active or present in the DOM.": "`true`の場合、モーダルの後ろに背景が表示されます。このプロパティは、モーダルが表示されたときに背景が画面を暗くするかどうかを制御します。このプロパティは、背景がアクティブであるかどうか、または DOM に存在するかどうかを制御するものではありません。",
  "An ID corresponding to the trigger element that causes the modal to open when clicked.": "クリックされたときにモーダルを開かせるトリガー要素に対応するIDです。",
  "Dismiss the modal overlay after it has been presented. This is a no-op if the overlay has not been presented yet. If you want to remove an overlay from the DOM that was never presented, use the [remove](https://developer.mozilla.org/en-US/docs/Web/API/Element/remove) method.": "モーダルのオーバーレイが表示された後に閉じます。オーバーレイがまだ表示されていない場合は何もしません。表示されなかったオーバーレイを DOM から削除するには、[remove](https://developer.mozilla.org/en-US/docs/Web/API/Element/remove) メソッドを使用してください。",
  "Returns the current breakpoint of a sheet style modal": "シートスタイルモーダルの現在のブレークポイントを返します。",
  "Returns a promise that resolves when the modal did dismiss.": "モーダルが解除されたときに解決するPromiseを返します。",
  "Returns a promise that resolves when the modal will dismiss.": "モーダルがいつ解散するかを解決するPromiseを返します。",
  "Present the modal overlay after it has been created.": "モーダルオーバーレイを作成した後に提示します。",
  "Move a sheet style modal to a specific breakpoint.": "シートスタイルのモーダルを指定したブレークポイントに移動します。",
  "Emitted after the modal has dismissed. Shorthand for ionModalDidDismiss.": "モーダルが解散した後に発行されます。ionModalDidDismiss の略記です。",
  "Emitted after the modal has presented. Shorthand for ionModalDidPresent.": "モーダルが提示された後に発行されます。ionModalDidPresent の略記です。",
  "Emitted after the modal breakpoint has changed.": "モーダルブレークポイントが変更された後に発行されます。",
  "Emitted after the modal has dismissed.": "モーダルが終了した後に発行されます。",
  "Emitted after the modal has presented.": "モーダルが提示された後に発行されます。",
  "Emitted before the modal has dismissed.": "モーダルが解散する前に発行されます。",
  "Emitted before the modal has presented.": "モーダルが提示される前に発行されます。",
  "Emitted before the modal has dismissed. Shorthand for ionModalWillDismiss.": "モーダルが解散する前に発行されます。ionModalWillDismiss の略記です。",
  "Emitted before the modal has presented. Shorthand for ionModalWillPresent.": "モーダルが提示される前に発行されます。ionModalWillPresent の略記です。",
  "Background of the modal content": "モーダルコンテンツの背景",
  "Border color of the modal content": "モーダルコンテンツのボーダーカラー",
  "Border radius of the modal content": "モーダルコンテンツのボーダー半径",
  "Border style of the modal content": "モーダルコンテンツのボーダースタイル",
  "Border width of the modal content": "モーダルコンテンツのボーダー幅",
  "Height of the modal": "モーダルの高さ",
  "Maximum height of the modal": "モーダルの最大の高さ",
  "Maximum width of the modal": "モーダルの最大幅",
  "Minimum height of the modal": "モーダルの最小高さ",
  "Minimum width of the modal": "モーダルの最小幅",
  "Width of the modal": "モーダルの幅",
  "Content is placed inside of the `.modal-content` element.": "コンテンツは `.modal-content` 要素の内側に配置されます。",
  "The `ion-backdrop` element.": "`ion-backdrop`要素です。",
  "The wrapper element for the default slot.": "デフォルトslotのラッパー要素です。",
  "The handle that is displayed at the top of the sheet modal when `handle=\"true\"`.": "handle=\"true\"`のときにシートモーダルの上部に表示されるハンドルです。",
  "Component to navigate to. Only used if the `routerDirection` is `\"forward\"` or `\"root\"`.": "ナビゲート先のコンポーネント。 `routerDirection`が `\"forward\"` または `\"root\"` である場合にのみ使用します。",
  "Data you want to pass to the component as props. Only used if the `\"routerDirection\"` is `\"forward\"` or `\"root\"`.": "コンポーネントにpropsとして渡したいデータ。routerDirection\"` が `\"forward\"` または `\"root\"` である場合のみ使用します。",
  "The transition animation when navigating to another page.": "別ページに移動する際の遷移アニメーション。",
  "The transition direction when navigating to another page.": "別ページに移動する際の遷移方向です。",
  "If `true`, the nav should animate the transition of components.": "`true`の場合、コンポーネントの遷移をアニメーションで表現します。",
  "By default `ion-nav` animates transition between pages based in the mode (ios or material design). However, this property allows to create custom transition using `AnimationBuilder` functions.": "デフォルトでは、`ion-nav` はmode（ios または Material Design）に応じてページ間の遷移をアニメーション化します。しかし、このプロパティは `AnimationBuilder` 関数を使用して、独自の遷移を作成することができます。",
  "Root NavComponent to load": "ロードするルートNavComponent",
  "Any parameters for the root component": "ルートコンポーネントの任意のパラメータ",
  "If the nav component should allow for swipe-to-go-back.": "ナビコンポーネントがスワイプで戻ることができるようにする場合。",
  "Returns `true` if the current view can go back.": "現在のビューが戻ることができる場合は `true` を返します。",
  "Get the active view.": "アクティブビューを取得します。",
  "Get the view at the specified index.": "指定されたインデックスにあるビューを取得します。",
  "Returns the number of views in the stack.": "スタック内のビューの数を返します。",
  "Get the previous view.": "前のビューを取得します。",
  "Inserts a component into the navigation stack at the specified index. This is useful to add a component at any point in the navigation stack.": "指定されたインデックスのナビゲーションスタックにコンポーネントを挿入します。これは、ナビゲーションスタックの任意の位置にコンポーネントを追加するのに便利です。",
  "Inserts an array of components into the navigation stack at the specified index. The last component in the array will become instantiated as a view, and animate in to become the active view.": "指定されたインデックスのナビゲーションスタックにコンポーネントの配列を挿入します。配列の最後のコンポーネントはビューとしてインスタンス化され、アニメーションしてアクティブビューになります。",
  "Pop a component off of the navigation stack. Navigates back from the current component.": "ナビゲーションスタックからコンポーネントをポップオフします。現在のコンポーネントからナビゲートして戻る。",
  "Pop to a specific index in the navigation stack.": "ナビゲーションスタック内の特定のインデックスにポップします。",
  "Navigate back to the root of the stack, no matter how far back that is.": "スタックのルートまで戻ってナビゲートする、それがどんなに遠くても。",
  "Push a new component onto the current navigation stack. Pass any additional information along as an object. This additional information is accessible through NavParams.": "新しいコンポーネントを現在のナビゲーションスタックにプッシュします。追加情報があれば、オブジェクトとして一緒に渡す。この追加情報には、NavParamsからアクセスできます。",
  "Removes a component from the navigation stack at the specified index.": "指定されたインデックスにあるコンポーネントをナビゲーションスタックから削除します。",
  "Set the views of the current navigation stack and navigate to the last view. By default animations are disabled, but they can be enabled by passing options to the navigation controller. Navigation parameters can also be passed to the individual pages in the array.": "現在のナビゲーションスタックのビューを設定し、最後のビューにナビゲートします。デフォルトではアニメーションは無効になっていますが、ナビゲーションコントローラーにオプションを渡すことで有効にすることができます。ナビゲーションパラメーターは、配列内の各ページに渡すこともできます。",
  "Set the root for the current navigation stack to a component.": "現在のナビゲーションスタックのルートをコンポーネントに設定します。",
  "Event fired when the nav has changed components": "ナビのコンポーネントが変更されたときに発生するイベント",
  "Event fired when the nav will change components": "ナビコンポーネントが変更されたときに発生するイベント",
  "Color of the note": "ノートの色",
  "If `true`, the user cannot interact with the picker column option.": "`true`の場合、ユーザーはピッカー列オプションを操作できない。",
  "The text value of the option.": "オプションのテキスト値です。",
  "If `true`, the user cannot interact with the picker.": "`true`の場合、ユーザーはピッカーと対話することができない。",
  "The selected option in the picker.": "ピッカーで選択されているオプション。",
  "Sets focus on the scrollable container within the picker column. Use this method instead of the global `pickerColumn.focus()`.": "ピッカーカラム内のスクロール可能なコンテナにフォーカスを設定します。グローバルメソッド `pickerColumn.focus()` の代わりにこのメソッドを使用します。",
  "Emitted when the value has changed.  This event will not emit when programmatically setting the `value` property.": "値が変更されたときに発行される。  プログラムで `value` プロパティを設定した場合は、このイベントは発生しない。",
  "Content to show on the left side of the picker options.": "ピッカー・オプションの左側に表示するコンテンツ。",
  "Content to show on the right side of the picker options.": "ピッカー・オプションの右側に表示するコンテンツ。",
  "If `true`, the picker will animate.": "`true`の場合、ピッカーはアニメーションを行います。",
  "If `true`, the picker will be dismissed when the backdrop is clicked.": "`true`の場合、バックドロップがクリックされるとピッカーが解除される。",
  "Array of buttons to be displayed at the top of the picker.": "ピッカーの上部に表示されるボタンの配列。",
  "Array of columns to be displayed in the picker.": "ピッカーに表示されるカラムの配列。",
  "Number of milliseconds to wait before dismissing the picker.": "ピッカーが終了するまでの待ち時間をミリ秒単位で指定します。",
  "Animation to use when the picker is presented.": "ピッカーが表示されたときに使用するアニメーション。",
  "Additional attributes to pass to the picker.": "ピッカーに渡す追加属性。",
  "If `true`, the picker will open. If `false`, the picker will close. Use this if you need finer grained control over presentation, otherwise just use the pickerController or the `trigger` property. Note: `isOpen` will not automatically be set back to `false` when the picker dismisses. You will need to do that in your code.": "`true`の場合、ピッカーは開きます。`false`の場合、ピッカーは閉じます。ピッカーの表示をより細かく制御したい場合に使用します。それ以外の場合は pickerController や `trigger` プロパティを使用します。注意: ピッカーが終了しても `isOpen` は自動的に `false` に戻りません。あなたのコードでそれを行う必要があります。",
  "Animation to use when the picker is dismissed.": "ピッカーが解除されたときに使用するアニメーションです。",
  "If `true`, a backdrop will be displayed behind the picker.": "`true`の場合、ピッカーの後ろに背景が表示されます。",
  "An ID corresponding to the trigger element that causes the picker to open when clicked.": "クリックするとピッカーが開くトリガー要素に対応するID。",
  "Dismiss the picker overlay after it has been presented.": "ピッカー・オーバーレイが表示された後、それを解除します。",
  "Get the column that matches the specified name.": "指定された名前に一致するカラムを取得します。",
  "Returns a promise that resolves when the picker did dismiss.": "ピッカーが解散したことを解決するPromiseを返します。",
  "Returns a promise that resolves when the picker will dismiss.": "ピッカーが解散するタイミングを解決するPromiseを返します。",
  "Present the picker overlay after it has been created.": "ピッカー・オーバーレイを作成した後に提示します。",
  "Emitted after the picker has dismissed. Shorthand for ionPickerDidDismiss.": "ピッカーが解散した後に発行されます。ionPickerDidDismissの略記です。",
  "Emitted after the picker has presented. Shorthand for ionPickerWillDismiss.": "ピッカーが提示された後に発行されます。ionPickerWillDismissの略記です。",
  "Emitted after the picker has dismissed.": "ピッカーが解散した後に発行されます。",
  "Emitted after the picker has presented.": "ピッカーが提示された後に発行されます。",
  "Emitted before the picker has dismissed.": "ピッカーが解散する前に発行されます。",
  "Emitted before the picker has presented.": "ピッカーが提示される前に発行されます。",
  "Emitted before the picker has dismissed. Shorthand for ionPickerWillDismiss.": "ピッカーが解散する前に発行されます。ionPickerWillDismissの略記です。",
  "Emitted before the picker has presented. Shorthand for ionPickerWillPresent.": "ピッカーが提示される前に発行されます。ionPickerWillPresentの略記です。",
  "Background of the picker": "ピッカーの背景",
  "Background of the picker in rgb format": "ピッカーの背景（rgb形式）",
  "Border color of the picker": "ピッカーのボーダーカラー",
  "Border radius of the picker": "ピッカーのボーダー半径",
  "Border style of the picker": "ピッカーのボーダースタイル",
  "Border width of the picker": "ピッカーのボーダー幅",
  "Height of the picker": "ピッカーの高さ",
  "Maximum height of the picker": "ピッカーの最大の高さ",
  "Maximum width of the picker": "ピッカーの最大幅",
  "Minimum height of the picker": "ピッカーの最小の高さ",
  "Minimum width of the picker": "ピッカーの最小幅",
  "Width of the picker": "ピッカーの幅",
  "Background of the gradient covering non-selected items in rgb format": "非選択項目をカバーするグラデーションの背景（rgb形式",
  "Background of the picker highlight for the selected item": "選択されたアイテムのピッカー・ハイライトの背景",
  "Border radius of the picker highlight for the selected item": "選択されたアイテムのピッカーハイライトの境界半径",
  "Describes how to align the popover content with the `reference` point. Defaults to `\"center\"` for `ios` mode, and `\"start\"` for `md` mode.": "ポップオーバーのコンテンツを `reference` ポイントに揃える方法を記述します。デフォルトは `ios` モードでは `\"center\"` で、`md` モードでは `\"start\"` です。",
  "If `true`, the popover will animate.": "`true`の場合、ポップオーバーはアニメーションを行います。",
  "If `true`, the popover will display an arrow that points at the `reference` when running in `ios` mode. Does not apply in `md` mode.": "`true`の場合、`ios` modeで動作しているとき、ポップオーバーは `reference` を指し示す矢印を表示します。 `md` modeでは適用されない。",
  "If `true`, the popover will be dismissed when the backdrop is clicked.": "`true`の場合、バックドロップがクリックされたときにポップオーバーが解除される。",
  "The component to display inside of the popover. You only need to use this if you are not using a JavaScript framework. Otherwise, you can just slot your component inside of `ion-popover`.": "ポップオーバーの内側に表示するコンポーネントです。これを使う必要があるのは、JavaScriptフレームワークを使用していない場合だけです。そうでない場合は、`ion-popover`の中にコンポーネントを入れるだけでいいです。",
  "The data to pass to the popover component. You only need to use this if you are not using a JavaScript framework. Otherwise, you can just set the props directly on your component.": "ポップオーバー・コンポーネントに渡すデータです。これを使う必要があるのは、JavaScriptフレームワークを使用していない場合だけです。そうでなければ、コンポーネントに直接propsを設定すればよいのです。",
  "If `true`, the popover will be automatically dismissed when the content has been clicked.": "`true`の場合、コンテンツがクリックされると、ポップオーバーは自動的に解除される。",
  "Animation to use when the popover is presented.": "ポップオーバーが表示されたときに使用するアニメーションです。",
  "The event to pass to the popover animation.": "ポップオーバー・アニメーションに渡すイベントです。",
  "Additional attributes to pass to the popover.": "ポップオーバーに渡す追加属性。",
  "If `true`, the popover will open. If `false`, the popover will close. Use this if you need finer grained control over presentation, otherwise just use the popoverController or the `trigger` property. Note: `isOpen` will not automatically be set back to `false` when the popover dismisses. You will need to do that in your code.": "`true`の場合、ポップオーバーは開く。もし `false` ならば、ポップオーバーは閉じます。より細かく表示を制御する必要がある場合はこれを使用し、そうでない場合は popoverController または `trigger` プロパティを使用します。注意: ポップオーバーが閉じると `isOpen` は自動的に `false` に戻されません。あなたのコードでそれを行う必要があります。",
  "If `true`, the component passed into `ion-popover` will automatically be mounted when the popover is created. The component will remain mounted even when the popover is dismissed. However, the component will be destroyed when the popover is destroyed. This property is not reactive and should only be used when initially creating a popover.  Note: This feature only applies to inline popovers in JavaScript frameworks such as Angular, React, and Vue.": "`true`の場合、ポップオーバーの作成時に `ion-popover` に渡されたコンポーネントが自動的にマウントされます。このコンポーネントは、ポップオーバーが削除されてもマウントされたままです。ただし、ポップオーバーが破棄されると、コンポーネントは破棄されます。このプロパティはリアクティブではないので、ポップオーバーを最初に作成するときにのみ使用する必要があります。  注：この機能は、Angular、React、VueなどのJavaScriptフレームワークのインラインポップオーバーにのみ適用されます。",
  "Animation to use when the popover is dismissed.": "ポップオーバーが解除されたときに使用するアニメーションです。",
  "Describes what to position the popover relative to. If `\"trigger\"`, the popover will be positioned relative to the trigger button. If passing in an event, this is determined via event.target. If `\"event\"`, the popover will be positioned relative to the x/y coordinates of the trigger action. If passing in an event, this is determined via event.clientX and event.clientY.": "ポップオーバーを何に対して相対的に配置するかを記述します。もし `\"trigger\"` ならば、ポップオーバーはトリガーボタンに相対して配置されます。イベントを渡すと、event.targetによって決定されます。もし `\"event\"` ならば、ポップオーバーはトリガーアクションのx/y座標に相対的に配置されます。イベントを渡す場合、これはevent.clientXとevent.clientYを介して決定されます。",
  "If `true`, a backdrop will be displayed behind the popover. This property controls whether or not the backdrop darkens the screen when the popover is presented. It does not control whether or not the backdrop is active or present in the DOM.": "`true`の場合、ポップオーバーの後ろに背景が表示されます。このプロパティは、ポップオーバーが表示されたときに背景が画面を暗くするかどうかを制御します。このプロパティは、背景がアクティブであるかどうか、またはDOMに存在するかどうかを制御しません。",
  "Describes which side of the `reference` point to position the popover on. The `\"start\"` and `\"end\"` values are RTL-aware, and the `\"left\"` and `\"right\"` values are not.": "ポップオーバーを `reference` ポイントのどちら側に配置するかを記述します。`\"start\"` と `\"end\"` の値はRTLを意識しており、`\"left\"` と `\"right\"` の値はそうではない。",
  "Describes how to calculate the popover width. If `\"cover\"`, the popover width will match the width of the trigger. If `\"auto\"`, the popover width will be set to a static default value.": "ポップオーバーの幅を計算する方法を記述します。もし `\"cover\"` なら、ポップオーバーの幅はトリガーの幅に合わせます。auto\"` の場合、ポップオーバーの幅は静的なデフォルト値に設定されます。",
  "If `true`, the popover will be translucent. Only applies when the mode is `\"ios\"` and the device supports [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility).": "`true`の場合、ポップオーバーは半透明になります。modeが `\"ios\"` で、デバイスが [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility) をサポートしている場合にのみ適用されます。",
  "An ID corresponding to the trigger element that causes the popover to open. Use the `trigger-action` property to customize the interaction that results in the popover opening.": "ポップオーバーを開かせるトリガー要素に対応するIDです。trigger-action`プロパティを使用して、ポップオーバーを開くためのインタラクションをカスタマイズすることができます。",
  "Describes what kind of interaction with the trigger that should cause the popover to open. Does not apply when the `trigger` property is `undefined`. If `\"click\"`, the popover will be presented when the trigger is left clicked. If `\"hover\"`, the popover will be presented when a pointer hovers over the trigger. If `\"context-menu\"`, the popover will be presented when the trigger is right clicked on desktop and long pressed on mobile. This will also prevent your device's normal context menu from appearing.": "どのようなトリガーとの相互作用でポップオーバーを開くべきかを記述します。 `trigger`プロパティが `undefined` の場合は適用されません。`\"click\"` の場合、トリガーが左クリックされたときにポップオーバーが表示されます。`\"hover\"` の場合、ポインタがトリガーの上に乗ったときにポップオーバーが表示されます。コンテキストメニューの場合、デスクトップでは右クリック、モバイルでは長押しでポップオーバーが表示されます。これは、デバイスの通常のコンテキストメニューが表示されるのを防ぐことにもなります。",
  "Dismiss the popover overlay after it has been presented. This is a no-op if the overlay has not been presented yet. If you want to remove an overlay from the DOM that was never presented, use the [remove](https://developer.mozilla.org/en-US/docs/Web/API/Element/remove) method.": "ポップオーバーのオーバーレイが表示された後に閉じます。オーバーレイがまだ表示されていない場合は何もしません。表示されなかったオーバーレイを DOM から削除するには、[remove](https://developer.mozilla.org/en-US/docs/Web/API/Element/remove) メソッドを使用してください。",
  "Returns a promise that resolves when the popover did dismiss.": "ポップオーバーが解除されたタイミングを解決するPromiseを返します。",
  "Returns a promise that resolves when the popover will dismiss.": "ポップオーバーが解除されるタイミングを解決するPromiseを返します。",
  "Present the popover overlay after it has been created. Developers can pass a mouse, touch, or pointer event to position the popover relative to where that event was dispatched.": "ポップオーバーが作成された後に、ポップオーバーを表示します。開発者は、マウス、タッチ、またはポインタイベントを渡すことで、そのイベントがディスパッチされた場所と相対的にポップオーバーを配置することができます。",
  "Emitted after the popover has dismissed. Shorthand for ionPopoverDidDismiss.": "ポップオーバーが解散した後に発行されます。ionPopoverDidDismissの略記です。",
  "Emitted after the popover has presented. Shorthand for ionPopoverWillDismiss.": "ポップオーバーが提示された後に発行されます。ionPopoverWillDismissの略記です。",
  "Emitted after the popover has dismissed.": "ポップオーバーが解除された後に発行されます。",
  "Emitted after the popover has presented.": "ポップオーバーが表示された後に発行されます。",
  "Emitted before the popover has dismissed.": "ポップオーバーが解除される前に発行されます。",
  "Emitted before the popover has presented.": "ポップオーバーが表示される前に発行されます。",
  "Emitted before the popover has dismissed. Shorthand for ionPopoverWillDismiss.": "ポップオーバーが解散する前に発行されます。ionPopoverWillDismissの略記です。",
  "Emitted before the popover has presented. Shorthand for ionPopoverWillPresent.": "ポップオーバーが提示される前に発行されます。ionPopoverWillPresentの略記です。",
  "Background of the popover": "ポップオーバーの背景",
  "Box shadow of the popover": "ポップオーバーのボックスシャドウ",
  "Height of the popover": "ポップオーバーの高さ",
  "Maximum height of the popover": "ポップオーバーの最大の高さ",
  "Maximum width of the popover": "ポップオーバーの最大幅",
  "Minimum height of the popover": "ポップオーバーの高さの最小値",
  "Minimum width of the popover": "ポップオーバーの最小幅",
  "The amount to move the popover by on the x-axis": "ポップオーバーをX軸方向に移動させる量",
  "The amount to move the popover by on the y-axis": "ポップオーバーをY軸方向に移動させる量を指定します。",
  "Width of the popover": "ポップオーバーの幅",
  "Content is placed inside of the `.popover-content` element.": "コンテンツは `.popover-content` 要素の内部に配置される。",
  "The arrow that points to the reference element. Only applies on `ios` mode.": "参照要素を指し示す矢印。`ios` mode時のみ適用される。",
  "If the buffer and value are smaller than 1, the buffer circles will show. The buffer should be between [0, 1].": "バッファと値が1より小さい場合、バッファの円が表示されます。バッファは[0, 1]の間である必要があります。",
  "If true, reverse the progress bar direction.": "true の場合、プログレスバーの方向を反転させます。",
  "The state of the progress bar, based on if the time the process takes is known or not. Default options are: `\"determinate\"` (no animation), `\"indeterminate\"` (animate from left to right).": "処理にかかる時間が既知か否かに応じて、プログレスバーの状態を指定します。デフォルトのオプションは以下の通り。determinate\"` (アニメーションなし), `\"indeterminate\"` (左から右へアニメーションする).",
  "The value determines how much of the active bar should display when the `type` is `\"determinate\"`. The value should be between [0, 1].": "この値は、`type`が`\"determinate\"`である場合に、アクティブバーをどれだけ表示するかを決定するものです。値は [0, 1] の間であるべきです。",
  "Background of the progress track, or the buffer bar if `buffer` is set": "プログレストラックの背景、または `buffer` が設定されている場合はバッファバー。",
  "Background of the progress bar representing the current value": "現在値を表すプログレスバーの背景",
  "The progress bar that shows the current value when `type` is `\"determinate\"` and slides back and forth when `type` is `\"indeterminate\"`.": "type`が`\"determinate\"`のときは現在値を表示し、`type`が`\"indeterminate\"`のときは前後にスライドするプログレスバーです。",
  "The animated circles that appear while buffering. This only shows when `buffer` is set and `type` is `\"determinate\"`.": "バッファリング中に表示されるアニメーションの円です。これは `buffer` が設定され、`type` が `\"determinate\"` のときのみ表示される。",
  "The track bar behind the progress bar. If the `buffer` property is set and `type` is `\"determinate\"` the track will be the width of the `buffer` value.": "プログレスバーの後ろにあるトラックバーです。buffer`プロパティが設定され、`type`が `\"determinate\"` である場合、トラックは `buffer` 値の幅となる。",
  "If `true`, the radios can be deselected.": "`true`の場合、Radioを非選択にすることができる。",
  "This property allows developers to specify a custom function or property name for comparing objects when determining the selected option in the ion-radio-group. When not specified, the default behavior will use strict equality (===) for comparison.": "このプロパティを使用すると、開発者は、ion-radio-group で選択されたオプションを決定するときにオブジェクトを比較するためのカスタム関数またはプロパティ名を指定できます。指定しない場合、デフォルトの動作では、比較に厳密な等式 (===) が使用されます。",
  "The error text to display at the top of the radio group.": "ラジオグループ上部に表示するエラーテキスト。",
  "The helper text to display at the top of the radio group.": "ラジオグループ上部に表示するヘルパーテキスト。",
  "the value of the radio group.": "無線グループの値です。",
  "How to control the alignment of the radio and label on the cross axis. `\"start\"`: The label and control will appear on the left of the cross axis in LTR, and on the right side in RTL. `\"center\"`: The label and control will appear at the center of the cross axis in both LTR and RTL. Setting this property will change the radio `display` to `block`.": "Radioとラベルの十字軸上の配置を制御する方法。`\"start\"`：ラベルとコントロールはLTRでは横軸の左側に、RTLでは右側に表示されます。`\"center\"`：ラベルとコントロールはLTRでもRTLでも横軸の中央に表示されます。このプロパティを設定すると、Radioの `display` が `block` に変更されます。",
  "If `true`, the user cannot interact with the radio.": "`true`の場合、ユーザはRadioと対話することができません。",
  "How to pack the label and radio within a line. `\"start\"`: The label and radio will appear on the left in LTR and on the right in RTL. `\"end\"`: The label and radio will appear on the right in LTR and on the left in RTL. `\"space-between\"`: The label and radio will appear on opposite ends of the line with space between the two elements. Setting this property will change the radio `display` to `block`.": "ラベルとRadioを1行にまとめる方法。`\"start\"`：ラベルとRadioはLTRでは左に、RTLでは右に表示されます。`\"end\"`：ラベルとRadioはLTRでは右に、RTLでは左に表示されます。`\"space-between\"`：ラベルとRadioは行の反対側に表示され、2つの要素の間にはスペースが入ります。このプロパティを設定すると、Radioの `display` が `block` に変更されます。",
  "Where to place the label relative to the radio. `\"start\"`: The label will appear to the left of the radio in LTR and to the right in RTL. `\"end\"`: The label will appear to the right of the radio in LTR and to the left in RTL. `\"fixed\"`: The label has the same behavior as `\"start\"` except it also has a fixed width. Long text will be truncated with ellipses (\"...\"). `\"stacked\"`: The label will appear above the radio regardless of the direction. The alignment of the label can be controlled with the `alignment` property.": "Radioに対してラベルを配置する位置。start\"`：ラベルはLTRではRadioの左に、RTLでは右に表示されます。end\"`：ラベルはLTRではRadioの右、RTLでは左に表示される。fixed\"`：ラベルの幅が固定される以外は `\"start\"` と同じ動作をします。長いテキストは省略記号(\"...\")で切り捨てられます。stacked\"`：ラベルは向きに関係なくRadioの上に表示されます。ラベルの整列は `alignment` プロパティで制御できます。",
  "the value of the radio.": "Radioの値です。",
  "Emitted when the radio button loses focus.": "Radioボタンのフォーカスが外れたときに発行されます。",
  "Emitted when the radio button has focus.": "Radioボタンにフォーカスが当たったときに発行されます。",
  "Border radius of the radio": "Radioのボーダー半径",
  "Color of the radio": "Radioのカラー",
  "Color of the checked radio": "チェックしたRadioの色",
  "Border radius of the inner checked radio": "内側のチェック付きRadioのボーダー半径",
  "The label text to associate with the radio. Use the \"labelPlacement\" property to control where the label is placed relative to the radio.": "Radioに関連付けるラベルテキストです。\"labelPlacement\"プロパティを使用して、Radioに対するラベルの相対的な配置を制御します。",
  "The container for the radio mark.": "Radioマークの入れ物です。",
  "The label text describing the radio.": "Radioを説明するラベルテキスト。",
  "The checkmark or dot used to indicate the checked state.": "チェックされた状態を示すために使用されるチェックマークまたはドットです。",
  "The start position of the range active bar. This feature is only available with a single knob (dualKnobs=\"false\"). Valid values are greater than or equal to the min value and less than or equal to the max value.": "Rangeアクティブバーの開始位置です。この機能は、ノブが1つの場合のみ有効です（dualKnobs=\"false\"）。有効な値は、min値以上、max値以下です。",
  "How long, in milliseconds, to wait to trigger the `ionInput` event after each change in the range value.": "Rangeの値が変化するたびに `ionInput` イベントをトリガーするまでの待ち時間（ミリ秒単位）。",
  "If `true`, the user cannot interact with the range.": "`true`の場合、ユーザは範囲と対話することができません。",
  "Show two knobs.": "2つのノブを表示します。",
  "The text to display as the control's label. Use this over the `label` slot if you only need plain text. The `label` property will take priority over the `label` slot if both are used.": "コントロールのラベルとして表示するテキスト。プレーンテキストのみが必要な場合は `label` スロットよりもこちらを使用する。両方を使用する場合は、`label` プロパティが `label` スロットよりも優先される。",
  "Where to place the label relative to the range. `\"start\"`: The label will appear to the left of the range in LTR and to the right in RTL. `\"end\"`: The label will appear to the right of the range in LTR and to the left in RTL. `\"fixed\"`: The label has the same behavior as `\"start\"` except it also has a fixed width. Long text will be truncated with ellipses (\"...\"). `\"stacked\"`: The label will appear above the range regardless of the direction.": "範囲に対するラベルの位置。start\"`：ラベルはLTRでは範囲の左側、RTLでは右側に表示される。end\"`：ラベルはLTRでは範囲の右側、RTLでは左側に表示される。fixed\"`：ラベルの幅が固定される以外は `\"start\"` と同じ動作をします。長いテキストは省略記号(\"...\")で切り捨てられます。積み上げ\"`：ラベルは方向に関係なく範囲の上に表示されます。",
  "Maximum integer value of the range.": "範囲の最大整数値。",
  "Minimum integer value of the range.": "範囲の最小の整数値。",
  "If `true`, a pin with integer value is shown when the knob is pressed.": "`true`の場合、ノブを押したときに整数値のピンが表示されます。",
  "A callback used to format the pin text. By default the pin text is set to `Math.round(value)`.  See https://ionicframework.com/docs/troubleshooting/runtime#accessing-this if you need to access `this` from within the callback.": "ピンのテキストをフォーマットするためのコールバック。デフォルトでは、ピンのテキストは `Math.round(value)` に設定されます。  コールバック内から `this` にアクセスする必要がある場合は https://ionicframework.com/docs/troubleshooting/runtime#accessing-this を参照してください。",
  "If `true`, the knob snaps to tick marks evenly spaced based on the step property value.": "`true`の場合、ノブはステッププロパティの値に基づいて等間隔に配置されたティックマークにスナップします。",
  "Specifies the value granularity.": "値の粒度を指定します。",
  "If `true`, tick marks are displayed based on the step value. Only applies when `snaps` is `true`.": "`true`の場合、ステップの値に基づいてティックマークを表示します。`snaps` が `true` の場合のみ適用される。",
  "the value of the range.": "範囲の値です。",
  "Emitted when the range loses focus.": "Rangeの焦点が合わなくなったときに発行されます。",
  "The `ionChange` event is fired for `<ion-range>` elements when the user modifies the element's value: - When the user releases the knob after dragging; - When the user moves the knob with keyboard arrows  This event will not emit when programmatically setting the `value` property.": "`ionChange` イベントは `<ion-range>` 要素に対して、ユーザがその要素の値を変更したときに発生します。 ・ユーザがドラッグした後にノブを離したとき ・ユーザがキーボードの矢印でノブを移動したとき このイベントはプログラムで`value`プロパティを設定したときには発生しません。",
  "Emitted when the range has focus.": "Rangeのフォーカスが合ったときに発行されます。",
  "The `ionInput` event is fired for `<ion-range>` elements when the value is modified. Unlike `ionChange`, `ionInput` is fired continuously while the user is dragging the knob.": "`ionInput`イベントは、`<ion-range>`要素に対して、値が変更されたときに発生するイベントです。`ionChange`とは異なり、`ionInput`はユーザがノブをドラッグしている間、継続して発生します。",
  "Emitted when the user finishes moving the range knob, whether through mouse drag, touch gesture, or keyboard interaction.": "マウスドラッグ、タッチジェスチャー、キーボード操作など、ユーザーが範囲ノブの移動を終了したときに発行されます。",
  "Emitted when the user starts moving the range knob, whether through mouse drag, touch gesture, or keyboard interaction.": "マウスドラッグ、タッチジェスチャー、キーボード操作など、ユーザーがRangeノブの移動を開始したときに発行されます。",
  "Background of the range bar": "Rangeバーの背景",
  "Background of the active range bar": "アクティブRangeバーの背景",
  "Border radius of the range bar": "Rangeバーのボーダー半径",
  "Height of the range bar": "Rangeバーの高さ",
  "Height of the range": "Rangeの高さ",
  "Background of the range knob": "Rangeノブの背景",
  "Border radius of the range knob": "Rangeツマミのボーダー半径",
  "Box shadow of the range knob": "Rangeノブのボックスシャドウ",
  "Size of the range knob": "Rangeツマミの大きさ",
  "Background of the range pin (only available in MD mode)": "Rangeピンの背景（MD mode時のみ有効）",
  "Color of the range pin (only available in MD mode)": "Rangeピンの色（MD mode時のみ有効）",
  "Content is placed to the right of the range slider in LTR, and to the left in RTL.": "コンテンツは、LTRでは範囲スライダーの右側に、RTLでは左側に配置されます。",
  "The label text to associate with the range. Use the \"labelPlacement\" property to control where the label is placed relative to the range.": "範囲に関連付けるラベルテキスト。`\"labelPlacement`\"プロパティを使用して、ラベルが範囲に対してどの位置に配置されるかを制御します。",
  "Content is placed to the left of the range slider in LTR, and to the right in RTL.": "コンテンツは、LTRでは範囲スライダーの左側に、RTLでは右側に配置されます。",
  "The inactive part of the bar.": "バーの非アクティブな部分。",
  "The active part of the bar.": "バーのアクティブな部分です。",
  "The handle that is used to drag the range.": "範囲をドラッグする際に使用するハンドル。",
  "The label text describing the range.": "範囲を表すラベルテキスト。",
  "The counter that appears above a knob.": "ノブの上に表示されるカウンターです。",
  "An inactive tick mark.": "非アクティブなティックマークです。",
  "An active tick mark.": "アクティブなティックマークです。",
  "A static icon or a spinner to display when you begin to pull down. A spinner name can be provided to gradually show tick marks when pulling down on iOS devices.": "プルダウン開始時に表示する静的なアイコンまたはスピナーです。スピナー名を指定することで、iOSデバイスでプルダウン時に徐々にティックマークが表示されるようにすることができます。",
  "The text you want to display when you begin to pull down. `pullingText` can accept either plaintext or HTML as a string. To display characters normally reserved for HTML, they must be escaped. For example `<Ionic>` would become `&lt;Ionic&gt;`  For more information: [Security Documentation](https://ionicframework.com/docs/faq/security)  Content is parsed as plaintext by default. `innerHTMLTemplatesEnabled` must be set to `true` in the Ionic config before custom HTML can be used.": "プルダウン開始時に表示したいテキストです。 `pullingText` は、文字列としてプレーンテキストまたはHTMLのいずれかを受け取ることができます。通常HTML用に予約されている文字を表示するには、エスケープする必要があります。例えば、`<Ionic>`は `&lt;Ionic&gt;` になります：[セキュリティ・ドキュメント](https://ionicframework.com/docs/faq/security) デフォルトでは、コンテンツはプレーンテキストとして解析されます。カスタムHTMLを使用するには、Ionicの設定で `innerHTMLTemplatesEnabled` を `true` に設定する必要があります。",
  "An animated SVG spinner that shows when refreshing begins": "リフレッシュ開始を示すアニメーションSVGスピナー",
  "The text you want to display when performing a refresh. `refreshingText` can accept either plaintext or HTML as a string. To display characters normally reserved for HTML, they must be escaped. For example `<Ionic>` would become `&lt;Ionic&gt;`  For more information: [Security Documentation](https://ionicframework.com/docs/faq/security)  Content is parsed as plaintext by default. `innerHTMLTemplatesEnabled` must be set to `true` in the Ionic config before custom HTML can be used.": "リフレッシュを行う際に表示したいテキストです。 `refreshingText` には、文字列としてプレーンテキストまたはHTMLのいずれかを指定することができます。通常HTML用に予約されている文字を表示するには、エスケープする必要があります。例えば、`<Ionic>`は `&lt;Ionic&gt;` となります：[セキュリティ・ドキュメント](https://ionicframework.com/docs/faq/security) デフォルトでは、コンテンツはプレーンテキストとして解析されます。カスタムHTMLを使用するには、Ionicの設定で `innerHTMLTemplatesEnabled` を `true` に設定する必要があります。",
  "Time it takes to close the refresher. Does not apply when the refresher content uses a spinner, enabling the native refresher.": "リフレッシャーを閉じるのにかかる時間。リフレッシュコンテンツがスピナーを使用している場合は適用されず、ネイティブリフレッシャーが有効になります。",
  "If `true`, the refresher will be hidden.": "`true`の場合、リフレッシャーは非表示となる。",
  "How much to multiply the pull speed by. To slow the pull animation down, pass a number less than `1`. To speed up the pull, pass a number greater than `1`. The default value is `1` which is equal to the speed of the cursor. If a negative value is passed in, the factor will be `1` instead.  For example: If the value passed is `1.2` and the content is dragged by `10` pixels, instead of `10` pixels the content will be pulled by `12` pixels (an increase of 20 percent). If the value passed is `0.8`, the dragged amount will be `8` pixels, less than the amount the cursor has moved.  Does not apply when the refresher content uses a spinner, enabling the native refresher.": "引きの速さを何倍にするか。引きのアニメーションを遅くするには、`1`より小さい数値を渡します。引っ張る速度を速くするには、`1`より大きい数値を渡します。デフォルト値は `1` で、カーソルの速度と同じです。もし負の値が渡された場合、代わりに `1` が係数となります。  例えば例えば、渡された値が `1.2` で、コンテンツが `10` ピクセルでドラッグされた場合、`10` ピクセルではなく、`12` ピクセルでドラッグされます（20% の増加です）。渡された値が `0.8` の場合、ドラッグされた量はカーソルの移動量より少ない `8` ピクセルとなります。  リフレッシュコンテンツがスピナーを使用している場合は適用されず、ネイティブリフレッシャーが有効になります。",
  "The maximum distance of the pull until the refresher will automatically go into the `refreshing` state. Defaults to the result of `pullMin + 60`. Does not apply when  the refresher content uses a spinner, enabling the native refresher.": "リフレッシャーが自動的に `refreshing` 状態になるまでの、引っ張りの最大距離。デフォルトは `pullMin + 60` の結果です。リフレッシュコンテンツがスピナーを使用している場合は適用されず、ネイティブリフレッシャーが有効になります。",
  "The minimum distance the user must pull down until the refresher will go into the `refreshing` state. Does not apply when the refresher content uses a spinner, enabling the native refresher.": "リフレッシャーが `refreshing` 状態になるまでに、ユーザが引き下げるべき最小距離。リフレッシャーコンテンツがスピナーを使用する場合は適用されず、ネイティブリフレッシャーが有効になる。",
  "Time it takes the refresher to snap back to the `refreshing` state. Does not apply when the refresher content uses a spinner, enabling the native refresher.": "リフレッシャーが `refreshing` 状態にスナップバックするのにかかる時間。リフレッシュコンテンツがスピナーを使用している場合は適用されず、ネイティブリフレッシュが有効になります。",
  "Changes the refresher's state from `refreshing` to `cancelling`.": "リフレッシュの状態を `refreshing` から `cancelling` に変更します。",
  "Call `complete()` when your async operation has completed. For example, the `refreshing` state is while the app is performing an asynchronous operation, such as receiving more data from an AJAX request. Once the data has been received, you then call this method to signify that the refreshing has completed and to close the refresher. This method also changes the refresher's state from `refreshing` to `completing`.": "非同期操作が完了したら `complete()` を呼び出します。例えば、`refreshing`状態は、アプリがAJAXリクエストからより多くのデータを受信するなど、非同期操作を実行している間です。データを受信したら、このメソッドを呼び出して、リフレッシュが完了したことを示し、リフレッシュャを閉じます。このメソッドは、リフレッシャーの状態を `refreshing` から `completing` に変更します。",
  "A number representing how far down the user has pulled. The number `0` represents the user hasn't pulled down at all. The number `1`, and anything greater than `1`, represents that the user has pulled far enough down that when they let go then the refresh will happen. If they let go and the number is less than `1`, then the refresh will not happen, and the content will return to it's original position.": "ユーザーがどれだけ下に引っ張られたかを表す数値です。数値 `0` は、ユーザーが全く下に引いていないことを表します。数値 `1` および `1` より大きい数値は、ユーザーが手を離したときに更新が行われるほど十分に下に引っ張られたことを表します。もしユーザーが手を離し、数値が `1` より小さい場合は、更新は行われず、コンテンツは元の位置に戻ります。",
  "Emitted while the user is pulling down the content and exposing the refresher.": "ユーザーがコンテンツを引き下げ、リフレッシャーを露出している間に発行されます。",
  "Emitted when the user lets go of the content and has pulled down further than the `pullMin` or pulls the content down and exceeds the pullMax. Updates the refresher state to `refreshing`. The `complete()` method should be called when the async operation has completed.": "ユーザーがコンテンツから手を離し、`pullMin`を越えて下に引いたとき、またはコンテンツを下に引き、pullMaxを越えたときに発行されます。リフレッシャーの状態を `refreshing` に更新します。非同期処理が完了したら `complete()` メソッドを呼び出す必要があります。",
  "Emitted when the user begins to start pulling down.": "ユーザーが引き下げを開始するときに発行されます。",
  "If `true`, the reorder will be hidden.": "`true`の場合、リオーダーは非表示になる。",
  "Completes the reorder operation. Must be called by the `ionReorderEnd` event.  If a list of items is passed, the list will be reordered and returned in the proper order.  If no parameters are passed or if `true` is passed in, the reorder will complete and the item will remain in the position it was dragged to. If `false` is passed, the reorder will complete and the item will bounce back to its original position.": "並べ替え操作を完了します。`ionReorderEnd` イベントで呼び出す必要があります。アイテムの配列が渡された場合は並べ替えられ、正しい順序で返されます。引数がない、または `true` が渡された場合は並べ替えを確定し、アイテムはドラッグ先の位置に留まります。`false` の場合は並べ替えが完了し、アイテムは元の位置に戻ります。",
  "Event that needs to be listened to in order to complete the reorder action.": "並べ替えアクションを完了するためにリッスンが必要なイベント。",
  "Event that is emitted when the reorder gesture ends. The from and to properties are always available, regardless of if the reorder gesture moved the item. If the item did not change from its start position, the from and to properties will be the same. Once the event has been emitted, the `complete()` method then needs to be called in order to finalize the reorder action.": "Event that is emitted when the reorder gesture ends. The from and to properties are always available, regardless of if the reorder gesture moved the item. If the item did not change from its start position, the from and to properties will be the same. Once the event has been emitted, the `complete()` method then needs to be called in order to finalize the reorder action.",
  "Event that is emitted as the reorder gesture moves.": "Event that is emitted as the reorder gesture moves.",
  "Event that is emitted when the reorder gesture starts.": "Event that is emitted when the reorder gesture starts.",
  "The icon of the reorder handle (uses ion-icon).": "リオーダーハンドルのアイコンです（ion-iconを使用）。",
  "Sets the type of ripple-effect:  - `bounded`: the ripple effect expands from the user's click position - `unbounded`: the ripple effect expands from the center of the button and overflows the container.  NOTE: Surfaces for bounded ripples should have the overflow property set to hidden, while surfaces for unbounded ripples should have it set to visible.": "リップル効果の種類を設定します： - `bounded`：リップル効果はユーザーのクリック位置から拡大します - `unbounded`：リップル効果はボタンの中心から拡大し、コンテナを溢れさせます。  注：境界のある波紋のサーフェスは、overflowプロパティをhiddenに設定し、境界のない波紋のサーフェスは、visibleに設定する必要があります。",
  "Adds the ripple effect to the parent element.": "親要素に波及効果を付加します。",
  "A redirect route, redirects \"from\" a URL \"to\" another URL. This property is that \"from\" URL. It needs to be an exact match of the navigated URL in order to apply.  The path specified in this value is always an absolute path, even if the initial `/` slash is not specified.": "リダイレクトルートは、あるURLから別のURLへリダイレクトさせるルートです。このプロパティは、その \"from\" URLです。このプロパティを適用するには、ナビゲートされるURLと完全に一致する必要があります。  この値で指定されるパスは、最初の `/` スラッシュが指定されていない場合でも、常に絶対パスとなります。",
  "A redirect route, redirects \"from\" a URL \"to\" another URL. This property is that \"to\" URL. When the defined `ion-route-redirect` rule matches, the router will redirect to the path specified in this property.  The value of this property is always an absolute path inside the scope of routes defined in `ion-router` it can't be used with another router or to perform a redirection to a different domain.  Note that this is a virtual redirect, it will not cause a real browser refresh, again, it's a redirect inside the context of ion-router.  When this property is not specified or his value is `undefined` the whole redirect route is noop, even if the \"from\" value matches.": "リダイレクトルートは、あるURLから別のURLへリダイレクトさせるルートです。このプロパティは、その \"to \"URLです。定義された `ion-route-redirect` ルールにマッチした場合、ルータはこのプロパティで指定されたパスにリダイレクトします。  このプロパティの値は、常に `ion-router` で定義されたルートの範囲内の絶対パスであり、別のルータや別のドメインへのリダイレクトを実行するために使用することはできません。  これは仮想的なリダイレクトであり、実際のブラウザのリフレッシュを引き起こすことはないことに注意してください。  このプロパティが指定されていない場合、または値が `undefined` の場合、たとえ \"from\" の値が一致しても、リダイレクトルート全体は noop となります。",
  "Internal event that fires when any value of this rule is added/removed from the DOM, or any of his public properties changes.  `ion-router` captures this event in order to update his internal registry of router rules.": "このルールの値がDOMから追加/削除されたり、パブリックプロパティが変更されたりしたときに発生する内部イベントです。  `ion-router`は、ルータルールの内部レジストリを更新するために、このイベントを捕捉します。",
  "A navigation hook that is fired when the route tries to enter. Returning `true` allows the navigation to proceed, while returning `false` causes it to be cancelled. Returning a `NavigationHookOptions` object causes the router to redirect to the path specified.": "ルーターがアクセスしようとしたときに発生するナビゲーションフックです。 `true`を返すとナビゲーションを進めることができ、`false`を返すとナビゲーションをキャンセルすることができます。NavigationHookOptions`オブジェクトを返すと、ルーターは指定されたパスにリダイレクトするようになります。",
  "A navigation hook that is fired when the route tries to leave. Returning `true` allows the navigation to proceed, while returning `false` causes it to be cancelled. Returning a `NavigationHookOptions` object causes the router to redirect to the path specified.": "ルートが離脱しようとしたときに発生するナビゲーションフックです。 `true`を返すとナビゲーションを進めることができ、`false`を返すとナビゲーションをキャンセルすることができます。NavigationHookOptions`オブジェクトを返すと、ルーターは指定されたパスにリダイレクトするようになります。",
  "Name of the component to load/select in the navigation outlet (`ion-tabs`, `ion-nav`) when the route matches.  The value of this property is not always the tagname of the component to load, in `ion-tabs` it actually refers to the name of the `ion-tab` to select.": "ルートが一致したときに、ナビゲーションアウトレット（`ion-tabs`、`ion-nav`）にロード/選択するコンポーネントの名前。  このプロパティの値は、常にロードするコンポーネントのタグ名とは限らず、`ion-tabs`では、実際には選択する `ion-tab` の名前を指します。",
  "A key value `{ 'red': true, 'blue': 'white'}` containing props that should be passed to the defined component when rendered.": "キーとなる値 `{ 'red': true, 'blue':'white'}` には、レンダリング時に定義されたコンポーネントに渡すべき小道具が含まれる。",
  "Relative path that needs to match in order for this route to apply.  Accepts paths similar to expressjs so that you can define parameters in the url /foo/:bar where bar would be available in incoming props.": "このルートを適用するために一致させる必要がある相対パスです。  expressjs と同様にパスを受け付けるので、/foo/:bar のような url でパラメータを定義し、受信する props で bar を利用することができます。",
  "Used internally by `ion-router` to know when this route did change.": "このルートがいつ変更されたかを知るために `ion-router` が内部で使用します。",
  "Background of the router link": "ルーターリンクの背景",
  "Text color of the router link": "ルーターリンクの文字色",
  "If `true`, the router-outlet should animate the transition of components.": "`true`の場合、ルータ・アウトレットはコンポーネントの遷移をアニメーションで表現する必要があります。",
  "This property allows to create custom transition using AnimationBuilder functions.": "このプロパティは、AnimationBuilder の機能を使用して、カスタムトランジションを作成することができます。",
  "The root path to use when matching URLs. By default, this is set to \"/\", but you can specify an alternate prefix for all URL paths.": "URLのマッチング時に使用するルートパスです。デフォルトでは\"/\"に設定されていますが、すべてのURLパスに対して代替プレフィックスを指定することができます。",
  "The router can work in two \"modes\": - With hash: `/index.html#/path/to/page` - Without hash: `/path/to/page`  Using one or another might depend in the requirements of your app and/or where it's deployed.  Usually \"hash-less\" navigation works better for SEO and it's more user friendly too, but it might requires additional server-side configuration in order to properly work.  On the other side hash-navigation is much easier to deploy, it even works over the file protocol.  By default, this property is `true`, change to `false` to allow hash-less URLs.": "ルーターは2つの \"モード \"で動作します。- ハッシュを使用します。ハッシュあり： `/index.html#/path/to/page` - ハッシュなし。ハッシュなし： `/path/to/page` - ハッシュあり： `/index.html#/path/to/page` どちらを使うかは、アプリの要件や配置される場所によって異なるかもしれません。  通常、\"ハッシュなし\"ナビゲーションはSEOに有利で、よりユーザーフレンドリーですが、適切に動作させるためにサーバー側の追加設定が必要な場合があります。  一方、ハッシュ・ナビゲーションは、ファイル・プロトコルで動作するため、導入が非常に簡単です。  デフォルトでは、このプロパティは `true` です。ハッシュのない URL を許可するには `false` に変更します。",
  "Go back to previous page in the window.history.": "window.historyで前ページに戻る。",
  "Navigate to the specified path.": "指定されたパスに移動します。",
  "Emitted when the route had changed": "ルートが変更されたときに発行されます。",
  "Event emitted when the route is about to change": "ルートが変更されようとするときに発行されます。イベント",
  "If `true`, enable searchbar animation.": "`true`の場合、検索バーのアニメーションを有効にします。",
  "Set the input's autocomplete property.": "Inputのオートコンプリートプロパティを設定します。",
  "Set the input's autocorrect property.": "Inputのオートコレクトプロパティを設定します。",
  "Set the cancel button icon. Only applies to `md` mode. Defaults to `arrow-back-sharp`.": "キャンセルボタンのアイコンを設定します。 `md` modeのみに適用されます。デフォルトは `arrow-back-sharp` です。",
  "Set the cancel button text. Only applies to `ios` mode.": "Set the cancel button text. Only applies to `ios` mode.",
  "Set the clear icon. Defaults to `close-circle` for `ios` and `close-sharp` for `md`.": "クリアアイコンを設定します。デフォルトは `ios` の場合は `close-circle` 、`md` の場合は `close-sharp` です。",
  "This attribute specifies the maximum number of characters that the user can enter.": "この属性は、ユーザが入力できる最大文字数を指定します。",
  "This attribute specifies the minimum number of characters that the user can enter.": "この属性は、ユーザーが入力できる最小の文字数を指定します。",
  "If used in a form, set the name of the control, which is submitted with the form data.": "フォームで使用する場合は、フォーム・データと一緒に送信されるコントロールの名前を設定します。",
  "Set the input's placeholder. `placeholder` can accept either plaintext or HTML as a string. To display characters normally reserved for HTML, they must be escaped. For example `<Ionic>` would become `&lt;Ionic&gt;`  For more information: [Security Documentation](https://ionicframework.com/docs/faq/security)": "Inputのplaceholderを設定します。 `placeholder` には、文字列としてプレーンテキストまたはHTMLのいずれかを指定することができます。通常HTML用に予約されている文字を表示するには、エスケープする必要があります。例えば `<Ionic>` は `&lt;Ionic&gt;` になります。詳細は [セキュリティ・ドキュメンテーション](https://ionicframework.com/docs/faq/security) をご覧ください。",
  "The icon to use as the search icon. Defaults to `search-outline` in `ios` mode and `search-sharp` in `md` mode.": "検索アイコンとして使用するアイコンです。デフォルトは `ios` modeでは `search-outline` 、`md` modeでは `search-sharp` です。",
  "Sets the behavior for the cancel button. Defaults to `\"never\"`. Setting to `\"focus\"` shows the cancel button on focus. Setting to `\"never\"` hides the cancel button. Setting to `\"always\"` shows the cancel button regardless of focus state.": "キャンセルボタンに関する動作を設定します。デフォルトは `\"never\"` です。focus\"` に設定すると、フォーカスが当たったときにキャンセルボタンを表示します。never\"`に設定すると、キャンセルボタンを非表示にします。always\"` に設定すると、フォーカスの状態に関係なくキャンセルボタンを表示します。",
  "Sets the behavior for the clear button. Defaults to `\"focus\"`. Setting to `\"focus\"` shows the clear button on focus if the input is not empty. Setting to `\"never\"` hides the clear button. Setting to `\"always\"` shows the clear button regardless of focus state, but only if the input is not empty.": "クリアボタンに関する動作を設定します。デフォルトは `\"focus\"` です。`\"focus\"`に設定すると、Inputが空でない場合、フォーカス時にクリアボタンを表示します。`\"never\"`に設定すると、クリアボタンを非表示にします。`\"always\"`に設定すると、フォーカスの状態に関係なくクリアボタンを表示するが、Inputが空でない場合にのみクリアボタンを表示します。",
  "If `true`, enable spellcheck on the input.": "`true`の場合、入力値のスペルチェックを有効にします。",
  "Set the type of the input.": "Inputの種類を設定します。",
  "the value of the searchbar.": "検索バーの値。",
  "Sets focus on the native `input` in `ion-searchbar`. Use this method instead of the global `input.focus()`. Developers who wish to focus an input when a page enters should call `setFocus()` in the `ionViewDidEnter()` lifecycle method. Developers who wish to focus an input when an overlay is presented should call `setFocus` after `didPresent` has resolved.  See [managing focus](/docs/developing/managing-focus) for more information.": "Sets focus on the native `input` in `ion-searchbar`. Use this method instead of the global `input.focus()`. Developers who wish to focus an input when a page enters should call `setFocus()` in the `ionViewDidEnter()` lifecycle method. Developers who wish to focus an input when an overlay is presented should call `setFocus` after `didPresent` has resolved.  See [managing focus](/docs/developing/managing-focus) for more information.",
  "Emitted when the cancel button is clicked.": "キャンセルボタンがクリックされたときに発行されます。",
  "The `ionChange` event is fired for `<ion-searchbar>` elements when the user modifies the element's value. Unlike the `ionInput` event, the `ionChange` event is not necessarily fired for each alteration to an element's value.  The `ionChange` event is fired when the value has been committed by the user. This can happen when the element loses focus or when the \"Enter\" key is pressed. `ionChange` can also fire when clicking the clear or cancel buttons.  This event will not emit when programmatically setting the `value` property.": "`onChange` イベントは、ユーザが要素の値を変更したときに `<ion-searchbar>` 要素に対して発生する。`ionInput` イベントとは異なり、要素の値が変更されるたびに `ionChange` イベントが発生するわけではない。  `ionChange` イベントは、ユーザによって値が変更されたときに発生する。これは、要素のフォーカスが外れたときや、\"Enter\" キーが押されたときに発生する。また、クリアボタンやキャンセルボタンをクリックしたときにも `ionChange` イベントが発生することがある。  プログラムで `value` プロパティを設定した場合には、このイベントは発生しない。",
  "Emitted when the clear input button is clicked.": "Clear Inputボタンがクリックされたときに発行されます。",
  "Emitted when the `value` of the `ion-searchbar` element has changed.": "`ion-searchbar`要素の `value` が変更されたときに発行されます。",
  "Background of the searchbar input": "検索バーのInputの背景",
  "Border radius of the searchbar input": "検索バーのInputのボーダー半径",
  "Box shadow of the searchbar input": "検索バーのInputのボックスシャドウ",
  "Color of the searchbar cancel button": "検索バーのキャンセルボタンの色",
  "Color of the searchbar clear button": "検索バーのクリアボタンの色",
  "Color of the searchbar text": "検索バーのテキストの色",
  "Color of the searchbar icon": "検索バーのアイコンの色",
  "Color of the searchbar placeholder": "検索バーのPlaceholderの色",
  "Font style of the searchbar placeholder": "検索バーのPlaceholderのFont Style",
  "Font weight of the searchbar placeholder": "検索バーのPlaceholderのFont Weight",
  "Opacity of the searchbar placeholder": "検索バーのPlaceholderの不透明度",
  "The `id` of the segment content.": "セグメントコンテンツの `id` 。",
  "If `true`, the user cannot interact with the segment button.": "`true`の場合、ユーザーはセグメントボタンを操作することができません。",
  "Set the layout of the text and icon in the segment.": "セグメント内のテキストとアイコンのレイアウトを設定します。",
  "The value of the segment button.": "セグメントボタンの値です。",
  "Background of the segment button": "セグメントボタンの背景",
  "Background of the checked segment button": "チェックしたセグメントボタンの背景",
  "Background of the segment button when focused with the tab key": "タブキーでフォーカスされたときのセグメントボタンの背景",
  "Opacity of the segment button background when focused with the tab key": "タブキーでフォーカスしたときのセグメントボタンの背景の不透明度",
  "Background of the segment button on hover": "セグメントボタンがホバーされたときの背景",
  "Opacity of the segment button background on hover": "ホバー時のセグメントボタンの背景の不透明度",
  "Color of the segment button border": "セグメントボタンのボーダーの色",
  "Radius of the segment button border": "セグメントボタンのボーダーの半径",
  "Style of the segment button border": "セグメントボタンのボーダーのスタイル",
  "Width of the segment button border": "セグメントボタンの枠の幅",
  "Color of the segment button": "セグメントボタンの色",
  "Color of the checked segment button": "チェックしたセグメントボタンの色",
  "Color of the segment button when focused with the tab key": "タブキーでフォーカスしたときのセグメントボタンの色",
  "Color of the segment button on hover": "ホバー時のセグメントボタンの色",
  "Box shadow on the indicator for the checked segment button": "チェックしたセグメントボタンのインジケーターにボックスシャドウを付ける",
  "Color of the indicator for the checked segment button": "チェックしたセグメントボタンのインジケーターの色",
  "Height of the indicator for the checked segment button": "チェックしたセグメントボタンのインジケータの高さ",
  "Transform of the indicator for the checked segment button": "チェックされたセグメントボタンのインジケータのトランスフォーム",
  "Transition of the indicator for the checked segment button": "チェックしたセグメントボタンのインジケーターの遷移",
  "Bottom margin of the segment button": "セグメントボタンのBottom Margin",
  "Right margin if direction is left-to-right, and left margin if direction is right-to-left of the segment button": "セグメントボタンの方向が左から右の場合はRight Margin、右から左の場合はLeft Margin",
  "Left margin if direction is left-to-right, and right margin if direction is right-to-left of the segment button": "セグメントボタンの方向が左から右の場合はLeft Margin、右から左の場合はRight Margin",
  "Top margin of the segment button": "セグメントボタンのTop Margin",
  "Bottom padding of the segment button": "セグメントボタンのBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the segment button": "セグメントボタンの向きが左から右の場合はRight Padding、右から左の場合はLeft Paddingとなります。",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the segment button": "セグメントボタンの向きが左から右の場合はLeft Padding、右から左の場合はRight Paddingとなります。",
  "Top padding of the segment button": "セグメントボタンのTop Padding",
  "Transition of the segment button": "セグメントボタンの遷移",
  "The indicator displayed on the checked segment button.": "チェックしたセグメントボタンに表示されるインジケーターです。",
  "The background element for the indicator displayed on the checked segment button.": "チェックしたセグメントボタンに表示されるインジケータの背景要素です。",
  "If `true`, the segment view cannot be interacted with.": "`true`の場合、セグメントビューは操作できない。",
  "Emitted when the segment view is scrolled.": "セグメントビューがスクロールされたときに発せられる。",
  "If `true`, the user cannot interact with the segment.": "`true`の場合、ユーザーはセグメントと対話することができません。",
  "If `true`, the segment buttons will overflow and the user can swipe to see them. In addition, this will disable the gesture to drag the indicator between the buttons in order to swipe to see hidden buttons.": "`true`の場合、セグメントボタンはオーバーフローし、ユーザーはスワイプしてそれらを見ることができます。また、スワイプして隠れたボタンを見るために、ボタンの間でインジケータをドラッグするジェスチャーを無効にします。",
  "If `true`, navigating to an `ion-segment-button` with the keyboard will focus and select the element. If `false`, keyboard navigation will only focus the `ion-segment-button` element.": "`true`の場合、キーボードで `ion-segment-button` に移動すると、その要素にフォーカスが当たって選択される。 `false` の場合、キーボードによるナビゲーションは `ion-segment-button` 要素にのみフォーカスを当てます。",
  "If `true`, users will be able to swipe between segment buttons to activate them.": "`true`の場合、ユーザーはセグメントボタンの間をスワイプしてアクティブにすることができます。",
  "the value of the segment.": "セグメントの価値",
  "Emitted when the value property has changed and any dragging pointer has been released from `ion-segment`.  This event will not emit when programmatically setting the `value` property.": "valueプロパティが変更され、`ion-segment`からドラッグしていたポインタが解放されたときに発行される。  プログラムで `value` プロパティを設定した場合は、このイベントは発生しない。",
  "If `true`, the user cannot interact with the select option. This property does not apply when `interface=\"action-sheet\"` as `ion-action-sheet` does not allow for disabled buttons.": "`true`の場合、ユーザは選択オプションと対話することができません。このプロパティは、`interface=\"action-sheet\"`の場合には適用されない。なぜなら、`ion-action-sheet`はボタンを無効にすることができないからです。",
  "The text to display on the cancel button.": "キャンセルボタンに表示するテキストです。",
  "The color to use from your application's color palette. Default options are: `\"primary\"`, `\"secondary\"`, `\"tertiary\"`, `\"success\"`, `\"warning\"`, `\"danger\"`, `\"light\"`, `\"medium\"`, and `\"dark\"`. For more information on colors, see [theming](/docs/theming/basics).  This property is only available when using the modern select syntax.": "アプリケーションのカラーパレットから使用する色を指定します。デフォルトのオプションは以下の通りです：`\"primary\"`, `\"secondary\"`, `\"tertiary\"`, `\"success\"`, `\"warning\"`, `\"danger\"`, `\"light\"`, `\"medium\"`, と `\"dark\"` です．色についての詳細は [theming](/docs/theming/basics) を参照してください。  このプロパティは、modern select構文を使用する場合にのみ利用可能です。",
  "This property allows developers to specify a custom function or property name for comparing objects when determining the selected option in the ion-select. When not specified, the default behavior will use strict equality (===) for comparison.": "このプロパティを使用すると、開発者は、ion-select で選択されたオプションを決定するときにオブジェクトを比較するためのカスタム関数またはプロパティ名を指定できます。指定しない場合、デフォルトの動作では比較に厳密な等式 (===) が使用されます。",
  "If `true`, the user cannot interact with the select.": "`true`の場合、ユーザはセレクトと対話することができません。",
  "Text that is placed under the select and displayed when an error is detected.": "Text that is placed under the select and displayed when an error is detected.",
  "The toggle icon to show when the select is open. If defined, the icon rotation behavior in `md` mode will be disabled. If undefined, `toggleIcon` will be used for when the select is both open and closed.": "セレクトが開いているときに表示するトグルアイコン。定義されている場合、`md`モードでのアイコン回転の動作は無効になる。未定義の場合、セレクトが開いているときも閉じているときも `toggleIcon` が使用される。",
  "Text that is placed under the select and displayed when no error is detected.": "Text that is placed under the select and displayed when no error is detected.",
  "The interface the select should use: `action-sheet`, `popover`, `alert`, or `modal`.": "セレクトが使用するインターフェース：action-sheet`, `popover`, `alert`, または `modal`.",
  "Any additional options that the `alert`, `action-sheet` or `popover` interface can take. See the [ion-alert docs](./alert), the [ion-action-sheet docs](./action-sheet), the [ion-popover docs](./popover), and the [ion-modal docs](./modal) for the create options for each interface.  Note: `interfaceOptions` will not override `inputs` or `buttons` with the `alert` interface.": "alert`、`action-sheet`、`popover` インターフェースが取ることができる追加オプション。各インターフェイスの作成オプションについては、[ion-alert docs](./alert), [ion-action-sheet docs](./action-sheet), [ion-popover docs](./popover), [ion-modal docs](./modal) を参照してください。  注意: `interfaceOptions` は `alert` インターフェイスの `inputs` や `buttons` を上書きしない。",
  "How to pack the label and select within a line. `justify` does not apply when the label and select are on different lines when `labelPlacement` is set to `\"floating\"` or `\"stacked\"`. `\"start\"`: The label and select will appear on the left in LTR and on the right in RTL. `\"end\"`: The label and select will appear on the right in LTR and on the left in RTL. `\"space-between\"`: The label and select will appear on opposite ends of the line with space between the two elements.": "ラベルとセレクトを1行にまとめる方法。`labelPlacement`が `\"floating\"` または `\"stacked\"` に設定されている場合、ラベルとセレクトが異なる行にあるときは `justify` は適用されません。`\"start\"`：ラベルとセレクトはLTRでは左側に、RTLでは右側に表示されます。`\"end\"`：ラベルとセレクトはLTRでは右に、RTLでは左に表示されます。\"space-between\"`：ラベルとセレクトは行の反対側の端に表示され、2つの要素の間にはスペースがあります。",
  "The visible label associated with the select.  Use this if you need to render a plaintext label.  The `label` property will take priority over the `label` slot if both are used.": "セレクトに関連付けられた可視ラベル。  プレーンテキストのラベルをレンダリングする必要がある場合に使用する。  `label`プロパティは `label` スロットよりも優先される。",
  "Where to place the label relative to the select. `\"start\"`: The label will appear to the left of the select in LTR and to the right in RTL. `\"end\"`: The label will appear to the right of the select in LTR and to the left in RTL. `\"floating\"`: The label will appear smaller and above the select when the select is focused or it has a value. Otherwise it will appear on top of the select. `\"stacked\"`: The label will appear smaller and above the select regardless even when the select is blurred or has no value. `\"fixed\"`: The label has the same behavior as `\"start\"` except it also has a fixed width. Long text will be truncated with ellipses (\"...\"). When using `\"floating\"` or `\"stacked\"` we recommend initializing the select with either a `value` or a `placeholder`.": "セレクトに対してラベルを配置する位置。`\"start\"`：ラベルはLTRではセレクトの左側に、RTLでは右側に表示されます。`\"end\"`：ラベルはLTRではセレクトの右側に、RTLでは左側に表示されます。\"floating\"`：ラベルは、セレクトがフォーカスされているか、セレクトに値がある場合、小さく表示され、セレクトの上に表示されます。それ以外の場合は、セレクトの上に表示されます。\"stacked\"`：ラベルは、セレクトがぼやけた状態や値がない状態でも、小さく表示され、セレクトの上に表示されます。`\"fixed\"`：ラベルの幅が固定される以外は、`\"start\"`と同じ動作になります。長いテキストは省略記号（\"...\"）で切り捨てられます。`\"floating\"`や \"stacked\"`を使用する場合は、selectに `value` か `placeholder` のどちらかを指定して初期化することをお勧めします。",
  "If `true`, the select can accept multiple values.": "`true`の場合、selectは複数の値を受け入れることができる。",
  "The text to display on the ok button.": "okボタンに表示するテキストです。",
  "The text to display when the select is empty.": "セレクトが空のときに表示するテキストです。",
  "The text to display instead of the selected option's value.": "選択されたオプションの値の代わりに表示するテキストです。",
  "The shape of the select. If \"round\" it will have an increased border radius.": "セレクトの形状を指定します。`round`の場合、境界線の半径が大きくなります。",
  "The toggle icon to use. Defaults to `chevronExpand` for `ios` mode, or `caretDownSharp` for `md` mode.": "使用するトグルアイコン。デフォルトは `ios` モードの場合は `chevronExpand` で、`md` モードの場合は `caretDownSharp` である。",
  "The value of the select.": "セレクトの値です。",
  "Open the select overlay. The overlay is either an alert, action sheet, or popover, depending on the `interface` property on the `ion-select`.": "セレクトオーバーレイを開きます。オーバーレイは `ion-select` の `interface` プロパティによって、アラート、アクションシート、ポップオーバーのいずれかになります。",
  "Emitted when the select loses focus.": "セレクトのフォーカスが外れたときに発行されます。",
  "Emitted when the selection is cancelled.": "選択がキャンセルされたときに発行されます。",
  "Emitted when the overlay is dismissed.": "オーバーレイが解除されたときに発行されます。",
  "Emitted when the select has focus.": "セレクトにフォーカスが当たったときに発行されます。",
  "Background of the select": "セレクトの背景",
  "Color of the select border": "セレクトボーダーの色",
  "Radius of the select border. A large radius may display unevenly when using fill=\"outline\"; if needed, use shape=\"round\" instead or increase --padding-start.": "選択枠の半径。fill=\"outline \"を使う場合、半径が大きいと表示が不均一になることがあります。",
  "Style of the select border": "セレクトボーダーのスタイル",
  "Width of the select border": "セレクトボーダーの幅",
  "The color of the highlight on the select when focused": "フォーカス時のセレクトのハイライトの色",
  "The color of the highlight on the select when invalid": "無効時のセレクトのハイライトの色",
  "The color of the highlight on the select when valid": "有効時のセレクトのハイライトの色",
  "The height of the highlight on the select. Only applies to md mode.": "セレクトのハイライトの高さ。mdモードにのみ適用される。",
  "Bottom padding of the select": "セレクトのBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the select": "セレクトの方向が左から右の場合はRight Padding、右から左の場合はLeft Paddingを行う",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the select": "セレクトの方向が左から右の場合はLeft Padding、右から左の場合はRight Padding",
  "Top padding of the select": "セレクトのTop Padding",
  "Color of the select placeholder text": "セレクトPlaceholderテキストの色",
  "Opacity of the select placeholder text": "セレクトPlaceholderテキストの不透明度",
  "The color of the ripple effect on MD mode.": "MDモード時のリップルエフェクトの色です。",
  "Content to display at the trailing edge of the select.": "セレクトの最後尾に表示するコンテンツ。",
  "The label text to associate with the select. Use the `labelPlacement` property to control where the label is placed relative to the select. Use this if you need to render a label with custom HTML.": "セレクトに関連付けるラベルテキスト。`labelPlacement`プロパティを使用して、selectに対するラベルの位置を制御します。ラベルをカスタムHTMLでレンダリングする必要がある場合に使用します。",
  "Content to display at the leading edge of the select.": "セレクトの最先端に表示するコンテンツ。",
  "The container for the selected text or placeholder.": "セレクトテキストまたはプレースホルダーのコンテナ。",
  "Supporting text displayed beneath the select when the select is invalid and touched.": "Supporting text displayed beneath the select when the select is invalid and touched.",
  "Supporting text displayed beneath the select when the select is valid.": "Supporting text displayed beneath the select when the select is valid.",
  "The select icon container.": "セレクトアイコンのコンテナです。",
  "The label text describing the select.": "セレクトを表すラベルテキスト。",
  "The text displayed in the select when there is no value.": "値がないときにセレクトに表示されるテキスト。",
  "Supporting text displayed beneath the select.": "Supporting text displayed beneath the select.",
  "The displayed value of the select.": "セレクトの表示値です。",
  "If `true`, the skeleton text will animate.": "`true`の場合、スケルトンテキストをアニメーションさせる。",
  "Background of the skeleton text": "スケルトンテキストの背景",
  "Background of the skeleton text in rgb format": "スケルトンテキストの背景（rgb形式",
  "Border radius of the skeleton text": "スケルトンテキストのボーダー半径",
  "Duration of the spinner animation in milliseconds. The default varies based on the spinner.": "スピナーアニメーションの持続時間（ミリ秒）。デフォルトはスピナーによって異なる。",
  "The name of the SVG spinner to use. If a name is not provided, the platform's default spinner will be used.": "使用するSVGスピナーの名前。名前が提供されない場合、プラットフォームのデフォルトのスピナーが使用されます。",
  "If `true`, the spinner's animation will be paused.": "`true`の場合、スピナーのアニメーションは一時停止されます。",
  "Color of the spinner": "スピナーの色",
  "If `true`, the split pane will be hidden.": "`true`の場合、分割ペインが非表示になります。",
  "When the split-pane should be shown. Can be a CSS media query expression, or a shortcut expression. Can also be a boolean expression.": "分割パネルを表示するタイミング。CSSメディアクエリ式、またはショートカット式を指定します。また、ブーリアン表現も可能です。",
  "Expression to be called when the split-pane visibility has changed": "分割画面の表示が変わったときに呼び出される式",
  "Border between panes": "ペイン間のボーダー",
  "Maximum width of the side pane. Does not apply when split pane is collapsed.": "サイドペインの最大幅を指定します。分割ペインが折りたたまれた状態では適用されません。",
  "Minimum width of the side pane. Does not apply when split pane is collapsed.": "サイドペインの最小幅を指定します。分割ペインが折りたたまれた状態では適用されません。",
  "Width of the side pane. Does not apply when split pane is collapsed.": "サイドペインの幅を指定します。分割ペインが折りたたまれた状態では適用されません。",
  "The selected tab component": "選択されたタブコンポーネント",
  "If `true`, the tab bar will be translucent. Only applies when the mode is `\"ios\"` and the device supports [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility).": "`true`の場合、タブバーを半透明にします。modeが `\"ios\"` で、デバイスが [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility) をサポートしている場合にのみ適用されます。",
  "Background of the tab bar": "タブバーの背景",
  "Border of the tab bar": "タブバーの境界線",
  "Color of the tab bar": "タブバーの色",
  "If `true`, the user cannot interact with the tab button.": "`true`の場合、ユーザはタブボタンを操作することができません。",
  "Set the layout of the text and icon in the tab bar. It defaults to `\"icon-top\"`.": "タブバーのテキストとアイコンのレイアウトを設定します。デフォルトは`\"icon-top\"`です。",
  "A tab id must be provided for each `ion-tab`. It's used internally to reference the selected tab or by the router to switch between them.": "各 `ion-tab` にはタブ ID を指定する必要があります。これは、選択されたタブを参照したり、ルータがタブを切り替えたりするために内部的に使用される。",
  "Background of the tab button": "タブボタンの背景",
  "Background of the tab button when focused with the tab key": "タブキーでフォーカスされたときのタブボタンの背景",
  "Opacity of the tab button background when focused with the tab key": "タブキーでフォーカスしたときのタブボタンの背景の不透明度",
  "Color of the tab button": "タブボタンの色",
  "Color of the tab button when focused with the tab key": "タブキーでフォーカスしたときのタブボタンの色",
  "Color of the selected tab button": "選択されたタブボタンの色",
  "Bottom padding of the tab button": "タブボタンのBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the tab button": "タブボタンの向きが左から右の場合はRight Padding、右から左の場合はLeft Paddingとなります。",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the tab button": "タブボタンの向きが左から右の場合はLeft Padding、右から左の場合はRight Paddingとなります。",
  "Top padding of the tab button": "タブボタンのTop Padding",
  "The native HTML anchor element that wraps all child elements.": "すべての子要素を包むネイティブHTMLのアンカー要素です。",
  "The component to display inside of the tab.": "タブの内側に表示するコンポーネントです。",
  "Set the active component for the tab": "タブのアクティブコンポーネントを設定します。",
  "Get the currently selected tab. This method is only available for vanilla JavaScript projects. The Angular, React, and Vue implementations of tabs are coupled to each framework's router.": "現在選択されているタブを取得します。このメソッドは、バニラJavaScriptプロジェクトでのみ使用できます。Angular、React、Vueのタブの実装は、各フレームワークのルーターと結合しています。",
  "Get a specific tab by the value of its `tab` property or an element reference. This method is only available for vanilla JavaScript projects. The Angular, React, and Vue implementations of tabs are coupled to each framework's router.": "特定のタブを `tab` プロパティの値または要素参照で取得する。このメソッドは vanilla JavaScript プロジェクトでのみ利用可能です。Angular、React、Vue のタブの実装は、それぞれのフレームワークのルータと結合しています。",
  "Select a tab by the value of its `tab` property or an element reference. This method is only available for vanilla JavaScript projects. The Angular, React, and Vue implementations of tabs are coupled to each framework's router.": "タブを `tab` プロパティの値または要素参照で選択する。このメソッドはバニラJavaScriptプロジェクトでのみ利用可能です。Angular、React、Vue のタブの実装は、それぞれのフレームワークのルータと結合しています。",
  "Emitted when the navigation has finished transitioning to a new component.": "ナビゲーションが新しいコンポーネントに遷移し終わったときに発行されます。",
  "Emitted when the navigation is about to transition to a new component.": "ナビゲーションが新しいコンポーネントに移行しようとするときに発行されます。",
  "Content is placed at the bottom of the screen.": "コンテンツは画面下部に配置されます。",
  "Content is placed at the top of the screen.": "コンテンツは画面上部に配置されます。",
  "If `true`, the textarea container will grow and shrink based on the contents of the textarea.": "`true`の場合、textareaコンテナはtextareaの内容に応じて拡大・縮小します。",
  "If `true`, the value will be cleared after focus upon edit.": "`true`の場合、編集時にフォーカスが当たった後、値がクリアされる。",
  "The visible width of the text control, in average character widths. If it is specified, it must be a positive integer.": "テキストコントロールの可視幅を、平均文字幅で指定します。指定する場合は、正の整数である必要があります。",
  "If `true`, the user cannot interact with the textarea.": "`true`の場合、ユーザはテキストエリアと対話することができません。",
  "Text that is placed under the textarea and displayed when an error is detected.": "テキストエリアの下に配置され、エラーが検出されたときに表示されるテキストです。",
  "Text that is placed under the textarea and displayed when no error is detected.": "textareaの下に配置され、エラーが検出されなかった場合に表示されるテキストです。",
  "The visible label associated with the textarea.  Use this if you need to render a plaintext label.  The `label` property will take priority over the `label` slot if both are used.": "textareaに関連付けられた可視ラベル。  プレーンテキストのラベルをレンダリングする必要がある場合に使用する。  両方が使用されている場合、`label` プロパティが `label` スロットよりも優先される。",
  "Where to place the label relative to the textarea. `\"start\"`: The label will appear to the left of the textarea in LTR and to the right in RTL. `\"end\"`: The label will appear to the right of the textarea in LTR and to the left in RTL. `\"floating\"`: The label will appear smaller and above the textarea when the textarea is focused or it has a value. Otherwise it will appear on top of the textarea. `\"stacked\"`: The label will appear smaller and above the textarea regardless even when the textarea is blurred or has no value. `\"fixed\"`: The label has the same behavior as `\"start\"` except it also has a fixed width. Long text will be truncated with ellipses (\"...\").": "テキストエリアと相対的にラベルを配置する場所。\"start\"`：ラベルはLTRではテキストエリアの左側に、RTLでは右側に表示されます。`\"end\"`：ラベルはLTRではテキストエリアの右側に、RTLでは左側に表示されます。\"floating\"`：ラベルは、テキストエリアにフォーカスが当たっているか、値がある場合、小さく表示され、テキストエリアの上に表示されます。それ以外の場合はtextareaの上に表示されます。`\"stacked\"`：テキストエリアがぼやけた状態や値がない場合でも、ラベルは小さく表示され、テキストエリアの上に表示されます。固定\"`：ラベルの幅が固定される以外は、`\"start\"`と同じ動作になります。長いテキストは省略記号（\"...\"）で切り捨てられます。",
  "Instructional text that shows before the input has a value.": "入力が値を持つ前に表示される指示文。",
  "The number of visible text lines for the control.": "コントロールの可視テキスト行数。",
  "The shape of the textarea. If \"round\" it will have an increased border radius.": "テキストエリアの形状を指定します。round \"の場合、ボーダーの半径が大きくなります。",
  "The value of the textarea.": "textareaの値です。",
  "Indicates how the control wraps text.": "コントロールがテキストをどのように折り返すかを示します。",
  "Returns the native `<textarea>` element used under the hood.": "要素の内部で使用されるネイティブの `<textarea>` 要素を返します。",
  "Sets focus on the native `textarea` in `ion-textarea`. Use this method instead of the global `textarea.focus()`.  See [managing focus](/docs/developing/managing-focus) for more information.": "`ion-textarea`のネイティブ `textarea` にフォーカスを設定する。グローバルメソッド `textarea.focus()` の代わりにこのメソッドを使用する。  詳細は [managing focus](/docs/developing/managing-focus) を参照してください。",
  "The `ionChange` event is fired when the user modifies the textarea's value. Unlike the `ionInput` event, the `ionChange` event is fired when the element loses focus after its value has been modified.  This event will not emit when programmatically setting the `value` property.": "onChange` イベントは、ユーザが textarea の値を変更したときに発生する。`ionInput` イベントとは異なり、`ionChange` イベントは値が変更された後に要素のフォーカスが外れたときに発生する。  このイベントは、プログラムで `value` プロパティを設定した場合には発生しない。",
  "The `ionInput` event is fired each time the user modifies the textarea's value. Unlike the `ionChange` event, the `ionInput` event is fired for each alteration to the textarea's value. This typically happens for each keystroke as the user types.  When `clearOnEdit` is enabled, the `ionInput` event will be fired when the user clears the textarea by performing a keydown event.": "`ionInput` イベントは、ユーザが textarea の値を変更するたびに発生する。`ionChange` イベントとは異なり、`ionInput` イベントは textarea の値が変更されるたびに発生する。これは通常、ユーザがキーを入力するたびに発生する。  `clearOnEdit` が有効な場合、ユーザが textarea をクリアするためにキーダウンを行うと、`ionInput` イベントが発生する。",
  "Background of the textarea": "textareaの背景",
  "Color of the border below the textarea when using helper text, error text, or counter": "ヘルパーテキスト、エラーテキスト、カウンターを使用する場合のテキストエリア下のボーダーの色",
  "Border radius of the textarea": "テキストエリアの境界半径",
  "Style of the border below the textarea when using helper text, error text, or counter": "ヘルパーテキスト、エラーテキスト、カウンター使用時のテキストエリア下のボーダーのスタイル",
  "Width of the border below the textarea when using helper text, error text, or counter": "ヘルパーテキスト、エラーテキスト、カウンターを使用する場合のテキストエリア下のボーダーの幅",
  "Color of the text": "本文の色",
  "The color of the highlight on the textarea when focused": "フォーカスされたときのテキストエリアのハイライトの色",
  "The color of the highlight on the textarea when invalid": "無効時のテキストエリア上のハイライトの色",
  "The color of the highlight on the textarea when valid": "有効時のテキストエリアのハイライトの色",
  "The height of the highlight on the textarea. Only applies to md mode.": "テキストエリアのハイライトの高さ。mdモードにのみ適用される。",
  "Bottom padding of the textarea": "テキストエリアのBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the textarea": "テキストエリアの方向が左から右の場合はRight Padding、右から左の場合はLeft Paddingを使用します。",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the textarea": "textareaの方向が左から右の場合はLeft Padding、右から左の場合はRight Padding。",
  "Top padding of the textarea": "textareaのTop Padding",
  "Color of the placeholder text": "Placeholderテキストの色",
  "Style of the placeholder text": "Placeholderテキストのスタイル",
  "Weight of the placeholder text": "Placeholderテキストの重さ",
  "Opacity of the placeholder text": "Placeholderテキストの不透明度",
  "Content to display at the trailing edge of the textarea. (EXPERIMENTAL)": "textarea の末尾に表示する内容。(実験的)",
  "The label text to associate with the textarea. Use the `labelPlacement` property to control where the label is placed relative to the textarea. Use this if you need to render a label with custom HTML. (EXPERIMENTAL)": "テキストエリアに関連付けるラベルテキスト。labelPlacement`プロパティを使用して、textareaに対するラベルの位置を制御する。ラベルをカスタム HTML でレンダリングする必要がある場合に使用します。(実験的)",
  "Content to display at the leading edge of the textarea. (EXPERIMENTAL)": "textarea の前端に表示する内容。(実験的)",
  "Border radius of the thumbnail": "サムネイルのボーダー半径",
  "Size of the thumbnail": "サムネイルの大きさ",
  "The size of the toolbar title.": "ツールバーのタイトルの大きさを指定します。",
  "Text color of the title": "タイトルの文字色",
  "If `true`, the toast will animate.": "`true`の場合、トーストはアニメーションします。",
  "An array of buttons for the toast.": "トースト用のボタンがずらり。",
  "How many milliseconds to wait before hiding the toast. By default, it will show until `dismiss()` is called.": "トーストを隠すまでに何ミリ秒待つかを指定します。デフォルトでは、`dismiss()`が呼ばれるまで表示されます。",
  "Animation to use when the toast is presented.": "乾杯の音頭をとるときに使うアニメーションです。",
  "Header to be shown in the toast.": "トーストに表示されるヘッダー。",
  "Additional attributes to pass to the toast.": "トーストに渡す追加の属性。",
  "The name of the icon to display, or the path to a valid SVG file. See `ion-icon`. https://ionic.io/ionicons": "表示するアイコンの名前、または有効なSVGファイルへのパスを指定します。ion-icon`を参照。https://ionic.io/ionicons",
  "If `true`, the toast will open. If `false`, the toast will close. Use this if you need finer grained control over presentation, otherwise just use the toastController or the `trigger` property. Note: `isOpen` will not automatically be set back to `false` when the toast dismisses. You will need to do that in your code.": "もし `true` ならば、トーストは表示されます。もし `false` ならば、トーストは閉じます。プレゼンテーションの細かい制御が必要な場合はこれを使用し、そうでない場合は toastController または `trigger` プロパティを使用してください。注意: トーストが終了しても `isOpen` は自動的に `false` に戻りません。あなたのコードでそれを行う必要があります。",
  "Defines how the message and buttons are laid out in the toast. 'baseline': The message and the buttons will appear on the same line. Message text may wrap within the message container. 'stacked': The buttons containers and message will stack on top of each other. Use this if you have long text in your buttons.": "トーストのメッセージやボタンの配置を定義します。'baseline'を指定します。メッセージとボタンは同じ行に表示されます。メッセージテキストはメッセージコンテナ内で折り返すことができます。'stacked':ボタンコンテナとメッセージが重なるように表示されます。ボタンに長いテキストがある場合に使用します。",
  "Animation to use when the toast is dismissed.": "トーストの解散時に使用するアニメーションです。",
  "Message to be shown in the toast. This property accepts custom HTML as a string. Content is parsed as plaintext by default. `innerHTMLTemplatesEnabled` must be set to `true` in the Ionic config before custom HTML can be used.": "トーストに表示するメッセージ。このプロパティは、文字列としてカスタムHTMLを受け入れます。デフォルトではコンテンツはプレーンテキストとしてパースされます。カスタムHTMLを使用するには、Ionicの設定で `innerHTMLTemplatesEnabled` を `true` に設定する必要があります。",
  "The starting position of the toast on the screen. Can be tweaked further using the `positionAnchor` property.": "画面上のトーストの開始位置。 `positionAnchor`プロパティを使ってさらに微調整できます。",
  "The element to anchor the toast's position to. Can be set as a direct reference or the ID of the element. With `position=\"bottom\"`, the toast will sit above the chosen element. With `position=\"top\"`, the toast will sit below the chosen element. With `position=\"middle\"`, the value of `positionAnchor` is ignored.": "トーストの位置を固定する要素。直接参照するか、要素のIDを指定します。position=\"bottom\"`の場合、トーストは選択した要素の上に表示されます。position=\"top\"`の場合、トーストは選択した要素の下に位置します。position=\"middle\"`の場合、`positionAnchor`の値は無視される。",
  "If set to 'vertical', the Toast can be dismissed with a swipe gesture. The swipe direction is determined by the value of the `position` property: `top`: The Toast can be swiped up to dismiss. `bottom`: The Toast can be swiped down to dismiss. `middle`: The Toast can be swiped up or down to dismiss.": "vertical'に設定すると、スワイプジェスチャーでToastを消すことができます。スワイプの方向は `position` プロパティの値によって決まります：top`：top`: 上方向にスワイプすることでトーストを消すことができます。top`: トーストを上方向にスワイプして消すことができます：top`: 上方向にスワイプするとToastが表示され、下方向にスワイプするとToastが表示されます。middle`：トーストは上下にスワイプして消すことができます。",
  "If `true`, the toast will be translucent. Only applies when the mode is `\"ios\"` and the device supports [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility).": "`true`の場合、トーストは半透明になります。modeが `\"ios\"` で、デバイスが [`backdrop-filter`](https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter#Browser_compatibility) をサポートしている場合にのみ適用されます。",
  "An ID corresponding to the trigger element that causes the toast to open when clicked.": "クリックされたときにトーストを開かせるトリガー要素に対応するID。",
  "Dismiss the toast overlay after it has been presented. This is a no-op if the overlay has not been presented yet. If you want to remove an overlay from the DOM that was never presented, use the [remove](https://developer.mozilla.org/en-US/docs/Web/API/Element/remove) method.": "Dismiss the toast overlay after it has been presented. This is a no-op if the overlay has not been presented yet. If you want to remove an overlay from the DOM that was never presented, use the [remove](https://developer.mozilla.org/en-US/docs/Web/API/Element/remove) method.",
  "Returns a promise that resolves when the toast did dismiss.": "トーストが解散したことを解決するPromiseを返します。",
  "Returns a promise that resolves when the toast will dismiss.": "トーストが解散するタイミングを解決するPromiseを返します。",
  "Present the toast overlay after it has been created.": "トーストのオーバーレイを作成した後に提示します。",
  "Emitted after the toast has dismissed. Shorthand for ionToastDidDismiss.": "トーストが終了した後に発行されます。ionToastDidDismissの略記。",
  "Emitted after the toast has presented. Shorthand for ionToastWillDismiss.": "トーストがはじまった後に発行されます。ionToastWillDismissの略語。",
  "Emitted after the toast has dismissed.": "トーストが解散した後に発行されます。",
  "Emitted after the toast has presented.": "トーストが提示された後に発行されます。",
  "Emitted before the toast has dismissed.": "乾杯が解散する前に発行されます。",
  "Emitted before the toast has presented.": "トーストが提示される前に発行されます。",
  "Emitted before the toast has dismissed. Shorthand for ionToastWillDismiss.": "トーストが終了する前に発行されます。ionToastWillDismissの略語です。",
  "Emitted before the toast has presented. Shorthand for ionToastWillPresent.": "トーストが表示される前に発行されます。ionToastWillPresentの略記。",
  "Background of the toast": "乾杯の背景",
  "Border color of the toast": "トーストのボーダーカラー",
  "Border radius of the toast": "トーストのボーダー半径",
  "Border style of the toast": "トーストのボーダースタイル",
  "Border width of the toast": "トーストのボーダー幅",
  "Box shadow of the toast": "乾杯の箱影",
  "Color of the button text": "ボタンテキストの色",
  "Color of the toast text": "トーストの文字色",
  "Position from the right if direction is left-to-right, and from the left if direction is right-to-left": "方向が左から右の場合は右から、方向が右から左の場合は左から位置すること",
  "Height of the toast": "トーストの高さ",
  "Maximum height of the toast": "トーストの最大の高さ",
  "Maximum width of the toast": "トーストの最大幅",
  "Minimum height of the toast": "トーストの最小の高さ",
  "Minimum width of the toast": "トーストの最小幅",
  "Position from the left if direction is left-to-right, and from the right if direction is right-to-left": "方向が左から右の場合は左から、方向が右から左の場合は右から位置すること",
  "White space of the toast message": "乾杯メッセージのホワイトスペース",
  "Width of the toast": "トーストの幅",
  "Any button element that is displayed inside of the toast.": "トーストの内側に表示される任意のボタン要素。",
  "Any button element with role \"cancel\" that is displayed inside of the toast.": "トーストの内側に表示される、\"cancel \"というロールを持つボタン要素。",
  "The element that wraps all child elements.": "すべての子要素を包む要素。",
  "The header text of the toast.": "乾杯のヘッダーテキストです。",
  "The icon that appears next to the toast content.": "トーストの内容の横に表示されるアイコンです。",
  "The body text of the toast.": "乾杯の音頭の本文です。",
  "How to control the alignment of the toggle and label on the cross axis. `\"start\"`: The label and control will appear on the left of the cross axis in LTR, and on the right side in RTL. `\"center\"`: The label and control will appear at the center of the cross axis in both LTR and RTL. Setting this property will change the toggle `display` to `block`.": "十字軸上のトグルとラベルの配置を制御する方法。start\"`：ラベルとコントロールはLTRでは十字軸の左側に、RTLでは右側に表示されます。center\"`：ラベルとコントロールはLTRでもRTLでも横軸の中央に表示されます。このプロパティを設定すると、トグルの `display` が `block` に変更されます。",
  "If `true`, the toggle is selected.": "`true`の場合、トグルが選択されます。",
  "If `true`, the user cannot interact with the toggle.": "`true`の場合、ユーザーはトグルを操作することができません。",
  "Enables the on/off accessibility switch labels within the toggle.": "トグル内のオン／オフアクセシビリティスイッチラベルを有効にします。",
  "Text that is placed under the toggle label and displayed when an error is detected.": "Text that is placed under the toggle label and displayed when an error is detected.",
  "Text that is placed under the toggle label and displayed when no error is detected.": "Text that is placed under the toggle label and displayed when no error is detected.",
  "How to pack the label and toggle within a line. `\"start\"`: The label and toggle will appear on the left in LTR and on the right in RTL. `\"end\"`: The label and toggle will appear on the right in LTR and on the left in RTL. `\"space-between\"`: The label and toggle will appear on opposite ends of the line with space between the two elements. Setting this property will change the toggle `display` to `block`.": "ラベルとトグルを1行にまとめる方法。start\"`：ラベルとトグルはLTRでは左に、RTLでは右に表示されます。end\"`：ラベルとトグルはLTRでは右に、RTLでは左に表示されます。space-between\"`：ラベルとトグルは行の反対側に表示され、2つの要素の間にはスペースが入ります。このプロパティを設定すると、トグルの `display` が `block` に変更されます。",
  "Where to place the label relative to the input. `\"start\"`: The label will appear to the left of the toggle in LTR and to the right in RTL. `\"end\"`: The label will appear to the right of the toggle in LTR and to the left in RTL. `\"fixed\"`: The label has the same behavior as `\"start\"` except it also has a fixed width. Long text will be truncated with ellipses (\"...\"). `\"stacked\"`: The label will appear above the toggle regardless of the direction. The alignment of the label can be controlled with the `alignment` property.": "入力に対するラベルの位置。start\"`：ラベルはLTRではトグルの左に、RTLでは右に表示されます。end\"`：ラベルはLTRではトグルの右、RTLでは左に表示されます。fixed\"`：ラベルの幅が固定される以外は `\"start\"` と同じ動作をします。長いテキストは省略記号(\"...\")で切り捨てられます。stacked\"`：ラベルは向きに関係なくトグルの上に表示されます。ラベルの整列は `alignment` プロパティで制御できます。",
  "The value of the toggle does not mean if it's checked or not, use the `checked` property for that.  The value of a toggle is analogous to the value of a `<input type=\"checkbox\">`, it's only used when the toggle participates in a native `<form>`.": "トグルの値は、チェックされているかどうかを意味するものではありません。  トグルの値は `<input type=\"checkbox\">` の値に類似しており、トグルがネイティブの `<form>` に参加する場合にのみ使用されます。",
  "Emitted when the toggle loses focus.": "トグルのフォーカスが外れたときに発行されます。",
  "Emitted when the user switches the toggle on or off.  This event will not emit when programmatically setting the `checked` property.": "ユーザがトグルのオン/オフを切り替えたときに発行される。  プログラムで `checked` プロパティを設定した場合は、このイベントは発生しない。",
  "Emitted when the toggle has focus.": "トグルにフォーカスが当たったときに発行されます。",
  "Border radius of the toggle track": "トグルトラックのボーダー半径",
  "Background of the toggle handle": "トグルハンドルの背景",
  "Background of the toggle handle when checked": "チェックしたときのトグルハンドルの背景",
  "Border radius of the toggle handle": "トグルハンドルのボーダー半径",
  "Box shadow of the toggle handle": "トグルハンドルのボックスシャドウ",
  "Height of the toggle handle": "トグルハンドルの高さ",
  "Maximum height of the toggle handle": "トグルハンドルの最大の高さ",
  "Horizontal spacing around the toggle handle": "トグルハンドル周辺の横方向の間隔",
  "Transition of the toggle handle": "トグルハンドルの変遷",
  "Width of the toggle handle": "トグルハンドルの幅",
  "Background of the toggle track": "トグルトラックの背景",
  "Background of the toggle track when checked": "チェックしたときのトグルトラックの背景",
  "The label text to associate with the toggle. Use the \"labelPlacement\" property to control where the label is placed relative to the toggle.": "トグルに関連付けるラベルテキストです。`\"labelPlacement`\"プロパティを使用して、トグルに対してラベルを配置する位置を制御します。",
  "Supporting text displayed beneath the toggle label when the toggle is invalid and touched.": "Supporting text displayed beneath the toggle label when the toggle is invalid and touched.",
  "The toggle handle, or knob, used to change the checked state.": "チェックした状態を変更するために使用するトグルハンドル（つまみ）です。",
  "Supporting text displayed beneath the toggle label when the toggle is valid.": "Supporting text displayed beneath the toggle label when the toggle is valid.",
  "The label text describing the toggle.": "トグルを説明するラベルテキスト。",
  "Supporting text displayed beneath the toggle label.": "Supporting text displayed beneath the toggle label.",
  "The background track of the toggle.": "トグルの背景トラックです。",
  "Background of the toolbar": "ツールバーの背景",
  "Color of the toolbar border": "ツールバーの枠の色",
  "Style of the toolbar border": "ツールバーのボーダーのスタイル",
  "Width of the toolbar border": "ツールバーの枠の幅",
  "Color of the toolbar text": "ツールバーテキストの色",
  "Minimum height of the toolbar": "ツールバーの最小高さ",
  "Opacity of the toolbar background": "ツールバーの背景の不透明度",
  "Bottom padding of the toolbar": "ツールバーのBottom Padding",
  "Right padding if direction is left-to-right, and left padding if direction is right-to-left of the toolbar": "ツールバーの向きが左から右の場合はRight Padding、右から左の場合はLeft Paddingを使用します。",
  "Left padding if direction is left-to-right, and right padding if direction is right-to-left of the toolbar": "ツールバーの方向が左から右の場合はLeft Padding、右から左の場合はRight Paddingを使用します。",
  "Top padding of the toolbar": "ツールバーのTop Padding",
  "Content is placed to the right of the toolbar text in LTR, and to the left in RTL.": "コンテンツは、LTRではツールバーテキストの右側に、RTLでは左側に配置されます。",
  "Content is placed to the right of the toolbar text in `ios` mode, and to the far right in `md` mode.": "コンテンツは、`ios` modeではツールバーテキストの右側に、`md` modeでは右端に配置されます。",
  "Content is placed to the left of the toolbar text in `ios` mode, and directly to the right in `md` mode.": "コンテンツは、`ios` modeではツールバーテキストの左側に、`md` modeでは右側に直接配置されます。",
  "Content is placed to the left of the toolbar text in LTR, and to the right in RTL.": "コンテンツは、LTRではツールバーテキストの左側に、RTLでは右側に配置されます。",
  "The background of the toolbar, covering the entire area behind the toolbar content.": "The background of the toolbar, covering the entire area behind the toolbar content.",
  "The container that wraps all toolbar content, including the default slot and named slot content.": "The container that wraps all toolbar content, including the default slot and named slot content.",
  "The container for the default slot, wrapping content provided without a named slot.": "The container for the default slot, wrapping content provided without a named slot."
}
