{
  "api": {
    "ion-back-button": {
      "title": "Back Button | ion-back-button: Custom Menu Icon for Applications",
      "description": "The ion-back-button is a custom menu icon for Android, iOS, and Progressive Web Apps. Use Ionic Framework components to easily build applications."
    },
    "ion-grid": {
      "title": "Ion-Grid: Display Grids to Build Mobile-First Custom App Layout",
      "description": "Ion-Grid is a mobile-first flexbox system to build custom application display layouts with a 12 column layout and different breakpoints based on screen size."
    },
    "ion-img": {
      "title": "Img Tag to Lazy Load Images in Viewport | ion-img Tag",
      "description": "Img tag lazy loads images whenever the tag is in the viewport. Utilize this component when generating large lists—as images are only loaded when visible."
    },
    "ion-label": {
      "title": "Item Label Color and Properties for Applications | ion-label",
      "description": "Label is a wrapper element that can be used in combination with other Ionic components. Easily design item label colors and other properties with ion-label."
    },
    "ion-loading": {
      "title": "Loading | Application Loading Indicator Overlay | ion-loading",
      "description": "The ion-loading overlay indicates activity while blocking user interaction. The loading indicator appears on top of the app's content, and can be dismissed."
    },
    "ion-searchbar": {
      "title": "Search Bar Icon for Keyboard Text Display | Ion-Search Bar",
      "description": "Search bars represent a text field that can be used to search through a collection. Learn to input Ion-Search Bar as an icon on Android & iOS keyboard displays."
    },
    "ion-slides": {
      "title": "Ion-Slides: Mobile Touch Slider with Built-In & Custom Animation",
      "description": "Ion-Slides is a multi-section container which offers custom and built-in mobile touch slider animation effects. See how Ion-Slides works with iOS and Android."
    },
    "ion-tabs": {
      "title": "Ion-Tabs: Tab-Based Component for App Top-Level Navigation",
      "description": "Tabs are top-level components to implement tab-based navigation. Ion-tabs have no styling & work as router outlets for navigation that behaves like native apps."
    },
    "ion-toggle": {
      "title": "Toggle | ion-toggle: Custom Toggle Button for Ionic Applications",
      "description": "Toggle changes the state of a single option. Use ion-toggle to create customizable toggle buttons that can be switched on or off for your applications."
    },
    "ion-toolbar": {
      "title": "Toolbar | Customize App Menu Toolbar Buttons and Icons",
      "description": "Ion-toolbar component lets you customize toolbar buttons on your app menu. Add fixed toolbars above or below content or use full screen to scroll with content."
    }
  },
  "cli": {
    "cordova-resources": {
      "title": "Splash Screen Image Icon Generator | Generate Cordova Resources",
      "description": "Generate perfectly-sized icons and splash screens from PNG source images for your Cordova platforms. Automatically create icons with Ionic Cordova Resources."
    },
    "cordova-platform": {
      "title": "ionic cordova platform: Remove, Add, & Manage Cordova Platforms",
      "description": "Manage, add, and remove Cordova platforms with ionic cordova platform. Like running cordova directly, with added resources and providing friendly checks."
    },
    "cordova-run": {
      "title": "ionic cordova run: native-run Android and iOS Apps in Browsers",
      "description": "Build your app and deploy it to devices and emulators using ionic cordova run. Use the native-run utility to run your app in an Android or iOS device browser."
    },
    "start": {
      "title": "How to Create A New Application with Ionic Start for New Projects",
      "description": "Learn how to create a new app project with Ionic Start. This command creates a working Ionic app that installs dependencies for you and sets up your project."
    }
  },
  "native": {
    "camera": {
      "title": "Install Camera | Cordova Plugin Cameras for Ionic Applications",
      "description": "Use the Cordova plugin to install a camera and take photos or capture videos in-app with Ionic Framework camera component for supported platforms."
    },
    "file-transfer": {
      "title": "File Transfer | Cordova Docs File Transfer Download Plugin",
      "description": "The Cordova File Transfer plug in allows you to upload and download docs files. This plugin is supported on iOS, Android, Windows, and more platforms."
    },
    "geolocation": {
      "title": "Geolocation | W3C Geolocator Application API Plugin",
      "description": "This application plugin is based on W3C Geolocation API Specification and only executes on devices that don't already provide an implementation for location."
    },
    "splash-screen": {
      "title": "Splash Screen | Cordova Splash Screen Plugin for Android & iOS",
      "description": "This Cordova plugin displays and hides a splash screen during application launch. Show and hide the splash screen after the Android or iOS app has loaded."
    }
  }
}